[{
	"courseList": [{
		"cid": "AD903",
		"kaikeList": [{
			"bsid": "373369",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东下院201(1-16周).萧冰 副教授"
		}],
		"name": "广告的力量"
	}, {
		"cid": "AR901",
		"kaikeList": [{
			"bsid": "372579",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院205(1-16周).刘士兴\n下院205(1-16周).赵冬梅\n下院205(1-16周).卢琦\n下院205(1-16周).王浩娱"
		}],
		"name": "建筑赏析"
	}, {
		"cid": "AR902",
		"kaikeList": [{
			"bsid": "373377",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n下院201(9-16周).席涛 教授\n星期四 第9节--第10节\n下院201(9-16周).席涛 教授"
		}],
		"name": "图形创意设计"
	}, {
		"cid": "AR903",
		"kaikeList": [{
			"bsid": "373381",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院212(1-11周).韩挺 副教授"
		}],
		"name": "设计创新的艺术"
	}, {
		"cid": "BI902",
		"kaikeList": [{
			"bsid": "372705",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院103(1-16周).王莲芸 教授\n东上院103(1-16周).林志新 教授\n东上院103(1-16周).蒋群 副教授"
		}],
		"name": "生命伦理学"
	}, {
		"cid": "BM901",
		"kaikeList": [{
			"bsid": "372734",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院4-205(1-16周).彭崇胜 副教授"
		}],
		"name": "中医药与中华传统文化"
	}, {
		"cid": "CH901",
		"kaikeList": [{
			"bsid": "372655",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院104(1-16周).丁晓萍 副教授"
		}],
		"name": "大学语文"
	}, {
		"cid": "CH902",
		"kaikeList": [{
			"bsid": "373950",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院2-302(1-16周).李康化 副教授"
		}],
		"name": "唐诗宋词人文解读"
	}, {
		"cid": "CH903",
		"kaikeList": [{
			"bsid": "372654",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-404(1-16周).文学武 教授"
		}],
		"name": "20世纪中国文学名著欣赏"
	}, {
		"cid": "CH904",
		"kaikeList": [{
			"bsid": "372660",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n东中院3-104(1-11周).刘元春 讲师(高校)"
		}],
		"name": "汉字文化"
	}, {
		"cid": "CH906",
		"kaikeList": [{
			"bsid": "372658",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n中院109(1-16周).张玉梅 副教授"
		}],
		"name": "古典诗词鉴赏与创作"
	}, {
		"cid": "CH911",
		"kaikeList": [{
			"bsid": "372676",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n中院107(1-16周).刘佑军 副教授"
		}],
		"name": "外国文学史(C）"
	}, {
		"cid": "CH912",
		"kaikeList": [{
			"bsid": "372666",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院108(1-16周).姚旭峰 副教授"
		}],
		"name": "历代名词人研究"
	}, {
		"cid": "CH927",
		"kaikeList": [{
			"bsid": "372681",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院204(1-16周).汪云霞 副教授"
		}],
		"name": "中国现代诗歌导读"
	}, {
		"cid": "CH929",
		"kaikeList": [{
			"bsid": "372659",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-103(1-16周).郭曙纶 副教授"
		}],
		"name": "汉语与认知：由汉语看汉民族的认知特点"
	}, {
		"cid": "CH931",
		"kaikeList": [{
			"bsid": "373359",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院302(1-16周).徐临江 讲师(高校)"
		}],
		"name": "老庄元典选读"
	}, {
		"cid": "CH932",
		"kaikeList": [{
			"bsid": "372680",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-104(1-16周).符杰祥 副教授"
		}],
		"name": "现代中国文学与文化"
	}, {
		"cid": "CL902",
		"kaikeList": [{
			"bsid": "373374",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第7节--第10节\n东下院301(1-8周).姚君喜 教授"
		}],
		"name": "中国文化的全球传播"
	}, {
		"cid": "CL907",
		"kaikeList": [{
			"bsid": "372672",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院203(1-16周).汪云霞 副教授"
		}],
		"name": "世界华文文学专题"
	}, {
		"cid": "CL909",
		"kaikeList": [{
			"bsid": "372716",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第11节--第12节\n东上院507(1-16周).施旻 副教授"
		}],
		"name": "女性文学与性别文化"
	}, {
		"cid": "CL915",
		"kaikeList": [{
			"bsid": "372717",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-402(1-16周).童剑平 副教授"
		}],
		"name": "欧洲文化导论"
	}, {
		"cid": "CL919",
		"kaikeList": [{
			"bsid": "372656",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院103(1-16周).高宣扬 教授"
		}],
		"name": "当代西方人文艺术思潮"
	}, {
		"cid": "EN901",
		"kaikeList": [{
			"bsid": "372725",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院316(1-16周).陆元雯 副教授"
		}],
		"name": "英语写作"
	}, {
		"cid": "EN903",
		"kaikeList": [{
			"bsid": "372721",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院204(1-16周).赵晓红 副教授"
		}, {
			"bsid": "372722",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n东上院504(1-16周).杨晓玲 副教授"
		}, {
			"bsid": "372723",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院504(1-16周).杨晓玲 副教授"
		}],
		"name": "英语公众演讲"
	}, {
		"cid": "EN904",
		"kaikeList": [{
			"bsid": "372718",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院4-103(1-16周).李琤 讲师(高校)"
		}],
		"name": "莎士比亚戏剧赏析"
	}, {
		"cid": "EN905",
		"kaikeList": [{
			"bsid": "372724",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院204(1-16周).李宏德 副教授"
		}],
		"name": "英语经典名作赏析"
	}, {
		"cid": "EN907",
		"kaikeList": [{
			"bsid": "372720",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院505(1-16周).卢小军 讲师(高校)"
		}],
		"name": "英国经典散文赏析"
	}, {
		"cid": "EN908",
		"kaikeList": [{
			"bsid": "372719",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院507(1-16周).张荔 副教授"
		}],
		"name": "学术英语交际:写作与发言"
	}, {
		"cid": "GA901",
		"kaikeList": [{
			"bsid": "372652",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n东中院3-202(1-11周).李玉红 副教授"
		}],
		"name": "与风景的对话——中外园林艺术欣赏"
	}, {
		"cid": "HI901",
		"kaikeList": [{
			"bsid": "372646",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东下院303(1-11周).钮卫星 教授"
		}],
		"name": "天文学史"
	}, {
		"cid": "HI903",
		"kaikeList": [{
			"bsid": "372667",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-202(1-16周).任玉雪 副教授"
		}],
		"name": "美国的文化与历史"
	}, {
		"cid": "HI904",
		"kaikeList": [{
			"bsid": "372715",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院204(1-16周).魏啸飞 教授"
		}],
		"name": "历史视野下的美国文化"
	}, {
		"cid": "HI927",
		"kaikeList": [{
			"bsid": "373358",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东上院102(1-11周).高福进 教授"
		}],
		"name": "世界文化史"
	}, {
		"cid": "HI928",
		"kaikeList": [{
			"bsid": "372669",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n中院107(1-16周).王心扬 教授"
		}],
		"name": "美国历史上的重大问题"
	}, {
		"cid": "JC903",
		"kaikeList": [{
			"bsid": "372670",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院202(1-16周).易存国 教授"
		}, {
			"bsid": "372671",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院112(1-11周).施立峻 副教授"
		}],
		"name": "美学"
	}, {
		"cid": "LI901",
		"kaikeList": [{
			"bsid": "372677",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院206(1-16周).张蕴艳 讲师(高校)"
		}],
		"name": "文学与人生"
	}, {
		"cid": "LI903",
		"kaikeList": [{
			"bsid": "374068",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院316(1-16周).何艳 副教授"
		}],
		"name": "英美名诗赏析"
	}, {
		"cid": "MU901",
		"kaikeList": [{
			"bsid": "372661",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东上院203(1-11周).胡逸薇 讲师(高校)"
		}, {
			"bsid": "372662",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东上院203(1-11周).胡逸薇 讲师(高校)"
		}, {
			"bsid": "372663",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n上院407(1-11周).李莉 讲师(高校)"
		}, {
			"bsid": "372664",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院407(1-11周).李莉 讲师(高校)"
		}],
		"name": "交响音乐鉴赏"
	}, {
		"cid": "MU902",
		"kaikeList": [{
			"bsid": "372682",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东上院107(1-11周).王茕 讲师(高校)"
		}, {
			"bsid": "372683",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院107(1-16周).王茕 讲师(高校)"
		}, {
			"bsid": "372684",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院205(1-16周).张沁 讲师(高校)"
		}, {
			"bsid": "372685",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第7节--第8节\n东中院4-304(1-16周).李金叶 副教授"
		}, {
			"bsid": "372686",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n下院407(1-16周).李金叶 副教授"
		}, {
			"bsid": "372687",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东下院104(1-11周).胡慈舟 讲师(高校)"
		}],
		"name": "中西乐理及其应用"
	}, {
		"cid": "MU903",
		"kaikeList": [{
			"bsid": "372673",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-304(1-16周).李金叶 副教授"
		}, {
			"bsid": "372674",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院407(1-16周).李金叶 副教授"
		}, {
			"bsid": "372675",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院407(1-11周).李金叶 副教授"
		}],
		"name": "世界民族音乐鉴赏"
	}, {
		"cid": "PE901",
		"kaikeList": [{
			"bsid": "373741",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).吴爱平 讲师(高校)"
		}, {
			"bsid": "373742",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).王坤 副教授"
		}, {
			"bsid": "373743",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).姚武 副教授"
		}, {
			"bsid": "373744",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).朱慧芳 副教授"
		}, {
			"bsid": "373745",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).王斌 副教授"
		}, {
			"bsid": "373746",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).范嘉浩 工程技术人员"
		}],
		"name": "体育文化"
	}, {
		"cid": "PE902",
		"kaikeList": [{
			"bsid": "373747",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).叶汉忠 讲师(高校)"
		}, {
			"bsid": "373748",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).王雅卓 讲师(高校)"
		}, {
			"bsid": "373749",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).尹梅 讲师(高校)"
		}, {
			"bsid": "373750",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).董扬 副教授"
		}, {
			"bsid": "373751",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).杨仁康 副教授"
		}, {
			"bsid": "373752",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).贺志豪 副教授"
		}],
		"name": "运动技能与健身"
	}, {
		"cid": "PI901",
		"kaikeList": [{
			"bsid": "373360",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院303(1-11周).胡涵锦 教授"
		}],
		"name": "哲学智慧与创新思维"
	}, {
		"cid": "PI906",
		"kaikeList": [{
			"bsid": "372657",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院104(1-16周).孟令兵 讲师(高校)"
		}],
		"name": "佛教与中国传统文化"
	}, {
		"cid": "PI913",
		"kaikeList": [{
			"bsid": "372678",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院104(1-16周).王晓阳 副教授"
		}],
		"name": "西方哲学史"
	}, {
		"cid": "PI916",
		"kaikeList": [{
			"bsid": "372645",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东下院105(1-16周).王延锋 讲师(高校)"
		}],
		"name": "科学哲学"
	}, {
		"cid": "PI919",
		"kaikeList": [{
			"bsid": "372679",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院105(1-16周).陈勇 讲师(高校)"
		}],
		"name": "西方哲学史"
	}, {
		"cid": "PL902",
		"kaikeList": [{
			"bsid": "372648",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院1-201(1-16周).申晓辉 研究员\n东中院1-201(1-16周).李洁 副教授\n东中院1-201(1-16周).张荻 助理研究员"
		}, {
			"bsid": "372649",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-202(1-16周).申晓辉 研究员\n东中院1-202(1-16周).李洁 副教授\n东中院1-202(1-16周).张荻 助理研究员"
		}],
		"name": "国花、市花与文化"
	}, {
		"cid": "PS907",
		"kaikeList": [{
			"bsid": "372735",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第13节\n东上院205(1-16周).张艳萍 科学研究人员(高教管理)\n东上院205(1-16周).缪青 研究实习员"
		}],
		"name": "积极心理学"
	}, {
		"cid": "SO902",
		"kaikeList": [{
			"bsid": "373366",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院302(1-16周).凌金铸 教授"
		}, {
			"bsid": "373367",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院202(1-16周).凌金铸 教授"
		}, {
			"bsid": "373368",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n东下院202(1-16周).凌金铸 教授"
		}],
		"name": "文化的魅力"
	}, {
		"cid": "SO935",
		"kaikeList": [{
			"bsid": "373380",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n下院102(9-16周).林迅 教授\n星期四 第9节--第10节\n下院102(9-16周).林迅 教授"
		}],
		"name": "艺术、媒介与创造性思维"
	}, {
		"cid": "SO939",
		"kaikeList": [{
			"bsid": "373370",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-102(1-16周).王茜 讲师(高校)"
		}],
		"name": "大众传媒与文化"
	}, {
		"cid": "TO901",
		"kaikeList": [{
			"bsid": "372653",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院102(1-11周).周丕生 副教授"
		}],
		"name": "中国的世界文化与自然遗产"
	}, {
		"cid": "WA901",
		"kaikeList": [{
			"bsid": "372726",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院305(1-11周).闫成 讲师(高校)"
		}],
		"name": "孙子兵法"
	}],
	"name": "人文学科",
	"xyid": "1"
}, {
	"courseList": [{
		"cid": "BM906",
		"kaikeList": [{
			"bsid": "372737",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第6节--第8节\n下院209(1-16周).陈斌 教授"
		}],
		"name": "性与健康"
	}, {
		"cid": "BM909",
		"kaikeList": [{
			"bsid": "372736",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院110(1-16周).徐一峰 教授"
		}],
		"name": "社会精神医学"
	}, {
		"cid": "EC903",
		"kaikeList": [{
			"bsid": "373357",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n中院107(1-16周).周泽红 副教授"
		}],
		"name": "《资本论》选读"
	}, {
		"cid": "EC905",
		"kaikeList": [{
			"bsid": "373376",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院418(1-11周).童清艳 教授"
		}],
		"name": "媒体创意经济"
	}, {
		"cid": "EV901",
		"kaikeList": [{
			"bsid": "372616",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期一 第9节--第10节\n东中院4-105(1-8周).刘书俊 副教授\n东中院4-105(1-8周).楼紫阳 副教授\n星期四 第9节--第10节\n东中院4-105(1-8周).刘书俊 副教授\n东中院4-105(1-8周).楼紫阳 副教授"
		}],
		"name": "环境与可持续发展"
	}, {
		"cid": "LA910",
		"kaikeList": [{
			"bsid": "373364",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院306(1-11周).杨力 教授"
		}],
		"name": "法律思维与法学经典阅读"
	}, {
		"cid": "LA911",
		"kaikeList": [{
			"bsid": "373362",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院312(1-16周).范进学 教授"
		}],
		"name": "法律与道德"
	}, {
		"cid": "LA913",
		"kaikeList": [{
			"bsid": "373363",
			"time": "(6-16周)\n行课安排为第6周 --- 第16周,其中:\n星期二 第6节--第8节\n东下院302(6-16周).王先林 教授\n东下院302(6-16周).李剑 教授\n东下院302(6-16周).侯利阳 副教授"
		}],
		"name": "经济与法律"
	}, {
		"cid": "LA915",
		"kaikeList": [{
			"bsid": "373365",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院108(1-16周).张绍谦 教授"
		}],
		"name": "刑法与生活"
	}, {
		"cid": "LA925",
		"kaikeList": [{
			"bsid": "373361",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院210(1-11周).胡加祥 教授"
		}],
		"name": "经济全球化与中国的崛起"
	}, {
		"cid": "PS908",
		"kaikeList": [{
			"bsid": "372631",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-205(1-16周).陈景秋 副教授"
		}],
		"name": "管理心理学"
	}, {
		"cid": "PU902",
		"kaikeList": [{
			"bsid": "372592",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院402(1-16周).周建国 副教授"
		}],
		"name": "当代中国社会问题"
	}, {
		"cid": "PU906",
		"kaikeList": [{
			"bsid": "373375",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-104(1-16周).闻媛 副教授"
		}],
		"name": "经济与社会伦理"
	}, {
		"cid": "PU907",
		"kaikeList": [{
			"bsid": "372595",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-104(1-16周).郭俊华 教授"
		}],
		"name": "公共政策与公民生活"
	}, {
		"cid": "PU908",
		"kaikeList": [{
			"bsid": "372603",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院102(1-16周).张学昆 讲师(高校)"
		}],
		"name": "中俄关系的演变与展望"
	}, {
		"cid": "PU909",
		"kaikeList": [{
			"bsid": "372599",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院206(1-16周).翟新 教授"
		}],
		"name": "现代日本政治"
	}, {
		"cid": "PU910",
		"kaikeList": [{
			"bsid": "372590",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院209(1-16周).王郁 教授\n上院209(1-16周).吴建南 教授"
		}],
		"name": "城市文明的历史与未来"
	}, {
		"cid": "PU914",
		"kaikeList": [{
			"bsid": "372593",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院101(1-11周).郑华 教授"
		}],
		"name": "当代中国外交"
	}, {
		"cid": "PU917",
		"kaikeList": [{
			"bsid": "372601",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院306(1-16周).黄琪轩 副教授"
		}],
		"name": "政治经济学经典导读"
	}, {
		"cid": "PU936",
		"kaikeList": [{
			"bsid": "372597",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院506(1-16周).吴清 副教授"
		}],
		"name": "民族主义与族群政治"
	}, {
		"cid": "PU937",
		"kaikeList": [{
			"bsid": "372591",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院103(1-16周).李明明 副教授"
		}],
		"name": "大国战略"
	}, {
		"cid": "PU938",
		"kaikeList": [{
			"bsid": "372602",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院102(1-16周).章伟 讲师(高校)"
		}],
		"name": "治理之善：公共行政热点解析"
	}, {
		"cid": "PU941",
		"kaikeList": [{
			"bsid": "372596",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院100(1-16周).卢永彬 讲师(高校)"
		}],
		"name": "领导力学习与实践"
	}, {
		"cid": "PU942",
		"kaikeList": [{
			"bsid": "372600",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院212(1-16周).魏英杰 讲师(高校)"
		}],
		"name": "政治的边界与逻辑"
	}, {
		"cid": "PU943",
		"kaikeList": [{
			"bsid": "372633",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院205(1-16周).黄丞 副教授"
		}],
		"name": "中国医疗保险制度的转型发展与创新"
	}, {
		"cid": "PU981",
		"kaikeList": [{
			"bsid": "373356",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院305(1-16周).周国华 副教授"
		}],
		"name": "组织文化研究"
	}, {
		"cid": "SO900",
		"kaikeList": [{
			"bsid": "372632",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院110(1-11周).史清华 教授"
		}],
		"name": "社会学"
	}, {
		"cid": "SO923",
		"kaikeList": [{
			"bsid": "373372",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院411(1-16周).谢金文 教授"
		}],
		"name": "新闻媒介与社会"
	}, {
		"cid": "SO936",
		"kaikeList": [{
			"bsid": "372634",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).侯士兵 副教授(高校思政)"
		}, {
			"bsid": "372635",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n上院107(1-16周).沈延兵 副教授(高校思政)"
		}, {
			"bsid": "372636",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院107(1-16周).任祝景 讲师(高校思政)"
		}, {
			"bsid": "372637",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院107(1-16周).鲁佳铭 讲师(高校思政)"
		}, {
			"bsid": "372638",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n上院322(1-16周).阮海涛 副教授(高校思政)"
		}, {
			"bsid": "372639",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院322(1-16周).薛云云 讲师(高校思政)"
		}, {
			"bsid": "372640",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院402(1-16周).尚建辉 讲师(高校思政)"
		}, {
			"bsid": "372641",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院422(1-16周).钱静峰 副教授(高校思政)"
		}, {
			"bsid": "372642",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院322(1-16周).刘燕芳 助教(高校思政)"
		}, {
			"bsid": "372643",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院311(1-16周).宋玲 讲师(高校思政)"
		}, {
			"bsid": "372644",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n中院506(1-16周).吴海燕 讲师(高校思政)"
		}],
		"name": "职业生涯发展与规划"
	}, {
		"cid": "SO937",
		"kaikeList": [{
			"bsid": "372594",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院405(1-16周).张录法 副教授"
		}],
		"name": "风险与社会保障"
	}, {
		"cid": "SO938",
		"kaikeList": [{
			"bsid": "373371",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院306(1-16周).���昊 副研究员"
		}],
		"name": "大众传播与社会问题"
	}, {
		"cid": "SO940",
		"kaikeList": [{
			"bsid": "372598",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第11节--第13节\n上院422(1-11周).杜江勤 讲师(高校)\n上院422(1-11周).吴建南 教授"
		}],
		"name": "社会科学研究方法"
	}],
	"name": "社会科学",
	"xyid": "2"
}, {
	"courseList": [{
		"cid": "AB901",
		"kaikeList": [{
			"bsid": "372650",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院307(1-16周).曹林奎 教授"
		}],
		"name": "现代农业与生态文明"
	}, {
		"cid": "AM904",
		"kaikeList": [{
			"bsid": "372574",
			"time": "(2-9周)\n行课安排为第2周 --- 第9周,其中:\n星期二 第7节--第8节\n东上院307(2-9周).周岱 教授\n星期四 第9节--第10节\n东上院307(2-9周).周岱 教授"
		}],
		"name": "工程可持续发展"
	}, {
		"cid": "BI001",
		"kaikeList": [{
			"bsid": "372691",
			"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期二 第11节--第13节\n下院206(2-12周).林志新 教授\n下院206(2-12周).柳向龙 讲师(高校)"
		}, {
			"bsid": "372692",
			"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期二 第6节--第8节\n下院309(2-12周).陈峰 副教授"
		}, {
			"bsid": "372693",
			"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期一 第3节--第5节\n东上院106(2-12周).马伟 副教授"
		}, {
			"bsid": "372696",
			"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期四 第6节--第8节\n下院205(2-12周).柳向龙 讲师(高校)"
		}, {
			"bsid": "372697",
			"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期五 第11节--第13节\n下院208(2-12周).柳向龙 讲师(高校)"
		}],
		"name": "生命科学导论"
	}, {
		"cid": "BI901",
		"kaikeList": [{
			"bsid": "373951",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院201(1-16周).孟和 教授"
		}],
		"name": "生命科学发展史"
	}, {
		"cid": "BI903",
		"kaikeList": [{
			"bsid": "372699",
			"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期二 第7节--第10节\n.(7-15周).曹阳 高级实验师"
		}, {
			"bsid": "372700",
			"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期四 第7节--第10节\n.(7-15周).曹阳 高级实验师"
		}, {
			"bsid": "372701",
			"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期五 第7节--第10节\n.(7-15周).曹阳 高级实验师"
		}, {
			"bsid": "372702",
			"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期二 第7节--第10节\n.(7-15周).郑有丽 工程师"
		}, {
			"bsid": "372703",
			"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期四 第7节--第10节\n.(7-15周).秦敏君 实验师"
		}, {
			"bsid": "372704",
			"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期五 第7节--第10节\n.(7-15周).何丽明 实验师"
		}],
		"name": "生命科学实验探索"
	}, {
		"cid": "BI905",
		"kaikeList": [{
			"bsid": "372689",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院207(1-16周).褚建君 副教授"
		}],
		"name": "地球生命"
	}, {
		"cid": "BI907",
		"kaikeList": [{
			"bsid": "372731",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院107(1-16周).李大伟 教授"
		}],
		"name": "基因与人"
	}, {
		"cid": "BI911",
		"kaikeList": [{
			"bsid": "372706",
			"time": "(3-13周)\n行课安排为第3周 --- 第13周,其中:\n星期一 第6节--第8节\n东中院3-402(3-13周).张雪洪 教授\n东中院3-402(3-13周).王威 副教授"
		}],
		"name": "生物工程导论"
	}, {
		"cid": "BI912",
		"kaikeList": [{
			"bsid": "372651",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院208(1-11周).陈火英 教授\n上院208(1-11周).葛海燕 实验师"
		}],
		"name": "遗传学与社会"
	}, {
		"cid": "BI915",
		"kaikeList": [{
			"bsid": "372707",
			"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期一 第6节--第8节\n下院307(2-12周).陈峰 副教授\n下院307(2-12周).梁如冰 副研究员"
		}],
		"name": "微生物的世界"
	}, {
		"cid": "BI917",
		"kaikeList": [{
			"bsid": "372732",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院507(1-16周).殷明 教授\n东上院507(1-16周).赵文娟 副研究员"
		}],
		"name": "脑与日常行为"
	}, {
		"cid": "BM902",
		"kaikeList": [{
			"bsid": "372733",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n东下院502(1-8周).钱秀萍 副教授\n东下院502(1-8周).毛文伟 副教授\n东下院502(1-8周).徐蓉 讲师(高校)\n星期四 第9节--第10节\n东下院502(1-8周).钱秀萍 副教授\n东下院502(1-8周).毛文伟 副教授\n东下院502(1-8周).徐蓉 讲师(高校)"
		}],
		"name": "药物发展——延续生命的奥秘"
	}, {
		"cid": "BM903",
		"kaikeList": [{
			"bsid": "372688",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n东上院302(1-11周).王莲芸 教授"
		}],
		"name": "大学生健康导论"
	}, {
		"cid": "CA901",
		"kaikeList": [{
			"bsid": "372604",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院106(1-16周).李梅 副研究员(高教管理)"
		}, {
			"bsid": "372605",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院109(1-16周).陈虹锦 教授\n中院109(1-16周).韩莉 副教授"
		}, {
			"bsid": "372606",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院109(1-16周).韩莉 副教授"
		}, {
			"bsid": "372607",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院108(1-16周).马荔 副教授"
		}, {
			"bsid": "372608",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院106(1-16周).王新灵 教授"
		}],
		"name": "大学化学"
	}, {
		"cid": "CA902",
		"kaikeList": [{
			"bsid": "372612",
			"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期四 第6节--第8节\n中院109(2-13周).韩莉 副教授"
		}, {
			"bsid": "372613",
			"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期五 第6节--第8节\n中院109(2-13周).韩莉 副教授"
		}, {
			"bsid": "372614",
			"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期四 第6节--第8节\n中院109(2-13周).张卫 副教授"
		}, {
			"bsid": "372615",
			"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期五 第6节--第8节\n中院109(2-13周).张卫 副教授"
		}],
		"name": "在实验中探究化学"
	}, {
		"cid": "CA903",
		"kaikeList": [{
			"bsid": "372610",
			"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期四 第6节--第8节\n.(2-13周).谢少艾 高级工程师"
		}],
		"name": "化学问题的实验研究"
	}, {
		"cid": "CA904",
		"kaikeList": [{
			"bsid": "372609",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-202(1-16周).陈先阳 副教授"
		}],
		"name": "公共危机中的化学"
	}, {
		"cid": "CS902",
		"kaikeList": [{
			"bsid": "372582",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院103(1-16周).陆朝俊 副教授"
		}, {
			"bsid": "372583",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院203(1-16周).陆朝俊 副教授"
		}, {
			"bsid": "372584",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东上院203(1-16周).黄林鹏 教授"
		}, {
			"bsid": "372585",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院205(1-16周).张媛媛 助理研究员"
		}],
		"name": "程序设计思想与方法"
	}, {
		"cid": "EI901",
		"kaikeList": [{
			"bsid": "372586",
			"time": "(3-13周)\n行课安排为第3周 --- 第13周,其中:\n星期二 第6节--第8节\n中院200(3-13周).张峰 教授\n中院200(3-13周).殳国华 副教授\n中院200(3-13周).乔树通 讲师(高校)"
		}],
		"name": "工程实践与科技创新I"
	}, {
		"cid": "ES901",
		"kaikeList": [{
			"bsid": "372588",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院306(1-16周).杨杰 教授\n东上院306(1-16周).姚莉秀 副教授"
		}],
		"name": "智能信息处理"
	}, {
		"cid": "IN901",
		"kaikeList": [{
			"bsid": "372713",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n.(1-11周).范秀凤 副研究馆员\n.(1-11周).潘卫 研究馆员\n.(1-11周).宋海艳 馆员"
		}, {
			"bsid": "372714",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n.(1-11周).余晓蔚 副研究馆员\n.(1-11周).汤莉华 副研究馆员\n.(1-11周).付佳佳 副研究馆员"
		}],
		"name": "信息素养与实践"
	}, {
		"cid": "ME901",
		"kaikeList": [{
			"bsid": "372589",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).张培艳 副研究员"
		}],
		"name": "工程技术探究"
	}, {
		"cid": "ME903",
		"kaikeList": [{
			"bsid": "372620",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院312(1-16周).陈泳 副教授"
		}, {
			"bsid": "372621",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院303(1-11周).张执南 助理研究员"
		}, {
			"bsid": "372622",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-204(1-16周).王玉璋 副教授"
		}, {
			"bsid": "372623",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院304(1-11周).戴旭东 讲师(高校)"
		}, {
			"bsid": "372624",
			"time": "(5-15周)\n行课安排为第5周 --- 第15周,其中:\n星期二 第6节--第8节\n东上院308(5-15周).孟祥慧 副研究员"
		}, {
			"bsid": "372627",
			"time": "(5-15周)\n行课安排为第5周 --- 第15周,其中:\n星期二 第6节--第8节\n东中院4-203(5-15周).费燕琼 副教授"
		}],
		"name": "创新思维与现代设计"
	}, {
		"cid": "ME904",
		"kaikeList": [{
			"bsid": "372626",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院310(1-16周).杨培中 教授"
		}, {
			"bsid": "372628",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院106(1-16周).宋健 讲师(高校)"
		}],
		"name": "形象思维与工程语言"
	}, {
		"cid": "ME905",
		"kaikeList": [{
			"bsid": "372580",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院302(1-16周).陈俐 副教授"
		}, {
			"bsid": "372581",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院303(1-16周).林志良 副教授"
		}],
		"name": "力学仿生－启示与探索"
	}, {
		"cid": "MI901",
		"kaikeList": [{
			"bsid": "372587",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-102(1-16周).陶卫 副教授"
		}],
		"name": "信息与感知"
	}, {
		"cid": "MT903",
		"kaikeList": [{
			"bsid": "372558",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院305(1-16周).赵斌元\n东上院305(1-16周).胡晓斌\n东上院305(1-16周).刘庆雷\n东上院305(1-16周).宁月生"
		}],
		"name": "材料美学"
	}, {
		"cid": "MT904",
		"kaikeList": [{
			"bsid": "373373",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第7节--第8节\n东上院307(1-16周).丁希凡 副教授\n东上院307(1-16周).金明江 讲师(高校)\n东上院307(1-16周).金学军 教授"
		}],
		"name": "科学与艺术-材料科学与设计艺术"
	}, {
		"cid": "MT906",
		"kaikeList": [{
			"bsid": "372630",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n上院307(1-16周).程先华 教授"
		}],
		"name": "走进纳米科学"
	}, {
		"cid": "NT901",
		"kaikeList": [{
			"bsid": "372629",
			"time": "(5-12周)\n行课安排为第5周 --- 第12周,其中:\n星期一 第9节--第10节\n东中院1-203(5-12周).雷敏 副教授\n星期四 第9节--第10节\n东中院1-203(5-12周).雷敏 副教授"
		}],
		"name": "自然界中的混沌与分岔"
	}, {
		"cid": "NU920",
		"kaikeList": [{
			"bsid": "372625",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-205(1-16周).王德忠 教授"
		}],
		"name": "辐射及应用"
	}, {
		"cid": "OC901",
		"kaikeList": [{
			"bsid": "372576",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院102(1-11周).曾一非 副教授"
		}, {
			"bsid": "372577",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院101(1-11周).徐航 副研究员"
		}, {
			"bsid": "372578",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院103(1-11周).徐雪松 讲师(高校)"
		}],
		"name": "海洋学导论"
	}, {
		"cid": "OC902",
		"kaikeList": [{
			"bsid": "372575",
			"time": "(3-10周)\n行课安排为第3周 --- 第10周,其中:\n星期一 第9节--第10节\n下院304(3-10周).胡志强 副教授\n星期四 第9节--第10节\n下院304(3-10周).胡志强 副教授"
		}],
		"name": "海洋可再生能源"
	}, {
		"cid": "PH902",
		"kaikeList": [{
			"bsid": "372729",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n下院413(1-16周).徐海光 教授"
		}, {
			"bsid": "372730",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院313(1-16周).徐海光 教授"
		}],
		"name": "宇宙与人类"
	}, {
		"cid": "PH903",
		"kaikeList": [{
			"bsid": "372727",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-102(1-16周).顾卫华 讲师(高校)"
		}],
		"name": "量子波澜：历史与概念"
	}, {
		"cid": "PH905",
		"kaikeList": [{
			"bsid": "372739",
			"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期二 第11节--第13节\n.(2-12周).周红 副教授"
		}],
		"name": "从物理实验看世界"
	}, {
		"cid": "PH906",
		"kaikeList": [{
			"bsid": "372728",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n单周\n星期二 第9节--第10节\n下院208(1-16周).卢文发 教授\n星期四 第9节--第10节\n下院208(1-16周).卢文发 教授\n双周\n星期二 第9节--第10节\n下院208(1-16周).卢文发 教授"
		}],
		"name": "量子力学"
	}, {
		"cid": "PO901",
		"kaikeList": [{
			"bsid": "373952",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院110(1-11周).黄震 教授"
		}],
		"name": "低碳能源"
	}, {
		"cid": "PO903",
		"kaikeList": [{
			"bsid": "372611",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-203(1-16周).房建华 副教授"
		}],
		"name": "清洁能源技术：原理与应用"
	}, {
		"cid": "SO922",
		"kaikeList": [{
			"bsid": "372617",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东下院106(1-16周).邵嘉慧 教授\n东下院106(1-16周).张小凡 副教授\n东下院106(1-16周).孙承兴 讲师(高校)"
		}, {
			"bsid": "372618",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东下院104(1-16周).周伟丽 副研究员\n东下院104(1-16周).袁涛 副教授\n东下院104(1-16周).no 孙承兴 讲师(高校)"
		}, {
			"bsid": "372619",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东下院105(1-16周).no 孙承兴 讲师(高校)\n东下院105(1-16周).no 袁涛 副教授\n东下院105(1-16周).no 周伟丽 副研究员"
		}],
		"name": "人与环境"
	}, {
		"cid": "SY901",
		"kaikeList": [{
			"bsid": "372647",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院108(1-11周).黄丹 副研究员"
		}],
		"name": "系统思考与科学决策"
	}],
	"name": "自然科学与工程技术",
	"xyid": "3"
}, {
	"courseList": [{
		"cid": "LO901",
		"kaikeList": [{
			"bsid": "373355",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院402(1-16周).黄伟力 教授"
		}],
		"name": "推理与思维训练"
	}, {
		"cid": "MA902",
		"kaikeList": [{
			"bsid": "372712",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院501(1-16周).孙祝岭 副教授"
		}],
		"name": "统计原理"
	}, {
		"cid": "MA905",
		"kaikeList": [{
			"bsid": "372711",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东上院105(1-16周).肖柳青 副教授"
		}],
		"name": "随机模拟方法与应用"
	}, {
		"cid": "MA906",
		"kaikeList": [{
			"bsid": "372710",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n下院310(9-16周).沈灏 教授\n星期四 第9节--第10节\n下院310(9-16周).沈灏 ���授"
		}],
		"name": "数学与科技进步"
	}, {
		"cid": "MA908",
		"kaikeList": [{
			"bsid": "372708",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n上院411(1-16周).张跃辉 副教授"
		}],
		"name": "数学的天空"
	}, {
		"cid": "MA911",
		"kaikeList": [{
			"bsid": "372709",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院404(1-16周).周钢 副教授"
		}],
		"name": "数学史"
	}],
	"name": "数学或逻辑学",
	"xyid": "4"
}]