[{
	"courseList": [{
		"cid": "AM904",
		"kaikeList": [],
		"name": "工程可持续发展"
	}, {
		"cid": "AR901",
		"kaikeList": [],
		"name": "建筑赏析"
	}, {
		"cid": "AV012",
		"kaikeList": [{
			"bsid": "372773",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-103(1-16周).张卫刚 教授\n东中院3-103(1-16周).蔡晓静 助理工程师\n东中院3-103(1-16周).杨凤鹏 副研究员"
		}, {
			"bsid": "372774",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-102(1-16周).余征跃 高级工程师\n东中院4-102(1-16周).陈玉坤 高级工程师\n东中院4-102(1-16周).杨英强 工程师"
		}],
		"name": "力学改变生活"
	}, {
		"cid": "EM024",
		"kaikeList": [{
			"bsid": "372772",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n.(1-11周).孙峰 高级工程师"
		}],
		"name": "材料力学实验探究"
	}, {
		"cid": "ME069",
		"kaikeList": [{
			"bsid": "372776",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院303(9-16周).胡文蓉 副教授"
		}],
		"name": "偷师大自然－－动物仿生学"
	}, {
		"cid": "ME905",
		"kaikeList": [],
		"name": "力学仿生－启示与探索"
	}, {
		"cid": "NA002",
		"kaikeList": [{
			"bsid": "372775",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院309(1-16周).汪淳 副教授"
		}],
		"name": "潜水器设计"
	}, {
		"cid": "OC901",
		"kaikeList": [],
		"name": "海洋学导论"
	}, {
		"cid": "OC902",
		"kaikeList": [],
		"name": "海洋可再生能源"
	}, {
		"cid": "SP171",
		"kaikeList": [],
		"name": "新船型研究与探索"
	}, {
		"cid": "SP208",
		"kaikeList": [],
		"name": "土木建筑与可持续发展"
	}],
	"name": "船舶海洋与建筑工程学院",
	"xyid": "01000"
}, {
	"courseList": [{
		"cid": "AU004",
		"kaikeList": [{
			"bsid": "372815",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-204(1-16周).马春翔 副教授"
		}],
		"name": "灰色系统理论及应用"
	}, {
		"cid": "AV001",
		"kaikeList": [{
			"bsid": "372811",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-301(1-16周).康小明 副教授"
		}],
		"name": "航空航天概论"
	}, {
		"cid": "AV013",
		"kaikeList": [{
			"bsid": "372828",
			"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期一 第9节--第10节\n东上院501(1-12周).陈勇 讲师(高校)\n星期四 第9节--第10节\n东上院501(1-12周).陈勇 讲师(高校)"
		}],
		"name": "现代航空发动机技术"
	}, {
		"cid": "AV016",
		"kaikeList": [{
			"bsid": "373426",
			"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期一 第9节--第10节\n东中院4-502(1-12周).杨波 副教授\n星期四 第9节--第10节\n东中院4-502(1-12周).杨波 副教授"
		}],
		"name": "空气动力学与翼型基础理论及应用"
	}, {
		"cid": "BE403",
		"kaikeList": [{
			"bsid": "372816",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第7节--第10节\n下院103(1-8周).姚晔 副教授"
		}],
		"name": "空气污染控制与洁净技术"
	}, {
		"cid": "CS013",
		"kaikeList": [{
			"bsid": "372807",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-302(1-16周).郑宇 工程师"
		}],
		"name": "VB编程技术"
	}, {
		"cid": "EM025",
		"kaikeList": [{
			"bsid": "373495",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院201(1-11周).黄煜 讲师(高校)"
		}],
		"name": "人体振动学"
	}, {
		"cid": "EV009",
		"kaikeList": [{
			"bsid": "372813",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院104(1-16周).江治 副教授"
		}],
		"name": "环境工程导论（A类）"
	}, {
		"cid": "EV039",
		"kaikeList": [{
			"bsid": "372814",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-302(1-16周).黄修长 副研究员"
		}],
		"name": "环境工程概论"
	}, {
		"cid": "IO005",
		"kaikeList": [{
			"bsid": "372825",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-202(1-16周).齐臣坤 助理研究员"
		}],
		"name": "系统建模方法与应用"
	}, {
		"cid": "MA500",
		"kaikeList": [{
			"bsid": "372817",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院1-204(1-16周).马春翔 副教授"
		}],
		"name": "模糊数学及其应用"
	}, {
		"cid": "ME041",
		"kaikeList": [{
			"bsid": "372823",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院303(1-16周).张定国 副教授"
		}],
		"name": "生物与机器人学"
	}, {
		"cid": "ME054",
		"kaikeList": [{
			"bsid": "372809",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-303(1-16周).张希 副研究员"
		}],
		"name": "电动汽车技术革命"
	}, {
		"cid": "ME076",
		"kaikeList": [{
			"bsid": "372830",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院506(1-16周).张建龙 助理研究员"
		}],
		"name": "新能源汽车概论"
	}, {
		"cid": "ME078",
		"kaikeList": [{
			"bsid": "372808",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-202(1-16周).齐臣坤 助理研究员"
		}],
		"name": "步行机器人"
	}, {
		"cid": "ME079",
		"kaikeList": [{
			"bsid": "372831",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-304(9-16周).管西强 讲师(高校)\n星期四 第9节--第10节\n东中院4-304(9-16周).管西强 讲师(高校)"
		}],
		"name": "宇宙探索:透视月球和火星探测车"
	}, {
		"cid": "ME087",
		"kaikeList": [{
			"bsid": "373389",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-102(1-16周).陶建峰 副教授"
		}],
		"name": "电液伺服控制理论与实践"
	}, {
		"cid": "ME088",
		"kaikeList": [{
			"bsid": "373428",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院403(1-16周).朱磊 讲师(高校)"
		}],
		"name": "现代汽车技术赏析"
	}, {
		"cid": "ME323",
		"kaikeList": [{
			"bsid": "372993",
			"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期六 第1节--第4节\n.(1-12周).郭为忠 教授"
		}],
		"name": "机电一体化课程设计"
	}, {
		"cid": "ME345",
		"kaikeList": [{
			"bsid": "372965",
			"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期二 第7节--第10节\n中院104(1-12周).赵亦希 副教授\n中院104(1-12周).李淑慧 教授"
		}],
		"name": "工程材料"
	}, {
		"cid": "ME351",
		"kaikeList": [{
			"bsid": "372810",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院409(1-16周).张晓云 副教授"
		}],
		"name": "工程应用软件(1) (CAD-UG)"
	}, {
		"cid": "ME372",
		"kaikeList": [{
			"bsid": "372978",
			"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期六 第1节--第2节\n.(1-12周).王倩 助理研究员"
		}],
		"name": "机械与动力综合实验I-B"
	}, {
		"cid": "ME903",
		"kaikeList": [],
		"name": "创新思维与现代设计"
	}, {
		"cid": "ME904",
		"kaikeList": [],
		"name": "形象思维与工程语言"
	}, {
		"cid": "MT016",
		"kaikeList": [{
			"bsid": "372826",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院203(1-16周).蒋峰景 副研究员"
		}],
		"name": "先进材料与新能源技术"
	}, {
		"cid": "MT906",
		"kaikeList": [],
		"name": "走进纳米科学"
	}, {
		"cid": "NT901",
		"kaikeList": [],
		"name": "自然界中的混沌与分岔"
	}, {
		"cid": "NU004",
		"kaikeList": [{
			"bsid": "372812",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-103(1-16周).俎建华 副研究员"
		}],
		"name": "核化学及核技术应用"
	}, {
		"cid": "NU006",
		"kaikeList": [{
			"bsid": "373425",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-203(9-16周).刘瑞芹 讲师(高校)\n星期五 第9节--第10节\n东中院1-203(9-16周).刘瑞芹 讲师(高校)"
		}],
		"name": "核辐射防护基础"
	}, {
		"cid": "NU008",
		"kaikeList": [{
			"bsid": "373429",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n下院404(1-16周).饶德林 讲师(高校)"
		}],
		"name": "辐射与核能发展史"
	}, {
		"cid": "NU403",
		"kaikeList": [{
			"bsid": "372827",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院506(1-16周).熊珍琴 助理研究员"
		}],
		"name": "先进核能系统"
	}, {
		"cid": "NU920",
		"kaikeList": [],
		"name": "辐射及应用"
	}, {
		"cid": "PO010",
		"kaikeList": [{
			"bsid": "372819",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院204(1-16周).江治 副教授"
		}],
		"name": "能源与环境系统工程导论"
	}, {
		"cid": "PO012",
		"kaikeList": [{
			"bsid": "372829",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院403(1-16周).于立军 教授"
		}],
		"name": "新能源发电技术"
	}, {
		"cid": "PO018",
		"kaikeList": [{
			"bsid": "372824",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院305(1-16周).李廷贤 副教授"
		}],
		"name": "太阳能集热、储热及热利用技术"
	}, {
		"cid": "PO026",
		"kaikeList": [{
			"bsid": "372818",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-305(1-16周).余晴春 副教授"
		}],
		"name": "能量储存技术"
	}, {
		"cid": "PO027",
		"kaikeList": [{
			"bsid": "372822",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-104(1-16周).胡鸣若 副教授"
		}],
		"name": "燃料电池发电机"
	}, {
		"cid": "PO029",
		"kaikeList": [{
			"bsid": "373427",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-301(1-16周).刘训臣\n东中院1-301(1-16周).周忠岳 讲师(高校)"
		}],
		"name": "燃烧诊断技术概论"
	}, {
		"cid": "PO202",
		"kaikeList": [{
			"bsid": "372820",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-304(1-16周).李新令 助理研究员"
		}, {
			"bsid": "372821",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东上院505(1-11周).乔信起 教授"
		}],
		"name": "能源与可持续发展"
	}, {
		"cid": "PO901",
		"kaikeList": [],
		"name": "低碳能源"
	}, {
		"cid": "SO091",
		"kaikeList": [{
			"bsid": "373430",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-404(1-16周).胡小军 讲师(高校)"
		}],
		"name": "互联网+社会物理学"
	}, {
		"cid": "SP008",
		"kaikeList": [],
		"name": "自然界中的混沌与分岔"
	}, {
		"cid": "SP062",
		"kaikeList": [],
		"name": "航空航天技术历史与展望"
	}, {
		"cid": "SP083",
		"kaikeList": [],
		"name": "神奇的催化剂—新能源开发和环境净化中的催化技术"
	}, {
		"cid": "SP091",
		"kaikeList": [],
		"name": "核能与环境"
	}, {
		"cid": "SP147",
		"kaikeList": [],
		"name": "汽车文化与设计哲学"
	}, {
		"cid": "SP153",
		"kaikeList": [],
		"name": "核燃料循环"
	}, {
		"cid": "SP154",
		"kaikeList": [],
		"name": "纳米科技与未来世界"
	}, {
		"cid": "SP155",
		"kaikeList": [],
		"name": "奇妙的低温世界"
	}, {
		"cid": "SP190",
		"kaikeList": [],
		"name": "绝对零度的奇迹：超流与超导"
	}, {
		"cid": "SP216",
		"kaikeList": [],
		"name": "全球天然气发展与展望"
	}, {
		"cid": "SP233",
		"kaikeList": [],
		"name": "能量转换——从瓦特蒸汽机到燃气轮机"
	}, {
		"cid": "SP246",
		"kaikeList": [],
		"name": "先进核能系统材料：挑战与展望"
	}],
	"name": "机械与动力工程学院",
	"xyid": "02000"
}, {
	"courseList": [],
	"name": "工业工程与物流工程系",
	"xyid": "02400"
}, {
	"courseList": [],
	"name": "航空航天工程系",
	"xyid": "02500"
}, {
	"courseList": [{
		"cid": "CS050",
		"kaikeList": [{
			"bsid": "373382",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院102(1-16周).董笑菊 副教授"
		}],
		"name": "数据可视化和可视分析"
	}, {
		"cid": "CS079",
		"kaikeList": [{
			"bsid": "372785",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院103(1-16周).刁训娣 助理研究员"
		}],
		"name": "金融建模及其R软件实例分析"
	}, {
		"cid": "CS902",
		"kaikeList": [],
		"name": "程序设计思想与方法"
	}, {
		"cid": "EI017",
		"kaikeList": [{
			"bsid": "372782",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院407(1-16周).谢宝昌 副教授"
		}],
		"name": "机电能量转换与思维方式"
	}, {
		"cid": "EI228",
		"kaikeList": [{
			"bsid": "372778",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第9节--第10节\n.(1-16周).张士文 讲师(高校)\n.(1-16周).殳国华 副教授"
		}],
		"name": "工程实践与科技创新Ⅱ-B"
	}, {
		"cid": "EI312",
		"kaikeList": [{
			"bsid": "372779",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第7节--第8节\n.(1-16周).张士文 讲师(高校)\n.(1-16周).殳国华 副教授"
		}],
		"name": "工程实践与科技创新Ⅲ-C"
	}, {
		"cid": "EI401",
		"kaikeList": [{
			"bsid": "372780",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第1节--第2节\n.(1-16周).张士文 讲师(高校)\n.(1-16周).殳国华 副教授"
		}],
		"name": "工程实践与科技创新Ⅳ-C"
	}, {
		"cid": "EI901",
		"kaikeList": [],
		"name": "工程实践与科技创新I"
	}, {
		"cid": "ES004",
		"kaikeList": [{
			"bsid": "372783",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第3节--第4节\n.(1-16周).张士文 讲师(高校)"
		}],
		"name": "基于安卓开发平台的电子系统综合设计"
	}, {
		"cid": "ES901",
		"kaikeList": [],
		"name": "智能信息处理"
	}, {
		"cid": "MI001",
		"kaikeList": [{
			"bsid": "373384",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-305(1-16周).戴旭涵 副教授"
		}],
		"name": "消费类电子产品传感器及其应用"
	}, {
		"cid": "MI901",
		"kaikeList": [],
		"name": "信息与感知"
	}, {
		"cid": "PH063",
		"kaikeList": [{
			"bsid": "372781",
			"time": "(2-10周)\n行课安排为第2周 --- 第10周,其中:\n星期二 第9节--第10节\n东上院505(2-10周).叶志成 副研究员"
		}],
		"name": "光的科学与生活"
	}, {
		"cid": "PO013",
		"kaikeList": [{
			"bsid": "373953",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院409(1-16周).殳国华 副教授"
		}],
		"name": "新能源技术及应用"
	}, {
		"cid": "SE112",
		"kaikeList": [{
			"bsid": "371618",
			"time": "(23-24周)\n行课安排为第23周 --- 第24周,其中:\n星期六 第3节--第3节\n.(23-24周).任锐 工程师"
		}],
		"name": "软件工程职业素养"
	}, {
		"cid": "SE117",
		"kaikeList": [{
			"bsid": "372875",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第1节--第2节\n中院100(1-16周).戚正伟\n中院100(1-16周).李健\n星期五 第3节--第4节\n中院100(1-16周).戚正伟\n中院100(1-16周).李健"
		}],
		"name": "程序设计与数据结构"
	}, {
		"cid": "SP072",
		"kaikeList": [],
		"name": "光纤通信与全光网技术的发展"
	}, {
		"cid": "WA003",
		"kaikeList": [{
			"bsid": "373383",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院2-303(1-16周).熊刚 副研究员"
		}],
		"name": "现代电子战导论"
	}],
	"name": "电子信息与电气工程学院",
	"xyid": "03000"
}, {
	"courseList": [],
	"name": "计算机科学与工程系",
	"xyid": "03300"
}, {
	"courseList": [],
	"name": "信息安全工程学院",
	"xyid": "03600"
}, {
	"courseList": [{
		"cid": "SE102",
		"kaikeList": [{
			"bsid": "371768",
			"time": "(23-24周)\n行课安排为第23周 --- 第24周,其中:\n星期六 第1节--第2节\n.(23-24周).戚正伟 教授"
		}],
		"name": "程序设计课程设计"
	}],
	"name": "软件学院",
	"xyid": "03700"
}, {
	"courseList": [],
	"name": "电力学院（原）",
	"xyid": "04000"
}, {
	"courseList": [{
		"cid": "MT017",
		"kaikeList": [{
			"bsid": "372770",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院422(1-16周).万见峰 副教授"
		}],
		"name": "绿色材料与绿色能源"
	}, {
		"cid": "MT019",
		"kaikeList": [{
			"bsid": "372771",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n上院112(1-8周).张小农 副教授\n上院112(1-8周).赵常利 助理研究员\n上院112(1-8周).倪嘉桦 科学研究人员\n星期四 第9节--第10节\n上院112(1-8周).张小农 副教授\n上院112(1-8周).赵常利 助理研究员\n上院112(1-8周).倪嘉桦 科学研究人员"
		}],
		"name": "生物医用金属材料"
	}, {
		"cid": "MT903",
		"kaikeList": [],
		"name": "材料美学"
	}, {
		"cid": "SP042",
		"kaikeList": [],
		"name": "镁合金及其成形技术"
	}],
	"name": "材料科学与工程学院",
	"xyid": "05000"
},
{
	"courseList": [],
	"name": "理学院",
	"xyid": "07000"
}, {
	"courseList": [{
		"cid": "MA016",
		"kaikeList": [{
			"bsid": "372930",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院106(1-16周).乐经良 教授"
		}],
		"name": "数学实验"
	}, {
		"cid": "MA043",
		"kaikeList": [{
			"bsid": "371935",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n中院100(1-16周).裘兆泰 副教授\n星期三 第1节--第2节\n中院100(1-16周).裘兆泰 副教授\n星期五 第1节--第2节\n中院100(1-16周).裘兆泰 副教授"
		}, {
			"bsid": "372346",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n上院100(1-16周).邵国年\n星期三 第1节--第2节\n上院100(1-16周).邵国年\n星期五 第1节--第2节\n上院100(1-16周).邵国年"
		}, {
			"bsid": "372347",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n上院101(1-16周).陈春丽\n星期三 第1节--第2节\n上院101(1-16周).陈春丽\n星期五 第1节--第2节\n上院101(1-16周).陈春丽"
		}],
		"name": "数学分析（C类）（2）"
	}, {
		"cid": "MA081",
		"kaikeList": [{
			"bsid": "372366",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n中院200(1-16周).咸进国\n星期三 第1节--第2节\n中院200(1-16周).咸进国"
		}, {
			"bsid": "373046",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n下院107(1-16周).向光辉 副教授\n星期四 第11节--第12节\n下院107(1-16周).向光辉 副教授"
		}],
		"name": "高等数学（A）（2）"
	}, {
		"cid": "MA081",
		"kaikeList": [{
			"bsid": "372366",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n中院200(1-16周).咸进国\n星期三 第1节--第2节\n中院200(1-16周).咸进国"
		}, {
			"bsid": "373046",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n下院107(1-16周).向光辉 副教授\n星期四 第11节--第12节\n下院107(1-16周).向光辉 副教授"
		}],
		"name": "高等数学（A）（2）"
	}, {
		"cid": "MA119",
		"kaikeList": [{
			"bsid": "372378",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院109(9-16周).武爱文\n星期二 第7节--第8节\n上院109(9-16周).武爱文\n星期四 第7节--第8节\n上院109(9-16周).武爱文"
		}, {
			"bsid": "372379",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院110(9-16周).熊德文\n星期二 第7节--第8节\n上院110(9-16周).熊德文\n星期四 第7节--第8节\n上院110(9-16周).熊德文"
		}, {
			"bsid": "372380",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院103(9-16周).皮玲\n星期二 第7节--第8节\n上院103(9-16周).皮玲\n星期四 第7节--第8节\n上院103(9-16周).皮玲"
		}],
		"name": "概率统计"
	}, {
		"cid": "MA902",
		"kaikeList": [],
		"name": "统计原理"
	}, {
		"cid": "MA905",
		"kaikeList": [],
		"name": "随机模拟方法与应用"
	}, {
		"cid": "MA906",
		"kaikeList": [],
		"name": "数学与科技进步"
	}, {
		"cid": "MA908",
		"kaikeList": [],
		"name": "数学的天空"
	}, {
		"cid": "MA911",
		"kaikeList": [],
		"name": "数学史"
	}],
	"name": "数学系",
	"xyid": "07100"
}, {
	"courseList": [{
		"cid": "PH001",
		"kaikeList": [{
			"bsid": "372327",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院109(1-16周).李铜忠\n星期四 第1节--第2节\n上院109(1-16周).李铜忠"
		}, {
			"bsid": "372328",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院110(1-16周).李翠莲\n星期四 第1节--第2节\n上院110(1-16周).李翠莲"
		}, {
			"bsid": "372329",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院103(1-16周).王先智\n星期四 第1节--第2节\n上院103(1-16周).王先智"
		}, {
			"bsid": "372330",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院101(1-16周).顾志霞\n星期四 第1节--第2节\n上院101(1-16周).顾志霞"
		}, {
			"bsid": "372331",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院203(1-16周).卢文发\n星期四 第1节--第2节\n上院203(1-16周).卢文发"
		}, {
			"bsid": "373222",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n下院107(1-16周).彭建平 教授\n星期三 第11节--第12节\n下院107(1-16周).彭建平 教授"
		}],
		"name": "大学物理（A类）（1）"
	}, {
		"cid": "PH001",
		"kaikeList": [{
			"bsid": "372327",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院109(1-16周).李铜忠\n星期四 第1节--第2节\n上院109(1-16周).李铜忠"
		}, {
			"bsid": "372328",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院110(1-16周).李翠莲\n星期四 第1节--第2节\n上院110(1-16周).李翠莲"
		}, {
			"bsid": "372329",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院103(1-16周).王先智\n星期四 第1节--第2节\n上院103(1-16周).王先智"
		}, {
			"bsid": "372330",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院101(1-16周).顾志霞\n星期四 第1节--第2节\n上院101(1-16周).顾志霞"
		}, {
			"bsid": "372331",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院203(1-16周).卢文发\n星期四 第1节--第2节\n上院203(1-16周).卢文发"
		}, {
			"bsid": "373222",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n下院107(1-16周).彭建平 教授\n星期三 第11节--第12节\n下院107(1-16周).彭建平 教授"
		}],
		"name": "大学物理（A类）（1）"
	}, {
		"cid": "PH028",
		"kaikeList": [{
			"bsid": "372340",
			"time": "(3-9周)\n行课安排为第3周 --- 第9周,其中:\n星期五 第7节--第9节\n.(3-9周).周红 副教授"
		}, {
			"bsid": "372341",
			"time": "(10-16周)\n行课安排为第10周 --- 第16周,其中:\n星期五 第7节--第9节\n.(10-16周).周红 副教授"
		}],
		"name": "大学物理实验（1）"
	}, {
		"cid": "PH030",
		"kaikeList": [{
			"bsid": "372944",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院109(1-16周).丁国辉 副教授"
		}],
		"name": "主宰世界的七个方程"
	}, {
		"cid": "PH041",
		"kaikeList": [{
			"bsid": "372942",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东中院4-303(1-16周).张鹏杰 教授"
		}],
		"name": "广义相对论"
	}, {
		"cid": "PH048",
		"kaikeList": [{
			"bsid": "372943",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-102(1-16周).顾卫华 讲师(高校)"
		}],
		"name": "基本数值计算方法"
	}, {
		"cid": "PH060",
		"kaikeList": [{
			"bsid": "372025",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n中院407(1-16周).胡其图 教授\n星期三 第3节--第4节\n中院407(1-16周).胡其图 教授"
		}, {
			"bsid": "374151",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n中院407(1-16周).胡其图 教授\n星期三 第1节--第2节\n中院407(1-16周).胡其图 教授"
		}],
		"name": "大学物理（荣誉）（1）"
	}, {
		"cid": "PH064",
		"kaikeList": [{
			"bsid": "373494",
			"time": "(1-2周)\n行课安排为第1周 --- 第2周,其中:\n星期二 第3节--第4节\n东上院307(1-2周).季向东 教授\n星期三 第3节--第4节\n东上院307(1-2周).季向东 教授\n星期四 第3节--第4节\n东上院307(1-2周).季向东 教授\n星期五 第3节--第4节\n东上院307(1-2周).季向东 教授"
		}],
		"name": "基本粒子探测"
	}, {
		"cid": "PH409",
		"kaikeList": [{
			"bsid": "372941",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n东中院4-304(1-8周).邓晓旭 教授\n星期四 第9节--第10节\n东中院4-304(1-8周).邓晓旭 教授"
		}],
		"name": "导波光学"
	}, {
		"cid": "PH902",
		"kaikeList": [],
		"name": "宇宙与人类"
	}, {
		"cid": "PH903",
		"kaikeList": [],
		"name": "量子波澜：历史与概念"
	}, {
		"cid": "PH905",
		"kaikeList": [],
		"name": "从物理实验看世界"
	}, {
		"cid": "PH906",
		"kaikeList": [],
		"name": "量子力学"
	}, {
		"cid": "SP100",
		"kaikeList": [],
		"name": "超导体及其应用"
	}],
	"name": "物理与天文系",
	"xyid": "07200"
}, {
	"courseList": [{
		"cid": "BI001",
		"kaikeList": [],
		"name": "生命科学导论"
	}, {
		"cid": "BI056",
		"kaikeList": [{
			"bsid": "372926",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n东下院205(1-8周).李胜天 副教授"
		}],
		"name": "从脑到行为"
	}, {
		"cid": "BI092",
		"kaikeList": [{
			"bsid": "372928",
			"time": "(3-10周)\n行课安排为第3周 --- 第10周,其中:\n星期二 第7节--第10节\n.(3-10周).蒋群 副教授\n.(3-10周).何丽明 实验师"
		}],
		"name": "在实验中探究生物技术"
	}, {
		"cid": "BI902",
		"kaikeList": [],
		"name": "生命伦理学"
	}, {
		"cid": "BI903",
		"kaikeList": [],
		"name": "生命科学实验探索"
	}, {
		"cid": "BI905",
		"kaikeList": [],
		"name": "地球生命"
	}, {
		"cid": "BI911",
		"kaikeList": [],
		"name": "生物工程导论"
	}, {
		"cid": "BI915",
		"kaikeList": [],
		"name": "微生物的世界"
	}, {
		"cid": "BM011",
		"kaikeList": [{
			"bsid": "372927",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院302(1-16周).王莲芸 教授"
		}],
		"name": "现代医学导论"
	}, {
		"cid": "BM903",
		"kaikeList": [],
		"name": "大学生健康导论"
	}, {
		"cid": "SP169",
		"kaikeList": [],
		"name": "心血管疾病生物学"
	}, {
		"cid": "SP255",
		"kaikeList": [],
		"name": "生物统计与医疗健康大数据前沿"
	}, {
		"cid": "SP256",
		"kaikeList": [],
		"name": "转化医学研究中的生物统计"
	}],
	"name": "生命科学技术学院",
	"xyid": "08000"
}, {
	"courseList": [{
		"cid": "BI039",
		"kaikeList": [{
			"bsid": "372929",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n东下院102(1-16周).熊丽琴 助理研究员"
		}],
		"name": "分子影像学与疾病早期诊断"
	}],
	"name": "生物医学工程学院",
	"xyid": "08200"
}, {
	"courseList": [{
		"cid": "CH060",
		"kaikeList": [{
			"bsid": "372903",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期五 第9节--第10节\n东上院501(1-8周).王锡荣 教授"
		}],
		"name": "1930年代上海文学地图"
	}, {
		"cid": "CH063",
		"kaikeList": [{
			"bsid": "372918",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院105(1-16周).陈建华 教授"
		}],
		"name": "中国现代文学与电影"
	}, {
		"cid": "CH066",
		"kaikeList": [{
			"bsid": "372919",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院203(1-16周).安琪 讲师(高校)"
		}],
		"name": "中国艺术史"
	}, {
		"cid": "CH068",
		"kaikeList": [{
			"bsid": "373485",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院314(1-16周).何延红（笔名：何言宏） 教授"
		}],
		"name": "现代中国经典作家"
	}, {
		"cid": "CH199",
		"kaikeList": [{
			"bsid": "371732",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第6节--第8节\n东上院100(1-16周).刘元春 讲师(高校)"
		}],
		"name": "核心阅读（I)"
	}, {
		"cid": "CH901",
		"kaikeList": [],
		"name": "大学语文"
	}, {
		"cid": "CH903",
		"kaikeList": [],
		"name": "20世纪中国文学名著欣赏"
	}, {
		"cid": "CH904",
		"kaikeList": [],
		"name": "汉字文化"
	}, {
		"cid": "CH906",
		"kaikeList": [],
		"name": "古典诗词鉴赏与创作"
	}, {
		"cid": "CH911",
		"kaikeList": [],
		"name": "外国文学史(C）"
	}, {
		"cid": "CH912",
		"kaikeList": [],
		"name": "历代名词人研究"
	}, {
		"cid": "CH927",
		"kaikeList": [],
		"name": "中国现代诗歌导读"
	}, {
		"cid": "CH929",
		"kaikeList": [],
		"name": "汉语与认知：由汉语看汉民族的认知特点"
	}, {
		"cid": "CH932",
		"kaikeList": [],
		"name": "现代中国文学与文化"
	}, {
		"cid": "CI099",
		"kaikeList": [{
			"bsid": "372905",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n上院104(1-16周).梅悦丽\n星期四 第11节--第12节\n上院104(1-16周).梅悦丽"
		}],
		"name": "汉语"
	}, {
		"cid": "CL002",
		"kaikeList": [{
			"bsid": "372913",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院106(1-16周).孟令兵 讲师(高校)"
		}],
		"name": "西方宗教文化概论"
	}, {
		"cid": "CL011",
		"kaikeList": [{
			"bsid": "372911",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院307(1-16周).施立峻 副教授"
		}],
		"name": "文学与文化"
	}, {
		"cid": "CL018",
		"kaikeList": [{
			"bsid": "372912",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院110(1-11周).武云 讲师(高校)"
		}],
		"name": "西方精神探源"
	}, {
		"cid": "CL206",
		"kaikeList": [{
			"bsid": "372999",
			"time": "(1-6周)\n行课安排为第1周 --- 第6周,其中:\n星期六 第1节--第4节\n.(1-6周).Sa Weiqi 讲师(高校)\n星期日 第1节--第4节\n.(1-6周).Sa Weiqi 讲师(高校)"
		}],
		"name": "中国文化概论"
	}, {
		"cid": "CL907",
		"kaikeList": [],
		"name": "世界华文文学专题"
	}, {
		"cid": "CL919",
		"kaikeList": [],
		"name": "当代西方人文艺术思潮"
	}, {
		"cid": "FT018",
		"kaikeList": [{
			"bsid": "372917",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院305(1-11周).易存国 教授"
		}],
		"name": "影视文化与艺术"
	}, {
		"cid": "HI010",
		"kaikeList": [{
			"bsid": "372908",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n东中院2-202(1-16周).任玉雪 副教授"
		}],
		"name": "清史演义"
	}, {
		"cid": "HI050",
		"kaikeList": [{
			"bsid": "372904",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院405(1-16周).范慕尤 高等学校教师"
		}],
		"name": "佛教史"
	}, {
		"cid": "HI053",
		"kaikeList": [{
			"bsid": "372910",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院404(1-16周).刘啸 助理研究员"
		}],
		"name": "三国史讲演"
	}, {
		"cid": "HI072",
		"kaikeList": [{
			"bsid": "373484",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东上院307(1-11周).刘啸 助理研究员"
		}],
		"name": "《唐代政治史述论稿》导读"
	}, {
		"cid": "HI903",
		"kaikeList": [],
		"name": "美国的文化与历史"
	}, {
		"cid": "HI928",
		"kaikeList": [],
		"name": "美国历史上的重大问题"
	}, {
		"cid": "JC029",
		"kaikeList": [{
			"bsid": "373501",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院204(1-11周).金元浦 高等学校教师"
		}],
		"name": "中国文化创意产业前沿理论与实践案例"
	}, {
		"cid": "JC304",
		"kaikeList": [{
			"bsid": "372907",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院210(1-16周).施立峻 副教授"
		}],
		"name": "美学概论"
	}, {
		"cid": "JC903",
		"kaikeList": [],
		"name": "美学"
	}, {
		"cid": "LI901",
		"kaikeList": [],
		"name": "文学与人生"
	}, {
		"cid": "MU004",
		"kaikeList": [{
			"bsid": "372914",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东下院106(1-16周).胡慈舟 讲师(高校)"
		}, {
			"bsid": "372915",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东下院106(1-11周).胡慈舟 讲师(高校)"
		}],
		"name": "音乐剧与歌舞电影"
	}, {
		"cid": "MU024",
		"kaikeList": [{
			"bsid": "372920",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东上院203(1-11周).胡逸薇 讲师(高校)"
		}, {
			"bsid": "372921",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第11节--第13节\n东上院203(1-11周).胡逸薇 讲师(高校)"
		}],
		"name": "中外通俗歌曲鉴赏"
	}, {
		"cid": "MU037",
		"kaikeList": [{
			"bsid": "372906",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).张沁 讲师(高校)"
		}],
		"name": "合唱音乐"
	}, {
		"cid": "MU139",
		"kaikeList": [{
			"bsid": "372916",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院106(1-16周).胡慈舟 讲师(高校)"
		}],
		"name": "英语经典歌曲欣赏"
	}, {
		"cid": "MU901",
		"kaikeList": [],
		"name": "交响音乐鉴赏"
	}, {
		"cid": "MU902",
		"kaikeList": [],
		"name": "中西乐理及其应用"
	}, {
		"cid": "MU903",
		"kaikeList": [],
		"name": "世界民族音乐鉴赏"
	}, {
		"cid": "PI032",
		"kaikeList": [{
			"bsid": "373483",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院320(1-11周).武云 讲师(高校)"
		}],
		"name": "柏拉图的世界"
	}, {
		"cid": "PI033",
		"kaikeList": [{
			"bsid": "373487",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-104(1-16周).陈嘉明"
		}],
		"name": "哲学与思想智慧"
	}, {
		"cid": "PI906",
		"kaikeList": [],
		"name": "佛教与中国传统文化"
	}, {
		"cid": "PI913",
		"kaikeList": [],
		"name": "西方哲学史"
	}, {
		"cid": "PI919",
		"kaikeList": [],
		"name": "西方哲学史"
	}, {
		"cid": "SO082",
		"kaikeList": [{
			"bsid": "372909",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院309(1-16周).丁雁南"
		}],
		"name": "人文地理学导论"
	}, {
		"cid": "SP238",
		"kaikeList": [],
		"name": "美国华人简史"
	}],
	"name": "人文学院",
	"xyid": "09000"
}, {
	"courseList": [{
		"cid": "HI058",
		"kaikeList": [{
			"bsid": "372873",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院108(1-16周).黄庆桥 讲师(高校思政)"
		}],
		"name": "中国的“两弹一星”工程"
	}, {
		"cid": "HI102",
		"kaikeList": [{
			"bsid": "372869",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院303(1-16周).吴新忠 讲师(高校)"
		}, {
			"bsid": "372870",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院208(1-16周).吴新忠 讲师(高校)"
		}],
		"name": "科学技术史"
	}, {
		"cid": "HI901",
		"kaikeList": [],
		"name": "天文学史"
	}, {
		"cid": "PI001",
		"kaikeList": [{
			"bsid": "372871",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院301(1-11周).吴新忠 讲师(高校)"
		}],
		"name": "科学前沿与哲学"
	}, {
		"cid": "PI005",
		"kaikeList": [{
			"bsid": "372872",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院208(1-16周).吴新忠 讲师(高校)"
		}],
		"name": "宇宙论的历史与哲学"
	}, {
		"cid": "PI916",
		"kaikeList": [],
		"name": "科学哲学"
	}, {
		"cid": "SO073",
		"kaikeList": [{
			"bsid": "372867",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院102(1-16周).杜严勇 副教授"
		}],
		"name": "创造学与创造性思维训练"
	}, {
		"cid": "SO074",
		"kaikeList": [{
			"bsid": "372868",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院203(1-16周).穆蕴秋 讲师(高校)"
		}],
		"name": "科幻作品与科学外史"
	}],
	"name": "科学史与科学文化研究院",
	"xyid": "09600"
}, {
	"courseList": [{
		"cid": "CA901",
		"kaikeList": [],
		"name": "大学化学"
	}, {
		"cid": "CA902",
		"kaikeList": [],
		"name": "在实验中探究化学"
	}, {
		"cid": "CA903",
		"kaikeList": [],
		"name": "化学问题的实验研究"
	}, {
		"cid": "CA904",
		"kaikeList": [],
		"name": "公共危机中的化学"
	}, {
		"cid": "PO903",
		"kaikeList": [],
		"name": "清洁能源技术：原理与应用"
	}, {
		"cid": "SP142",
		"kaikeList": [],
		"name": "元素揭秘"
	}, {
		"cid": "SP151",
		"kaikeList": [],
		"name": "超临界流体的奇妙世界"
	}],
	"name": "化学化工学院",
	"xyid": "11000"
}, {
	"courseList": [{
		"cid": "AM001",
		"kaikeList": [{
			"bsid": "372843",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院110(1-16周).韩丽川 副教授"
		}, {
			"bsid": "372844",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院108(1-11周).武邦涛 教授"
		}, {
			"bsid": "372845",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院107(1-16周).汤石章 副教授"
		}, {
			"bsid": "372846",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院108(1-16周).胡巍 副教授"
		}, {
			"bsid": "372847",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院110(1-16周).李寿德 副教授"
		}],
		"name": "管理基础"
	}, {
		"cid": "AM007",
		"kaikeList": [{
			"bsid": "372835",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院202(1-11周).侯立文 副教授"
		}, {
			"bsid": "372836",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院209(1-11周).李海刚 副教授"
		}],
		"name": "电子商务基础"
	}, {
		"cid": "AM021",
		"kaikeList": [{
			"bsid": "372839",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院307(1-16周).黄采金 副教授"
		}, {
			"bsid": "372840",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院307(1-16周).黄采金 副教授"
		}],
		"name": "工程技术管理"
	}, {
		"cid": "AM025",
		"kaikeList": [{
			"bsid": "372848",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院104(1-16周).杨忠直 教授"
		}],
		"name": "管理经济学（A类）"
	}, {
		"cid": "AM030",
		"kaikeList": [{
			"bsid": "372850",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院103(1-11周).张兴福 副教授"
		}],
		"name": "国学与领导力发展"
	}, {
		"cid": "AM043",
		"kaikeList": [{
			"bsid": "372837",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院107(1-16周).侯建荣 副教授"
		}],
		"name": "定价策略"
	}, {
		"cid": "AM062",
		"kaikeList": [{
			"bsid": "372861",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院105(1-16周).井淼 副教授"
		}],
		"name": "消费者行为学（A）"
	}, {
		"cid": "AM070",
		"kaikeList": [{
			"bsid": "372834",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第11节--第13节\n上院209(1-11周).李海刚 副教授"
		}],
		"name": "电子商务：创新与战略"
	}, {
		"cid": "AM108",
		"kaikeList": [{
			"bsid": "372860",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院107(1-16周).史清华 教授"
		}],
		"name": "消费者行为学"
	}, {
		"cid": "BU007",
		"kaikeList": [{
			"bsid": "372852",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院206(1-11周).王爱民 讲师(高校)"
		}, {
			"bsid": "372853",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院208(1-16周).王爱民 讲师(高校)"
		}],
		"name": "技术经济学(B类)"
	}, {
		"cid": "BU011",
		"kaikeList": [{
			"bsid": "372855",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n中院105(1-11周).李杰 副教授"
		}],
		"name": "品牌管理导论"
	}, {
		"cid": "BU013",
		"kaikeList": [{
			"bsid": "372856",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院105(1-11周).李杰 副教授"
		}],
		"name": "品牌审美与管理——F1超跑和法国红酒"
	}, {
		"cid": "BU014",
		"kaikeList": [{
			"bsid": "373431",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第11节--第13节\n上院109(1-16周).鲍杨"
		}],
		"name": "商业数据科学"
	}, {
		"cid": "BU100",
		"kaikeList": [{
			"bsid": "372849",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院108(1-16周).武邦涛 教授"
		}],
		"name": "管理学"
	}, {
		"cid": "BU104",
		"kaikeList": [{
			"bsid": "372862",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院107(1-11周).井淼 副教授"
		}],
		"name": "营销导论"
	}, {
		"cid": "BU320",
		"kaikeList": [{
			"bsid": "372859",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院3-303(1-16周).刘欣 副教授"
		}],
		"name": "项目管理"
	}, {
		"cid": "BU348",
		"kaikeList": [{
			"bsid": "372863",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第11节--第13节\n下院208(1-16周).汪蓉 讲师(高校)"
		}],
		"name": "运营管理"
	}, {
		"cid": "BU372",
		"kaikeList": [{
			"bsid": "372858",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院104(1-16周).吴家春 副教授"
		}],
		"name": "商务智能与现代企业管理"
	}, {
		"cid": "BU426",
		"kaikeList": [{
			"bsid": "372832",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院307(1-11周).黄采金 副教授"
		}, {
			"bsid": "372833",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院307(1-16周).黄采金 副教授"
		}],
		"name": "创业机会识别"
	}, {
		"cid": "EC011",
		"kaikeList": [{
			"bsid": "372851",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院110(1-16周).郑育家 讲师(高校)"
		}],
		"name": "宏观经济学（B类）"
	}, {
		"cid": "EC016",
		"kaikeList": [{
			"bsid": "372841",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院104(1-11周).杨忠直 教授"
		}],
		"name": "工程经济学(F类)"
	}, {
		"cid": "EC017",
		"kaikeList": [{
			"bsid": "372838",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n下院307(1-11周).顾海英 教授"
		}],
		"name": "发展经济学专题"
	}, {
		"cid": "EC100",
		"kaikeList": [{
			"bsid": "372854",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院102(1-16周).汤石章 副教授"
		}],
		"name": "经济学"
	}, {
		"cid": "EN315",
		"kaikeList": [{
			"bsid": "372857",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院4-204(1-16周).陈幼平 副教授"
		}],
		"name": "商务英语沟通"
	}, {
		"cid": "PS908",
		"kaikeList": [],
		"name": "管理心理学"
	}, {
		"cid": "PU066",
		"kaikeList": [{
			"bsid": "372842",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院106(1-16周).王金桃 副教授"
		}],
		"name": "公共安全与危机管理：基础和方法"
	}, {
		"cid": "PU943",
		"kaikeList": [],
		"name": "中国医疗保险制度的转型发展与创新"
	}, {
		"cid": "SO900",
		"kaikeList": [],
		"name": "社会学"
	}, {
		"cid": "SP159",
		"kaikeList": [],
		"name": "不确定情况下的决策问题"
	}, {
		"cid": "SP217",
		"kaikeList": [],
		"name": "商务沟通与道德"
	}, {
		"cid": "SP254",
		"kaikeList": [],
		"name": "创业管理"
	}],
	"name": "安泰经济与管理学院",
	"xyid": "12000"
}, {
	"courseList": [{
		"cid": "AM008",
		"kaikeList": [{
			"bsid": "372795",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院202(1-16周).莫童 副教授"
		}],
		"name": "WTO法律文件选读"
	}, {
		"cid": "EC021",
		"kaikeList": [{
			"bsid": "373387",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院201(1-11周).吕守军 副教授"
		}],
		"name": "现当代经济思想导论"
	}, {
		"cid": "PU040",
		"kaikeList": [{
			"bsid": "372799",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n东上院205(1-16周).陈拯 讲师(高校)"
		}],
		"name": "国际安全"
	}, {
		"cid": "PU050",
		"kaikeList": [{
			"bsid": "373388",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院309(1-16周).张学昆 讲师(高校)"
		}],
		"name": "国际关系学导论"
	}, {
		"cid": "PU058",
		"kaikeList": [{
			"bsid": "372803",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院105(1-16周).黄平 讲师(高校)"
		}],
		"name": "宗教与社会"
	}, {
		"cid": "PU078",
		"kaikeList": [{
			"bsid": "372797",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院202(1-16周).黄宗昊 讲师(高校)"
		}],
		"name": "各国政府与政治"
	}, {
		"cid": "PU088",
		"kaikeList": [{
			"bsid": "372800",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院306(1-16周).黄琪轩 副教授"
		}],
		"name": "全球政治经济学导论"
	}, {
		"cid": "PU109",
		"kaikeList": [{
			"bsid": "372801",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院109(1-11周).黄平 讲师(高校)"
		}],
		"name": "英美剧中的国际关系"
	}, {
		"cid": "PU902",
		"kaikeList": [],
		"name": "当代中国社会问题"
	}, {
		"cid": "PU907",
		"kaikeList": [],
		"name": "公共政策与公民生活"
	}, {
		"cid": "PU908",
		"kaikeList": [],
		"name": "中俄关系的演变与展望"
	}, {
		"cid": "PU909",
		"kaikeList": [],
		"name": "现代日本政治"
	}, {
		"cid": "PU910",
		"kaikeList": [],
		"name": "城市文明的历史与未来"
	}, {
		"cid": "PU914",
		"kaikeList": [],
		"name": "当代中国外交"
	}, {
		"cid": "PU917",
		"kaikeList": [],
		"name": "政治经济学经典导读"
	}, {
		"cid": "PU936",
		"kaikeList": [],
		"name": "民族主义与族群政治"
	}, {
		"cid": "PU937",
		"kaikeList": [],
		"name": "大国战略"
	}, {
		"cid": "PU938",
		"kaikeList": [],
		"name": "治理之善：公共行政热点解析"
	}, {
		"cid": "PU941",
		"kaikeList": [],
		"name": "领导力学习与实践"
	}, {
		"cid": "PU942",
		"kaikeList": [],
		"name": "政治的边界与逻辑"
	}, {
		"cid": "SO937",
		"kaikeList": [],
		"name": "风险与社会保障"
	}, {
		"cid": "SO940",
		"kaikeList": [],
		"name": "社会科学研究方法"
	}, {
		"cid": "WA002",
		"kaikeList": [{
			"bsid": "372802",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院206(1-16周).陈拯 讲师(高校)"
		}],
		"name": "战争的起源：理论与历史"
	}],
	"name": "国际与公共事务学院",
	"xyid": "13000"
},
{
	"courseList": [{
		"cid": "CL909",
		"kaikeList": [],
		"name": "女性文学与性别文化"
	}, {
		"cid": "CL915",
		"kaikeList": [],
		"name": "欧洲文化导论"
	}, {
		"cid": "EN026",
		"kaikeList": [{
			"bsid": "373591",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院106(1-16周).王宇 副教授\n星期四 第3节--第4节\n上院106(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373592",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院107(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院107(1-16周).叶菊仙 副教授"
		}, {
			"bsid": "373593",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院108(1-16周).陆元雯 副教授\n星期四 第3节--第4节\n上院108(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373594",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院112(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院112(1-16周).丁兴华 副教授"
		}, {
			"bsid": "373595",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院202(1-16周).隋莉 讲师(高校)\n星期四 第3节--第4节\n上院202(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373596",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院307(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院307(1-16周).沈亚丽 讲师(高校)"
		}, {
			"bsid": "373597",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院206(1-16周).田艳 教授\n星期四 第3节--第4节\n上院206(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373598",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院208(1-16周).李侠 副教授\n星期四 第3节--第4节\n上院401(1-16周).李侠 副教授"
		}, {
			"bsid": "373599",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院401(1-16周).李鑫 讲师(高校)\n星期四 第3节--第4节\n上院208(1-16周).李鑫 讲师(高校)"
		}, {
			"bsid": "373600",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院209(1-16周).苏坤 讲师(高校)\n星期四 第3节--第4节\n上院403(1-16周).苏坤 讲师(高校)"
		}, {
			"bsid": "374090",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师\n星期五 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师"
		}, {
			"bsid": "374092",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师\n星期四 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师"
		}, {
			"bsid": "374094",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院422(1-16周).朱丽莎 高等学校教师\n星期四 第3节--第4节\n上院422(1-16周).朱丽莎 高等学校教师"
		}, {
			"bsid": "374095",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第7节--第8节\n上院320(1-16周).朱丽莎 高等学校教师\n星期四 第1节--第2节\n上院320(1-16周).朱丽莎 高等学校教师"
		}, {
			"bsid": "374106",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第1节--第2节\n中院103(1-16周).吴湾 高等学校教师\n星期五 第3节--第4节\n中院103(1-16周).吴湾 高等学校教师"
		}, {
			"bsid": "374107",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n中院101(1-16周).吴湾 高等学校教师\n星期五 第1节--第2节\n中院101(1-16周).吴湾 高等学校教师"
		}],
		"name": "大学基础英语（2）"
	}, {
		"cid": "EN026",
		"kaikeList": [{
			"bsid": "373591",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院106(1-16周).王宇 副教授\n星期四 第3节--第4节\n上院106(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373592",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院107(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院107(1-16周).叶菊仙 副教授"
		}, {
			"bsid": "373593",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院108(1-16周).陆元雯 副教授\n星期四 第3节--第4节\n上院108(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373594",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院112(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院112(1-16周).丁兴华 副教授"
		}, {
			"bsid": "373595",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院202(1-16周).隋莉 讲师(高校)\n星期四 第3节--第4节\n上院202(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373596",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院307(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院307(1-16周).沈亚丽 讲师(高校)"
		}, {
			"bsid": "373597",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院206(1-16周).田艳 教授\n星期四 第3节--第4节\n上院206(1-16周).Jenny xu 高等学校教师"
		}, {
			"bsid": "373598",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院208(1-16周).李侠 副教授\n星期四 第3节--第4节\n上院401(1-16周).李侠 副教授"
		}, {
			"bsid": "373599",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院401(1-16周).李鑫 讲师(高校)\n星期四 第3节--第4节\n上院208(1-16周).李鑫 讲师(高校)"
		}, {
			"bsid": "373600",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院209(1-16周).苏坤 讲师(高校)\n星期四 第3节--第4节\n上院403(1-16周).苏坤 讲师(高校)"
		}, {
			"bsid": "374090",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师\n星期五 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师"
		}, {
			"bsid": "374092",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师\n星期四 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师"
		}, {
			"bsid": "374094",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院422(1-16周).朱丽莎 高等学校教师\n星期四 第3节--第4节\n上院422(1-16周).朱丽莎 高等学校教师"
		}, {
			"bsid": "374095",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第7节--第8节\n上院320(1-16周).朱丽莎 高等学校教师\n星期四 第1节--第2节\n上院320(1-16周).朱丽莎 高等学校教师"
		}, {
			"bsid": "374106",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第1节--第2节\n中院103(1-16周).吴湾 高等学校教师\n星期五 第3节--第4节\n中院103(1-16周).吴湾 高等学校教师"
		}, {
			"bsid": "374107",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n中院101(1-16周).吴湾 高等学校教师\n星期五 第1节--第2节\n中院101(1-16周).吴湾 高等学校教师"
		}],
		"name": "大学基础英语（2）"
	}, {
		"cid": "EN901",
		"kaikeList": [],
		"name": "英语写作"
	}, {
		"cid": "EN903",
		"kaikeList": [],
		"name": "英语公众演讲"
	}, {
		"cid": "EN904",
		"kaikeList": [],
		"name": "莎士比亚戏剧赏析"
	}, {
		"cid": "EN905",
		"kaikeList": [],
		"name": "英语经典名作赏析"
	}, {
		"cid": "EN907",
		"kaikeList": [],
		"name": "英国经典散文赏析"
	}, {
		"cid": "EN908",
		"kaikeList": [],
		"name": "学术英语交际:写作与发言"
	}, {
		"cid": "FO005",
		"kaikeList": [{
			"bsid": "372934",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院206(1-16周).曹慧 讲师(高校)\n星期四 第9节--第10节\n上院206(1-16周).曹慧 讲师(高校)"
		}],
		"name": "基础法语(上)"
	}, {
		"cid": "FO007",
		"kaikeList": [{
			"bsid": "372777",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期六 第1节--第2节\n.(1-16周).黄晓艳 讲师(高校)\n.(1-16周).薛原 讲师(高校)\n.(1-16周).管新潮 副编审\n星期日 第1节--第2节\n.(1-16周).黄晓艳 讲师(高校)\n.(1-16周).薛原 讲师(高校)\n.(1-16周).管新潮 副编审"
		}],
		"name": "德语(B类）(上)"
	}, {
		"cid": "HI904",
		"kaikeList": [],
		"name": "历史视野下的美国文化"
	}, {
		"cid": "JA001",
		"kaikeList": [{
			"bsid": "372936",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院318(1-16周).单娟 讲师(高校)\n星期四 第9节--第10节\n上院318(1-16周).单娟 讲师(高校)"
		}, {
			"bsid": "372937",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院306(1-16周).林子博\n星期四 第9节--第10节\n下院306(1-16周).林子博"
		}, {
			"bsid": "372938",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院314(1-16周).陈崇君 副教授\n星期四 第9节--第10节\n上院314(1-16周).陈崇君 副教授"
		}],
		"name": "基础日语(上)"
	}, {
		"cid": "JA002",
		"kaikeList": [{
			"bsid": "372939",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院418(1-16周).王琳 副教授\n星期四 第9节--第10节\n上院418(1-16周).王琳 副教授"
		}],
		"name": "基础日语(下)"
	}, {
		"cid": "JA012",
		"kaikeList": [{
			"bsid": "372935",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-302(1-16周).黄建香 副教授\n星期四 第9节--第10节\n东中院3-302(1-16周).黄建香 副教授"
		}],
		"name": "基础日语(（Ⅲ）"
	}, {
		"cid": "LI903",
		"kaikeList": [],
		"name": "英美名诗赏析"
	}],
	"name": "外国语学院",
	"xyid": "14000"
}, {
	"courseList": [],
	"name": "日语系",
	"xyid": "14200"
}, {
	"courseList": [{
		"cid": "AB010",
		"kaikeList": [{
			"bsid": "373479",
			"time": "(2-7周)\n行课安排为第2周 --- 第7周,其中:\n星期一 第6节--第8节\n.(2-7周).方心葵 副教授\n.(2-7周).徐鲁荣 助理研究员\n.(2-7周).王秀红 高级实验师"
		}],
		"name": "农科大型仪器设备操作与使用"
	}, {
		"cid": "AB901",
		"kaikeList": [],
		"name": "现代农业与生态文明"
	}, {
		"cid": "BI027",
		"kaikeList": [{
			"bsid": "372900",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东下院402(1-11周).赵静雅 副教授\n东下院402(1-11周).潘琪芳 助理研究员"
		}],
		"name": "生物技术概论"
	}, {
		"cid": "BI901",
		"kaikeList": [],
		"name": "生命科学发展史"
	}, {
		"cid": "BI912",
		"kaikeList": [],
		"name": "遗传学与社会"
	}, {
		"cid": "BU015",
		"kaikeList": [{
			"bsid": "373476",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东下院203(1-11周).钟宇 讲师(高校)"
		}],
		"name": "食品营销与案例赏析"
	}, {
		"cid": "EV007",
		"kaikeList": [{
			"bsid": "372899",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东下院202(1-11周).刘群录 副教授"
		}],
		"name": "生态安全与生态文明"
	}, {
		"cid": "EV040",
		"kaikeList": [{
			"bsid": "372896",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院405(1-11周).殷杉 助理研究员\n中院405(1-11周).刘春江 教授"
		}],
		"name": "全球变化下的自然和生态"
	}, {
		"cid": "FS004",
		"kaikeList": [{
			"bsid": "372897",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-200(1-16周).姚晓敏 副教授"
		}],
		"name": "膳食指南与营养评估"
	}, {
		"cid": "GA003",
		"kaikeList": [{
			"bsid": "373481",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院314(1-11周).于冰沁 讲师(高校)"
		}],
		"name": "西方风景园林规划设计史"
	}, {
		"cid": "GA407",
		"kaikeList": [{
			"bsid": "372894",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-402(1-16周).李洁 副教授"
		}],
		"name": "花卉应用学"
	}, {
		"cid": "GA901",
		"kaikeList": [],
		"name": "与风景的对话——中外园林艺术欣赏"
	}, {
		"cid": "ME089",
		"kaikeList": [{
			"bsid": "373478",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院101(1-16周).章竞瑾"
		}],
		"name": "农业机器人绪论"
	}, {
		"cid": "PI016",
		"kaikeList": [{
			"bsid": "372902",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院209(1-11周).杨志彪 副研究员"
		}],
		"name": "中国传统文化中的哲学思想"
	}, {
		"cid": "PL004",
		"kaikeList": [{
			"bsid": "372892",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第9节--第10节\n东中院4-402(1-8周).李洁 副教授"
		}],
		"name": "插花艺术"
	}, {
		"cid": "PL021",
		"kaikeList": [{
			"bsid": "372893",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n中院207(1-8周).曾丽 副教授\n星期四 第9节--第10节\n中院207(1-8周).曾丽 副教授"
		}],
		"name": "花卉艺术"
	}, {
		"cid": "PL026",
		"kaikeList": [{
			"bsid": "372895",
			"time": "(3-13周)\n行课安排为第3周 --- 第13周,其中:\n星期二 第11节--第13节\n中院100(3-13周).张才喜 教授\n中院100(3-13周).王世平 教授\n中院100(3-13周).宋士任 助理研究员"
		}],
		"name": "葡萄与葡萄酒文化"
	}, {
		"cid": "PL027",
		"kaikeList": [{
			"bsid": "372901",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院305(9-16周).常丽英 副教授"
		}],
		"name": "园艺与文化"
	}, {
		"cid": "PL029",
		"kaikeList": [{
			"bsid": "372898",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-103(1-16周).苗志奇 副教授"
		}],
		"name": "神奇的蘑菇"
	}, {
		"cid": "PL031",
		"kaikeList": [{
			"bsid": "373480",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院202(1-16周).耿雪青 讲师(高校)"
		}],
		"name": "植物与生活"
	}, {
		"cid": "PL902",
		"kaikeList": [],
		"name": "国花、市花与文化"
	}, {
		"cid": "SA002",
		"kaikeList": [{
			"bsid": "372933",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院209(1-16周).王品"
		}],
		"name": "梵语（2）"
	}, {
		"cid": "SP018",
		"kaikeList": [],
		"name": "植物嫁接理论与技术"
	}, {
		"cid": "SP227",
		"kaikeList": [],
		"name": "走进神秘的番茄世界"
	}, {
		"cid": "TO901",
		"kaikeList": [],
		"name": "中国的世界文化与自然遗产"
	}],
	"name": "农业与生物学院",
	"xyid": "15000"
}, {
	"courseList": [{
		"cid": "EV029",
		"kaikeList": [{
			"bsid": "372805",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院303(1-16周).靳强 副教授"
		}],
		"name": "绿色过程工程"
	}, {
		"cid": "EV031",
		"kaikeList": [{
			"bsid": "372804",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院308(1-16周).何小娟 助理研究员"
		}],
		"name": "环境问题与对策"
	}, {
		"cid": "EV032",
		"kaikeList": [{
			"bsid": "372806",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-405(1-16周).黄荣振"
		}],
		"name": "湿地生态"
	}, {
		"cid": "EV901",
		"kaikeList": [],
		"name": "环境与可持续发展"
	}, {
		"cid": "SO922",
		"kaikeList": [],
		"name": "人与环境"
	}, {
		"cid": "SP243",
		"kaikeList": [],
		"name": "电子废物-资源-环境"
	}],
	"name": "环境科学与工程学院",
	"xyid": "16000"
}, {
	"courseList": [{
		"cid": "BI907",
		"kaikeList": [],
		"name": "基因与人"
	}, {
		"cid": "BI917",
		"kaikeList": [],
		"name": "脑与日常行为"
	}, {
		"cid": "BM901",
		"kaikeList": [],
		"name": "中医药与中华传统文化"
	}, {
		"cid": "BM902",
		"kaikeList": [],
		"name": "药物发展——延续生命的奥秘"
	}, {
		"cid": "PM005",
		"kaikeList": [{
			"bsid": "372956",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院403(1-16周).王梦月 副教授"
		}],
		"name": "中药学通论"
	}],
	"name": "药学院",
	"xyid": "17000"
}, {
	"courseList": [{
		"cid": "PU041",
		"kaikeList": [{
			"bsid": "372958",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n上院101(1-11周).蔡骏 助理研究员"
		}],
		"name": "危机与公共关系"
	}],
	"name": "医学院（并校前）",
	"xyid": "18000"
}, {
	"courseList": [{
		"cid": "LA910",
		"kaikeList": [],
		"name": "法律思维与法学经典阅读"
	}, {
		"cid": "LA911",
		"kaikeList": [],
		"name": "法律与道德"
	}, {
		"cid": "LA913",
		"kaikeList": [],
		"name": "经济与法律"
	}, {
		"cid": "LA915",
		"kaikeList": [],
		"name": "刑法与生活"
	}, {
		"cid": "LA925",
		"kaikeList": [],
		"name": "经济全球化与中国的崛起"
	}, {
		"cid": "PS004",
		"kaikeList": [{
			"bsid": "373385",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院308(1-11周).秦裕林 教授"
		}],
		"name": "认知心理学及其应用"
	}],
	"name": "凯原法学院",
	"xyid": "19000"
}, {
	"courseList": [{
		"cid": "AD001",
		"kaikeList": [{
			"bsid": "373467",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n上院420(1-16周).马红冰 讲师(高校)"
		}],
		"name": "素描"
	}, {
		"cid": "AD903",
		"kaikeList": [],
		"name": "广告的力量"
	}, {
		"cid": "AR007",
		"kaikeList": [{
			"bsid": "373468",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院420(1-16周).马红冰 讲师(高校)"
		}],
		"name": "色彩艺术"
	}, {
		"cid": "AR902",
		"kaikeList": [],
		"name": "图形创意设计"
	}, {
		"cid": "AR903",
		"kaikeList": [],
		"name": "设计创新的艺术"
	}, {
		"cid": "CH902",
		"kaikeList": [],
		"name": "唐诗宋词人文解读"
	}, {
		"cid": "CL902",
		"kaikeList": [],
		"name": "中国文化的全球传播"
	}, {
		"cid": "DR001",
		"kaikeList": [{
			"bsid": "373473",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n中院100(1-16周).徐庆华 副教授"
		}],
		"name": "书法艺术"
	}, {
		"cid": "DR002",
		"kaikeList": [{
			"bsid": "373474",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院100(1-16周).no 徐庆华 副教授"
		}],
		"name": "篆刻艺术"
	}, {
		"cid": "DR010",
		"kaikeList": [{
			"bsid": "373469",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院308(1-16周).王宏卫 讲师(高校)"
		}],
		"name": "绘画基础"
	}, {
		"cid": "EC905",
		"kaikeList": [],
		"name": "媒体创意经济"
	}, {
		"cid": "MT904",
		"kaikeList": [],
		"name": "科学与艺术-材料科学与设计艺术"
	}, {
		"cid": "PH015",
		"kaikeList": [{
			"bsid": "373471",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).施健 副教授"
		}, {
			"bsid": "373472",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n.(1-11周).施健 副教授"
		}],
		"name": "宝玉石鉴定法"
	}, {
		"cid": "PH020",
		"kaikeList": [{
			"bsid": "373470",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院102(1-16周).施健 副教授"
		}],
		"name": "地球科学"
	}, {
		"cid": "PU906",
		"kaikeList": [],
		"name": "经济与社会伦理"
	}, {
		"cid": "SO902",
		"kaikeList": [],
		"name": "文化的魅力"
	}, {
		"cid": "SO923",
		"kaikeList": [],
		"name": "新闻媒介与社会"
	}, {
		"cid": "SO935",
		"kaikeList": [],
		"name": "艺术、媒介与创造性思维"
	}, {
		"cid": "SO938",
		"kaikeList": [],
		"name": "大众传播与社会问题"
	}, {
		"cid": "SO939",
		"kaikeList": [],
		"name": "大众传媒与文化"
	}, {
		"cid": "SP160",
		"kaikeList": [],
		"name": "西方美术与创新思维"
	}, {
		"cid": "SP199",
		"kaikeList": [],
		"name": "中国新闻解读与中国问题研究"
	}, {
		"cid": "SP222",
		"kaikeList": [],
		"name": "时政评论"
	}],
	"name": "媒体与设计学院",
	"xyid": "20000"
}, {
	"courseList": [],
	"name": "微电子学院",
	"xyid": "21000"
}, {
	"courseList": [],
	"name": "继续教育学院",
	"xyid": "22000"
},
{
	"courseList": [{
		"cid": "CH931",
		"kaikeList": [],
		"name": "老庄元典选读"
	}, {
		"cid": "EC903",
		"kaikeList": [],
		"name": "《资本论》选读"
	}, {
		"cid": "HI927",
		"kaikeList": [],
		"name": "世界文化史"
	}, {
		"cid": "LO901",
		"kaikeList": [],
		"name": "推理与思维训练"
	}, {
		"cid": "PI034",
		"kaikeList": [{
			"bsid": "373706",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院201(1-16周).Frank Hoffman 教授"
		}],
		"name": "伦理道德哲学"
	}, {
		"cid": "PI901",
		"kaikeList": [],
		"name": "哲学智慧与创新思维"
	}, {
		"cid": "PU981",
		"kaikeList": [],
		"name": "组织文化研究"
	}, {
		"cid": "TH009",
		"kaikeList": [{
			"bsid": "372970",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院109(1-16周).史宏波"
		}, {
			"bsid": "372972",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院100(1-16周).谈毅"
		}, {
			"bsid": "372974",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院110(1-16周).丁东锋"
		}, {
			"bsid": "372975",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院101(1-16周).喜苏南"
		}, {
			"bsid": "372976",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院101(1-16周).喜苏南 副教授(高校思政)"
		}, {
			"bsid": "372977",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院103(1-16周).陈华栋"
		}, {
			"bsid": "372979",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院103(1-16周).陈华栋 副研究员(高教管理)"
		}, {
			"bsid": "372980",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院201(1-16周).徐剑波"
		}, {
			"bsid": "372981",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院201(1-16周).徐剑波 副研究员(高教管理)"
		}, {
			"bsid": "372982",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院203(1-16周).赵加强"
		}, {
			"bsid": "372983",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院200(1-16周).胡薇薇"
		}, {
			"bsid": "372984",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院300(1-16周).黄庆桥"
		}, {
			"bsid": "372985",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院300(1-16周).黄庆桥 讲师(高校思政)"
		}, {
			"bsid": "372986",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院301(1-16周).蒋立峰"
		}, {
			"bsid": "372987",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院303(1-16周).顾希垚"
		}, {
			"bsid": "372988",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院305(1-16周).吕忆松"
		}, {
			"bsid": "372989",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院305(1-16周).吕忆松 副教授"
		}, {
			"bsid": "372990",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院100(1-16周).郑浩"
		}, {
			"bsid": "372991",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院100(1-16周).郑浩 讲师(高校思政)"
		}, {
			"bsid": "372992",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院304(1-16周).李莹莹"
		}, {
			"bsid": "372994",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院304(1-16周).李莹莹 讲师(高校思政)"
		}, {
			"bsid": "372995",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院305(1-16周).陈丽璘 助理研究员(高教管理)"
		}, {
			"bsid": "372997",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院303(1-16周).郑文栋"
		}, {
			"bsid": "372998",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院403(1-16周).张燕红"
		}, {
			"bsid": "373000",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院404(1-16周).冯霞"
		}, {
			"bsid": "373001",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院405(1-16周).梁钦"
		}, {
			"bsid": "373002",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院405(1-16周).梁钦 助教(高校思政)"
		}, {
			"bsid": "373003",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院102(1-16周).卢建川 讲师(高校思政)"
		}, {
			"bsid": "373004",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院102(1-16周).卢建川 讲师(高校思政)"
		}, {
			"bsid": "373588",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院305(1-16周).陈丽璘 助理研究员(高教管理)"
		}, {
			"bsid": "373720",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院103(1-16周).赵昕"
		}, {
			"bsid": "373721",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院103(1-16周).赵昕 讲师(高校思政)"
		}],
		"name": "形势与政策"
	}, {
		"cid": "TH021",
		"kaikeList": [{
			"bsid": "372465",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院109(1-16周).张一平"
		}],
		"name": "中国近现代史纲要"
	}],
	"name": "马克思主义学院",
	"xyid": "23000"
}, {
	"courseList": [],
	"name": "致远学院",
	"xyid": "24000"
}, {
	"courseList": [{
		"cid": "PE002",
		"kaikeList": [{
			"bsid": "373808",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).顾剑平 讲师(高校)"
		}, {
			"bsid": "373865",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).宋顺 助教(高校)"
		}, {
			"bsid": "373867",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).王斌 副教授"
		}, {
			"bsid": "373868",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).赵军民 讲师(高校)"
		}, {
			"bsid": "373869",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).束拉 讲师(高校)"
		}, {
			"bsid": "373871",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).张健 讲师(高校)"
		}, {
			"bsid": "373873",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).吴爱平 讲师(高校)"
		}, {
			"bsid": "373874",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).吴富勇 讲师(高校)"
		}, {
			"bsid": "373876",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).叶汉忠 讲师(高校)"
		}, {
			"bsid": "373877",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).顾剑平 讲师(高校)"
		}, {
			"bsid": "373878",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).黄英杰 副教授"
		}, {
			"bsid": "373879",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).张丽君 讲师(高校)"
		}, {
			"bsid": "373880",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).姚武 副教授"
		}, {
			"bsid": "373881",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).沈丽群 高等学校教师"
		}, {
			"bsid": "373882",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).俞军 副教授"
		}, {
			"bsid": "373883",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).窦秀敏 讲师(高校)"
		}, {
			"bsid": "373884",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).朱颖文 讲师(高校)"
		}, {
			"bsid": "373885",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).高芸 讲师(高校)"
		}],
		"name": "体育（2）"
	}, {
		"cid": "PE005",
		"kaikeList": [{
			"bsid": "373753",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第9节--第10节\n.(1-8周).刘美香 副教授"
		}, {
			"bsid": "373754",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期四 第9节--第10节\n.(9-16周).刘美香 副教授"
		}, {
			"bsid": "373755",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期一 第9节--第10节\n.(1-8周).朱洁 讲师(高校)"
		}, {
			"bsid": "373756",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n.(9-16周).朱洁 讲师(高校)"
		}, {
			"bsid": "373757",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期五 第9节--第10节\n上院302(1-8周).王泽民 副教授"
		}, {
			"bsid": "373758",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期五 第9节--第10节\n上院302(9-16周).王泽民 副教授"
		}],
		"name": "体育（5）"
	}, {
		"cid": "PE901",
		"kaikeList": [],
		"name": "体育文化"
	}, {
		"cid": "PE902",
		"kaikeList": [],
		"name": "运动技能与健身"
	}],
	"name": "体育系",
	"xyid": "25100"
}, {
	"courseList": [],
	"name": "巴黎高科卓越工程师学院",
	"xyid": "26000"
}, {
	"courseList": [],
	"name": "塑性成形技术与装备研究院",
	"xyid": "29100"
}, {
	"courseList": [],
	"name": "医学院(原二医大)",
	"xyid": "30000"
}, {
	"courseList": [{
		"cid": "AM016",
		"kaikeList": [{
			"bsid": "372932",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).陆宏弟 副研究馆员"
		}],
		"name": "网络环境下的文科信息检索"
	}, {
		"cid": "IN901",
		"kaikeList": [],
		"name": "信息素养与实践"
	}],
	"name": "图书馆",
	"xyid": "33000"
}, {
	"courseList": [],
	"name": "高等教育研究院",
	"xyid": "35000"
}, {
	"courseList": [],
	"name": "中美物流研究院",
	"xyid": "35100"
}, {
	"courseList": [{
		"cid": "CI006",
		"kaikeList": [{
			"bsid": "373704",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第10节--第11节\n.(1-16周).张燕俊 助教(高校)\n星期三 第10节--第11节\n.(1-16周).张燕俊 助教(高校)"
		}, {
			"bsid": "373705",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第10节--第11节\n.(1-16周).张永蓉 高等学校教师\n星期四 第10节--第11节\n.(1-16周).张永蓉 高等学校教师"
		}],
		"name": "初级汉语"
	}],
	"name": "国际教育学院",
	"xyid": "36000"
}, {
	"courseList": [{
		"cid": "CI222",
		"kaikeList": [{
			"bsid": "373006",
			"time": "(1-6周)\n行课安排为第1周 --- 第6周,其中:\n星期六 第1节--第4节\n.(1-6周).Dianne Atkinson 高等学校教师\n星期日 第1节--第4节\n.(1-6周).Dianne Atkinson 高等学校教师"
		}],
		"name": "跨文化交流"
	}],
	"name": "密西根学院",
	"xyid": "37000"
}, {
	"courseList": [],
	"name": "上海高级金融学院",
	"xyid": "38000"
}, {
	"courseList": [],
	"name": "创业学院",
	"xyid": "39000"
}, {
	"courseList": [],
	"name": "上海中医药大学",
	"xyid": "40000"
}, {
	"courseList": [],
	"name": "华东师范大学",
	"xyid": "40001"
}, {
	"courseList": [{
		"cid": "CS075",
		"kaikeList": [{
			"bsid": "372940",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-101(1-16周).林新华 助理研究员"
		}],
		"name": "高性能计算"
	}],
	"name": "网络信息中心",
	"xyid": "40100"
}, {
	"courseList": [],
	"name": "高性能计算中心",
	"xyid": "40110"
}, {
	"courseList": [],
	"name": "教育技术中心",
	"xyid": "40200"
}, {
	"courseList": [],
	"name": "档案馆",
	"xyid": "40300"
}, {
	"courseList": [],
	"name": "分析测试中心",
	"xyid": "40400"
}, {
	"courseList": [],
	"name": "出版社",
	"xyid": "40500"
}, {
	"courseList": [],
	"name": "交大附属中学",
	"xyid": "40600"
}, {
	"courseList": [{
		"cid": "AU015",
		"kaikeList": [{
			"bsid": "372787",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).季钢 副教授"
		}],
		"name": "单片机应用系统设计"
	}, {
		"cid": "ME011",
		"kaikeList": [{
			"bsid": "372791",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).曲凌 工程师"
		}],
		"name": "机器人设计与制作"
	}, {
		"cid": "ME013",
		"kaikeList": [{
			"bsid": "372793",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).陆顺寿 高级工程师"
		}],
		"name": "艺术铸造"
	}, {
		"cid": "ME043",
		"kaikeList": [{
			"bsid": "372790",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).王留芳 高级工程师"
		}],
		"name": "机器人控制基础"
	}, {
		"cid": "ME045",
		"kaikeList": [{
			"bsid": "372788",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n.(1-16周).李劲松 高级工程师"
		}],
		"name": "航模技术与实践"
	}, {
		"cid": "ME049",
		"kaikeList": [{
			"bsid": "372786",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).徐巍 工程师"
		}],
		"name": "创意设计与快速成形"
	}, {
		"cid": "ME058",
		"kaikeList": [{
			"bsid": "372789",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).宋立博 副研究员"
		}],
		"name": "机器人机电一体化设计导论与工程实践"
	}, {
		"cid": "ME070",
		"kaikeList": [{
			"bsid": "372792",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).范成杰 工程师"
		}],
		"name": "机械创新设计"
	}, {
		"cid": "ME090",
		"kaikeList": [{
			"bsid": "373386",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第13节\n.(1-16周).张培艳 副研究员"
		}],
		"name": "工程认知实践"
	}, {
		"cid": "ME901",
		"kaikeList": [],
		"name": "工程技术探究"
	}],
	"name": "工程训练中心",
	"xyid": "41000"
}, {
	"courseList": [{
		"cid": "SY901",
		"kaikeList": [],
		"name": "系统思考与科学决策"
	}],
	"name": "航空航天学院",
	"xyid": "41300"
}, {
	"courseList": [],
	"name": "系统生物医学研究院",
	"xyid": "41500"
}, {
	"courseList": [],
	"name": "Med-X研究院",
	"xyid": "41600"
}, {
	"courseList": [{
		"cid": "JC024",
		"kaikeList": [{
			"bsid": "372925",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东中院1-100(1-16周).谢耘耕 研究员"
		}],
		"name": "新媒体与社会"
	}, {
		"cid": "MU034",
		"kaikeList": [{
			"bsid": "372922",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).周丽娴 助教(高校)"
		}],
		"name": "歌曲欣赏与演唱"
	}, {
		"cid": "SO084",
		"kaikeList": [{
			"bsid": "372924",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-202(1-16周).韩瑞霞 科学研究人员"
		}],
		"name": "社会调查研究方法"
	}, {
		"cid": "SO089",
		"kaikeList": [{
			"bsid": "372923",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-302(1-16周).韩瑞霞 科学研究人员"
		}],
		"name": "情感与社会"
	}],
	"name": "人文艺术研究院",
	"xyid": "41700"
}, {
	"courseList": [],
	"name": "先进产业技术研究院",
	"xyid": "41800"
}, {
	"courseList": [],
	"name": "自然科学研究院",
	"xyid": "41900"
}, {
	"courseList": [],
	"name": "海洋水下工程科学研究院",
	"xyid": "42000"
}, {
	"courseList": [],
	"name": "钱学森图书馆",
	"xyid": "42100"
}, {
	"courseList": [],
	"name": "教学发展中心",
	"xyid": "42200"
}, {
	"courseList": [],
	"name": "党委办公室",
	"xyid": "50100"
}, {
	"courseList": [{
		"cid": "HI033",
		"kaikeList": [{
			"bsid": "372945",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院405(1-16周).盛懿 研究馆员\n中院405(1-16周).欧七斤 副研究馆员(图书)"
		}],
		"name": "交大的历史与文化"
	}],
	"name": "党、校史研究室",
	"xyid": "50120"
}, {
	"courseList": [],
	"name": "党委组织部",
	"xyid": "50200"
}, {
	"courseList": [],
	"name": "纪委",
	"xyid": "50300"
}, {
	"courseList": [],
	"name": "党委宣传部",
	"xyid": "50400"
}, {
	"courseList": [{
		"cid": "PS007",
		"kaikeList": [{
			"bsid": "373490",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).杨文圣 副教授(高校思政)"
		}],
		"name": "咨询心理学概论"
	}, {
		"cid": "SO004",
		"kaikeList": [{
			"bsid": "372953",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).汪国琴 副教授(高校思政)"
		}],
		"name": "情感心理学"
	}, {
		"cid": "SO013",
		"kaikeList": [{
			"bsid": "372864",
			"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院322(9-16周).高晶鑫 讲师(高校思政)"
		}],
		"name": "大学生成功就业指导"
	}, {
		"cid": "SO018",
		"kaikeList": [{
			"bsid": "372955",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期五 第6节--第8节\n.(1-11周).陈进 副教授(高校思政)"
		}],
		"name": "心理自助"
	}, {
		"cid": "SO046",
		"kaikeList": [{
			"bsid": "372865",
			"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第9节--第10节\n下院310(1-8周).王业 助理研究员(高教管理)"
		}],
		"name": "求职礼仪和面试心理调控(B)"
	}, {
		"cid": "SO068",
		"kaikeList": [{
			"bsid": "372866",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n下院512(1-11周).钱静峰 副教授(高校思政)"
		}],
		"name": "职业发展素养与成功就业训练"
	}, {
		"cid": "SO078",
		"kaikeList": [{
			"bsid": "372931",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n东下院100(1-16周).方曦 讲师(高校思政)\n东下院100(1-16周).王丽华 讲师(高校思政)\n东下院100(1-16周).卢永彬 讲师(高校)"
		}],
		"name": "卓越领导力：成功人生之道"
	}, {
		"cid": "SO301",
		"kaikeList": [{
			"bsid": "372954",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).易晓明 副教授(高校思政)"
		}],
		"name": "日常生活中的心理学"
	}, {
		"cid": "SO936",
		"kaikeList": [],
		"name": "职业生涯发展与规划"
	}, {
		"cid": "TY001",
		"kaikeList": [{
			"bsid": "372948",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第11节--第13节\n.(1-11周).陈猛 副教授(高校思政)\n.(1-11周).孟祥琦 讲师(高校思政)"
		}],
		"name": "“UTJS”体验式教育"
	}, {
		"cid": "TY002",
		"kaikeList": [{
			"bsid": "372952",
			"time": "(2-8周)\n行课安排为第2周 --- 第8周,其中:\n星期二 第11节--第13节\n.(2-8周).朱春玲 讲师(高校思政)"
		}],
		"name": "“UTJS”体验式教育——沟通与演讲"
	}, {
		"cid": "WA901",
		"kaikeList": [],
		"name": "孙子兵法"
	}, {
		"cid": "XP000",
		"kaikeList": [{
			"bsid": "372500",
			"time": "(1-26周)\n行课安排为第1周 --- 第26周,其中:\n星期六 第7节--第8节\n.(1-26周).方曦 讲师(高校思政)"
		}],
		"name": "通识教育实践活动"
	}],
	"name": "学指委、团委(含学生处、人武部)",
	"xyid": "50500"
}, {
	"courseList": [{
		"cid": "TH010",
		"kaikeList": [{
			"bsid": "372494",
			"time": "(23-28周)\n行课安排为第23周 --- 第28周,其中:\n星期日 第1节--第2节\n.(23-28周).闫成 讲师(高校)"
		}],
		"name": "军训"
	}],
	"name": "军事教研室",
	"xyid": "50501"
}, {
	"courseList": [],
	"name": "工会妇委会",
	"xyid": "50600"
}, {
	"courseList": [],
	"name": "改革与发展研究室",
	"xyid": "50700"
}, {
	"courseList": [],
	"name": "党委统战部",
	"xyid": "50800"
}, {
	"courseList": [],
	"name": "信息安全管理办公室",
	"xyid": "50900"
}, {
	"courseList": [],
	"name": "校长办公室",
	"xyid": "60100"
}, {
	"courseList": [],
	"name": "教务处",
	"xyid": "60200"
}, {
	"courseList": [],
	"name": "研究生院",
	"xyid": "60300"
}, {
	"courseList": [],
	"name": "科学技术发展研究院",
	"xyid": "60400"
}, {
	"courseList": [],
	"name": "国际合作与交流处",
	"xyid": "60500"
}, {
	"courseList": [],
	"name": "留学生发展中心",
	"xyid": "60520"
}, {
	"courseList": [],
	"name": "人力资源处",
	"xyid": "60600"
}, {
	"courseList": [],
	"name": "财务处",
	"xyid": "60700"
}, {
	"courseList": [],
	"name": "保卫处",
	"xyid": "60800"
}, {
	"courseList": [],
	"name": "规划发展处",
	"xyid": "60900"
}, {
	"courseList": [],
	"name": "基建处",
	"xyid": "61000"
}, {
	"courseList": [],
	"name": "资产管理处",
	"xyid": "61100"
}, {
	"courseList": [],
	"name": "实验室与设备处",
	"xyid": "61200"
}, {
	"courseList": [],
	"name": "后勤保障处",
	"xyid": "61300"
}, {
	"courseList": [],
	"name": "211/985办公室",
	"xyid": "61400"
}, {
	"courseList": [],
	"name": "211/985办公室",
	"xyid": "61410"
}, {
	"courseList": [],
	"name": "文科建设处",
	"xyid": "61700"
}, {
	"courseList": [],
	"name": "发展联络处",
	"xyid": "61800"
}, {
	"courseList": [],
	"name": "信息化办公室",
	"xyid": "62000"
}, {
	"courseList": [],
	"name": "学科发展与建设处(原)",
	"xyid": "62100"
}, {
	"courseList": [],
	"name": "地方合作办公室",
	"xyid": "62300"
}, {
	"courseList": [],
	"name": "招投标办公室",
	"xyid": "62400"
}, {
	"courseList": [],
	"name": "科研生产质量管理办公室",
	"xyid": "62500"
}, {
	"courseList": [],
	"name": "其他部门",
	"xyid": "69100"
}, {
	"courseList": [{
		"cid": "BM906",
		"kaikeList": [],
		"name": "性与健康"
	}, {
		"cid": "BM909",
		"kaikeList": [],
		"name": "社会精神医学"
	}, {
		"cid": "PS907",
		"kaikeList": [],
		"name": "积极心理学"
	}, {
		"cid": "SO032",
		"kaikeList": [{
			"bsid": "372957",
			"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院104(1-11周).蔡骏 助理研究员"
		}],
		"name": "人际沟通艺术与技巧"
	}],
	"name": "医学院",
	"xyid": "70000"
}, {
	"courseList": [],
	"name": "后勤集团",
	"xyid": "80000"
}, {
	"courseList": [{
		"cid": "BM016",
		"kaikeList": [{
			"bsid": "372946",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院100(1-16周).刘金生 副主任医师\n上院100(1-16周).黄晓兰 副主任医师\n上院100(1-16周).林志华 主治医师"
		}],
		"name": "大学生健康教育"
	}],
	"name": "校医院",
	"xyid": "80310"
}, {
	"courseList": [{
		"cid": "BM021",
		"kaikeList": [{
			"bsid": "372947",
			"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院100(1-16周).刘金生 副主任医师"
		}],
		"name": "急救与自救"
	}],
	"name": "校医院",
	"xyid": "80510"
}, {
	"courseList": [],
	"name": "上海交大产业投资管理（集团）有限公司",
	"xyid": "90000"
}, {
	"courseList": [],
	"name": "人才交流中心",
	"xyid": "99000"
}, {
	"courseList": [],
	"name": "上海立信会计学院",
	"xyid": "999003"
}, {
	"courseList": [],
	"name": "华东理工大学",
	"xyid": "999007"
}]