/*
这个文件里存放了当前学期的选课数据
包括从网站上抓取下来的数据(经过java加工) 和 可以冲抵通识课的数据(经过java加工)
这里简单介绍一下结构
学院(xy)下面有课程列表(courseList),课程下面有开课列表(kaikeList)
一般来说课程不是重要的, 而开课才是重要的
因此在在学院里添加一个字段, kaikeList, 它为所有的课程的开课列表的和 (这样用起来比较方便)

特殊规定:
	0我的收藏 1人文 2社会 3自然 4数学 5抵人文 6抵社会 7抵自然 8抵数学
	
*/
define(function (require, exports, module) {
	var $ = require('jquery');
	var _ = require('lodash');

	//这里存放了 xy course kaike 的 三级数据
	var xyList = [{
		"courseList": [{
			"cid": "AD903",
			"kaikeList": [{
				"bsid": "373369",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东下院201",
				"startWeek": 1,
				"teacherList": ["萧冰 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东下院201(1-16周).萧冰 副教授"
			}],
			"name": "广告的力量"
		}, {
			"cid": "AR901",
			"kaikeList": [{
				"bsid": "372579",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "下院205",
				"startWeek": 1,
				"teacherList": ["刘士兴", "赵冬梅", "卢琦", "王浩娱"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院205(1-16周).刘士兴\n下院205(1-16周).赵冬梅\n下院205(1-16周).卢琦\n下院205(1-16周).王浩娱"
			}],
			"name": "建筑赏析"
		}, {
			"cid": "AR902",
			"kaikeList": [{
				"bsid": "373377",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "下院201",
				"startWeek": 9,
				"teacherList": ["席涛 教授"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n下院201(9-16周).席涛 教授\n星期四 第9节--第10节\n下院201(9-16周).席涛 教授"
			}],
			"name": "图形创意设计"
		}, {
			"cid": "AR903",
			"kaikeList": [{
				"bsid": "373381",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院212",
				"startWeek": 1,
				"teacherList": ["韩挺 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院212(1-11周).韩挺 副教授"
			}],
			"name": "设计创新的艺术"
		}, {
			"cid": "BI902",
			"kaikeList": [{
				"bsid": "372705",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院103",
				"startWeek": 1,
				"teacherList": ["王莲芸 教授", "林志新 教授", "蒋群 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院103(1-16周).王莲芸 教授\n东上院103(1-16周).林志新 教授\n东上院103(1-16周).蒋群 副教授"
			}],
			"name": "生命伦理学"
		}, {
			"cid": "BM901",
			"kaikeList": [{
				"bsid": "372734",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东中院4-205",
				"startWeek": 1,
				"teacherList": ["彭崇胜 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院4-205(1-16周).彭崇胜 副教授"
			}],
			"name": "中医药与中华传统文化"
		}, {
			"cid": "CH901",
			"kaikeList": [{
				"bsid": "372655",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院104",
				"startWeek": 1,
				"teacherList": ["丁晓萍 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院104(1-16周).丁晓萍 副教授"
			}],
			"name": "大学语文"
		}, {
			"cid": "CH902",
			"kaikeList": [{
				"bsid": "373950",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院2-302",
				"startWeek": 1,
				"teacherList": ["李康化 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院2-302(1-16周).李康化 副教授"
			}],
			"name": "唐诗宋词人文解读"
		}, {
			"cid": "CH903",
			"kaikeList": [{
				"bsid": "372654",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院4-404",
				"startWeek": 1,
				"teacherList": ["文学武 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-404(1-16周).文学武 教授"
			}],
			"name": "20世纪中国文学名著欣赏"
		}, {
			"cid": "CH904",
			"kaikeList": [{
				"bsid": "372660",
				"endWeek": 11,
				"fmtTime": "四(6-8)",
				"room": "东中院3-104",
				"startWeek": 1,
				"teacherList": ["刘元春 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n东中院3-104(1-11周).刘元春 讲师(高校)"
			}],
			"name": "汉字文化"
		}, {
			"cid": "CH906",
			"kaikeList": [{
				"bsid": "372658",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "中院109",
				"startWeek": 1,
				"teacherList": ["张玉梅 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n中院109(1-16周).张玉梅 副教授"
			}],
			"name": "古典诗词鉴赏与创作"
		}, {
			"cid": "CH911",
			"kaikeList": [{
				"bsid": "372676",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "中院107",
				"startWeek": 1,
				"teacherList": ["刘佑军 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n中院107(1-16周).刘佑军 副教授"
			}],
			"name": "外国文学史(C）"
		}, {
			"cid": "CH912",
			"kaikeList": [{
				"bsid": "372666",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "下院108",
				"startWeek": 1,
				"teacherList": ["姚旭峰 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院108(1-16周).姚旭峰 副教授"
			}],
			"name": "历代名词人研究"
		}, {
			"cid": "CH927",
			"kaikeList": [{
				"bsid": "372681",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院204",
				"startWeek": 1,
				"teacherList": ["汪云霞 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院204(1-16周).汪云霞 副教授"
			}],
			"name": "中国现代诗歌导读"
		}, {
			"cid": "CH929",
			"kaikeList": [{
				"bsid": "372659",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-103",
				"startWeek": 1,
				"teacherList": ["郭曙纶 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-103(1-16周).郭曙纶 副教授"
			}],
			"name": "汉语与认知：由汉语看汉民族的认知特点"
		}, {
			"cid": "CH931",
			"kaikeList": [{
				"bsid": "373359",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院302",
				"startWeek": 1,
				"teacherList": ["徐临江 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院302(1-16周).徐临江 讲师(高校)"
			}],
			"name": "老庄元典选读"
		}, {
			"cid": "CH932",
			"kaikeList": [{
				"bsid": "372680",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院3-104",
				"startWeek": 1,
				"teacherList": ["符杰祥 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-104(1-16周).符杰祥 副教授"
			}],
			"name": "现代中国文学与文化"
		}, {
			"cid": "CL902",
			"kaikeList": [{
				"bsid": "373374",
				"endWeek": 8,
				"fmtTime": "二(7-10)",
				"room": "东下院301",
				"startWeek": 1,
				"teacherList": ["姚君喜 教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第7节--第10节\n东下院301(1-8周).姚君喜 教授"
			}],
			"name": "中国文化的全球传播"
		}, {
			"cid": "CL907",
			"kaikeList": [{
				"bsid": "372672",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["汪云霞 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院203(1-16周).汪云霞 副教授"
			}],
			"name": "世界华文文学专题"
		}, {
			"cid": "CL909",
			"kaikeList": [{
				"bsid": "372716",
				"endWeek": 16,
				"fmtTime": "四(11-12)",
				"room": "东上院507",
				"startWeek": 1,
				"teacherList": ["施旻 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第11节--第12节\n东上院507(1-16周).施旻 副教授"
			}],
			"name": "女性文学与性别文化"
		}, {
			"cid": "CL915",
			"kaikeList": [{
				"bsid": "372717",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院4-402",
				"startWeek": 1,
				"teacherList": ["童剑平 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-402(1-16周).童剑平 副教授"
			}],
			"name": "欧洲文化导论"
		}, {
			"cid": "CL919",
			"kaikeList": [{
				"bsid": "372656",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院103",
				"startWeek": 1,
				"teacherList": ["高宣扬 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院103(1-16周).高宣扬 教授"
			}],
			"name": "当代西方人文艺术思潮"
		}, {
			"cid": "EN901",
			"kaikeList": [{
				"bsid": "372725",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院316",
				"startWeek": 1,
				"teacherList": ["陆元雯 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院316(1-16周).陆元雯 副教授"
			}],
			"name": "英语写作"
		}, {
			"cid": "EN903",
			"kaikeList": [{
				"bsid": "372721",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院204",
				"startWeek": 1,
				"teacherList": ["赵晓红 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院204(1-16周).赵晓红 副教授"
			}, {
				"bsid": "372722",
				"endWeek": 16,
				"fmtTime": "四(7-8)",
				"room": "东上院504",
				"startWeek": 1,
				"teacherList": ["杨晓玲 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n东上院504(1-16周).杨晓玲 副教授"
			}, {
				"bsid": "372723",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院504",
				"startWeek": 1,
				"teacherList": ["杨晓玲 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院504(1-16周).杨晓玲 副教授"
			}],
			"name": "英语公众演讲"
		}, {
			"cid": "EN904",
			"kaikeList": [{
				"bsid": "372718",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东中院4-103",
				"startWeek": 1,
				"teacherList": ["李琤 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院4-103(1-16周).李琤 讲师(高校)"
			}],
			"name": "莎士比亚戏剧赏析"
		}, {
			"cid": "EN905",
			"kaikeList": [{
				"bsid": "372724",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院204",
				"startWeek": 1,
				"teacherList": ["李宏德 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院204(1-16周).李宏德 副教授"
			}],
			"name": "英语经典名作赏析"
		}, {
			"cid": "EN907",
			"kaikeList": [{
				"bsid": "372720",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院505",
				"startWeek": 1,
				"teacherList": ["卢小军 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院505(1-16周).卢小军 讲师(高校)"
			}],
			"name": "英国经典散文赏析"
		}, {
			"cid": "EN908",
			"kaikeList": [{
				"bsid": "372719",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院507",
				"startWeek": 1,
				"teacherList": ["张荔 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院507(1-16周).张荔 副教授"
			}],
			"name": "学术英语交际:写作与发言"
		}, {
			"cid": "GA901",
			"kaikeList": [{
				"bsid": "372652",
				"endWeek": 11,
				"fmtTime": "四(6-8)",
				"room": "东中院3-202",
				"startWeek": 1,
				"teacherList": ["李玉红 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n东中院3-202(1-11周).李玉红 副教授"
			}],
			"name": "与风景的对话——中外园林艺术欣赏"
		}, {
			"cid": "HI901",
			"kaikeList": [{
				"bsid": "372646",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "东下院303",
				"startWeek": 1,
				"teacherList": ["钮卫星 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东下院303(1-11周).钮卫星 教授"
			}],
			"name": "天文学史"
		}, {
			"cid": "HI903",
			"kaikeList": [{
				"bsid": "372667",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院3-202",
				"startWeek": 1,
				"teacherList": ["任玉雪 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-202(1-16周).任玉雪 副教授"
			}],
			"name": "美国的文化与历史"
		}, {
			"cid": "HI904",
			"kaikeList": [{
				"bsid": "372715",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "下院204",
				"startWeek": 1,
				"teacherList": ["魏啸飞 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院204(1-16周).魏啸飞 教授"
			}],
			"name": "历史视野下的美国文化"
		}, {
			"cid": "HI927",
			"kaikeList": [{
				"bsid": "373358",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "东上院102",
				"startWeek": 1,
				"teacherList": ["高福进 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东上院102(1-11周).高福进 教授"
			}],
			"name": "世界文化史"
		}, {
			"cid": "HI928",
			"kaikeList": [{
				"bsid": "372669",
				"endWeek": 16,
				"fmtTime": "五(6-8)",
				"room": "中院107",
				"startWeek": 1,
				"teacherList": ["王心扬 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n中院107(1-16周).王心扬 教授"
			}],
			"name": "美国历史上的重大问题"
		}, {
			"cid": "JC903",
			"kaikeList": [{
				"bsid": "372670",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院202",
				"startWeek": 1,
				"teacherList": ["易存国 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院202(1-16周).易存国 教授"
			}, {
				"bsid": "372671",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院112",
				"startWeek": 1,
				"teacherList": ["施立峻 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院112(1-11周).施立峻 副教授"
			}],
			"name": "美学"
		}, {
			"cid": "LI901",
			"kaikeList": [{
				"bsid": "372677",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "下院206",
				"startWeek": 1,
				"teacherList": ["张蕴艳 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院206(1-16周).张蕴艳 讲师(高校)"
			}],
			"name": "文学与人生"
		}, {
			"cid": "LI903",
			"kaikeList": [{
				"bsid": "374068",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院316",
				"startWeek": 1,
				"teacherList": ["何艳 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院316(1-16周).何艳 副教授"
			}],
			"name": "英美名诗赏析"
		}, {
			"cid": "MU901",
			"kaikeList": [{
				"bsid": "372661",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["胡逸薇 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东上院203(1-11周).胡逸薇 讲师(高校)"
			}, {
				"bsid": "372662",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["胡逸薇 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东上院203(1-11周).胡逸薇 讲师(高校)"
			}, {
				"bsid": "372663",
				"endWeek": 11,
				"fmtTime": "一(6-8)",
				"room": "上院407",
				"startWeek": 1,
				"teacherList": ["李莉 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n上院407(1-11周).李莉 讲师(高校)"
			}, {
				"bsid": "372664",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "上院407",
				"startWeek": 1,
				"teacherList": ["李莉 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院407(1-11周).李莉 讲师(高校)"
			}],
			"name": "交响音乐鉴赏"
		}, {
			"cid": "MU902",
			"kaikeList": [{
				"bsid": "372682",
				"endWeek": 11,
				"fmtTime": "一(6-8)",
				"room": "东上院107",
				"startWeek": 1,
				"teacherList": ["王茕 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东上院107(1-11周).王茕 讲师(高校)"
			}, {
				"bsid": "372683",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院107",
				"startWeek": 1,
				"teacherList": ["王茕 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院107(1-16周).王茕 讲师(高校)"
			}, {
				"bsid": "372684",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院205",
				"startWeek": 1,
				"teacherList": ["张沁 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院205(1-16周).张沁 讲师(高校)"
			}, {
				"bsid": "372685",
				"endWeek": 16,
				"fmtTime": "一(7-8)",
				"room": "东中院4-304",
				"startWeek": 1,
				"teacherList": ["李金叶 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第7节--第8节\n东中院4-304(1-16周).李金叶 副教授"
			}, {
				"bsid": "372686",
				"endWeek": 16,
				"fmtTime": "二(7-8)",
				"room": "下院407",
				"startWeek": 1,
				"teacherList": ["李金叶 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n下院407(1-16周).李金叶 副教授"
			}, {
				"bsid": "372687",
				"endWeek": 11,
				"fmtTime": "一(6-8)",
				"room": "东下院104",
				"startWeek": 1,
				"teacherList": ["胡慈舟 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东下院104(1-11周).胡慈舟 讲师(高校)"
			}],
			"name": "中西乐理及其应用"
		}, {
			"cid": "MU903",
			"kaikeList": [{
				"bsid": "372673",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院4-304",
				"startWeek": 1,
				"teacherList": ["李金叶 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-304(1-16周).李金叶 副教授"
			}, {
				"bsid": "372674",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "下院407",
				"startWeek": 1,
				"teacherList": ["李金叶 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院407(1-16周).李金叶 副教授"
			}, {
				"bsid": "372675",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院407",
				"startWeek": 1,
				"teacherList": ["李金叶 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院407(1-11周).李金叶 副教授"
			}],
			"name": "世界民族音乐鉴赏"
		}, {
			"cid": "PE901",
			"kaikeList": [{
				"bsid": "373741",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["吴爱平 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).吴爱平 讲师(高校)"
			}, {
				"bsid": "373742",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["王坤 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).王坤 副教授"
			}, {
				"bsid": "373743",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["姚武 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).姚武 副教授"
			}, {
				"bsid": "373744",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["朱慧芳 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).朱慧芳 副教授"
			}, {
				"bsid": "373745",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["王斌 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).王斌 副教授"
			}, {
				"bsid": "373746",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["范嘉浩 工程技术人员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).范嘉浩 工程技术人员"
			}],
			"name": "体育文化"
		}, {
			"cid": "PE902",
			"kaikeList": [{
				"bsid": "373747",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["叶汉忠 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).叶汉忠 讲师(高校)"
			}, {
				"bsid": "373748",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["王雅卓 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).王雅卓 讲师(高校)"
			}, {
				"bsid": "373749",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["尹梅 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).尹梅 讲师(高校)"
			}, {
				"bsid": "373750",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["董扬 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).董扬 副教授"
			}, {
				"bsid": "373751",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["杨仁康 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).杨仁康 副教授"
			}, {
				"bsid": "373752",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["贺志豪 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).贺志豪 副教授"
			}],
			"name": "运动技能与健身"
		}, {
			"cid": "PI901",
			"kaikeList": [{
				"bsid": "373360",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院303",
				"startWeek": 1,
				"teacherList": ["胡涵锦 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院303(1-11周).胡涵锦 教授"
			}],
			"name": "哲学智慧与创新思维"
		}, {
			"cid": "PI906",
			"kaikeList": [{
				"bsid": "372657",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院104",
				"startWeek": 1,
				"teacherList": ["孟令兵 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院104(1-16周).孟令兵 讲师(高校)"
			}],
			"name": "佛教与中国传统文化"
		}, {
			"cid": "PI913",
			"kaikeList": [{
				"bsid": "372678",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院104",
				"startWeek": 1,
				"teacherList": ["王晓阳 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院104(1-16周).王晓阳 副教授"
			}],
			"name": "西方哲学史"
		}, {
			"cid": "PI916",
			"kaikeList": [{
				"bsid": "372645",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东下院105",
				"startWeek": 1,
				"teacherList": ["王延锋 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东下院105(1-16周).王延锋 讲师(高校)"
			}],
			"name": "科学哲学"
		}, {
			"cid": "PI919",
			"kaikeList": [{
				"bsid": "372679",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院105",
				"startWeek": 1,
				"teacherList": ["陈勇 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院105(1-16周).陈勇 讲师(高校)"
			}],
			"name": "西方哲学史"
		}, {
			"cid": "PL902",
			"kaikeList": [{
				"bsid": "372648",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东中院1-201",
				"startWeek": 1,
				"teacherList": ["申晓辉 研究员", "李洁 副教授", "张荻 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院1-201(1-16周).申晓辉 研究员\n东中院1-201(1-16周).李洁 副教授\n东中院1-201(1-16周).张荻 助理研究员"
			}, {
				"bsid": "372649",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院1-202",
				"startWeek": 1,
				"teacherList": ["申晓辉 研究员", "李洁 副教授", "张荻 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-202(1-16周).申晓辉 研究员\n东中院1-202(1-16周).李洁 副教授\n东中院1-202(1-16周).张荻 助理研究员"
			}],
			"name": "国花、市花与文化"
		}, {
			"cid": "PS907",
			"kaikeList": [{
				"bsid": "372735",
				"endWeek": 16,
				"fmtTime": "二(11-13)",
				"room": "东上院205",
				"startWeek": 1,
				"teacherList": ["张艳萍 科学研究人员(高教管理)", "缪青 研究实习员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第13节\n东上院205(1-16周).张艳萍 科学研究人员(高教管理)\n东上院205(1-16周).缪青 研究实习员"
			}],
			"name": "积极心理学"
		}, {
			"cid": "SO902",
			"kaikeList": [{
				"bsid": "373366",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院302",
				"startWeek": 1,
				"teacherList": ["凌金铸 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院302(1-16周).凌金铸 教授"
			}, {
				"bsid": "373367",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东下院202",
				"startWeek": 1,
				"teacherList": ["凌金铸 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院202(1-16周).凌金铸 教授"
			}, {
				"bsid": "373368",
				"endWeek": 16,
				"fmtTime": "四(7-8)",
				"room": "东下院202",
				"startWeek": 1,
				"teacherList": ["凌金铸 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n东下院202(1-16周).凌金铸 教授"
			}],
			"name": "文化的魅力"
		}, {
			"cid": "SO935",
			"kaikeList": [{
				"bsid": "373380",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "下院102",
				"startWeek": 9,
				"teacherList": ["林迅 教授"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n下院102(9-16周).林迅 教授\n星期四 第9节--第10节\n下院102(9-16周).林迅 教授"
			}],
			"name": "艺术、媒介与创造性思维"
		}, {
			"cid": "SO939",
			"kaikeList": [{
				"bsid": "373370",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院4-102",
				"startWeek": 1,
				"teacherList": ["王茜 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-102(1-16周).王茜 讲师(高校)"
			}],
			"name": "大众传媒与文化"
		}, {
			"cid": "TO901",
			"kaikeList": [{
				"bsid": "372653",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院102",
				"startWeek": 1,
				"teacherList": ["周丕生 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院102(1-11周).周丕生 副教授"
			}],
			"name": "中国的世界文化与自然遗产"
		}, {
			"cid": "WA901",
			"kaikeList": [{
				"bsid": "372726",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "中院305",
				"startWeek": 1,
				"teacherList": ["闫成 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院305(1-11周).闫成 讲师(高校)"
			}],
			"name": "孙子兵法"
		}],
		"name": "人文学科",
		"xyid": "1"
	}, {
		"courseList": [{
			"cid": "BM906",
			"kaikeList": [{
				"bsid": "372737",
				"endWeek": 16,
				"fmtTime": "一(6-8)",
				"room": "下院209",
				"startWeek": 1,
				"teacherList": ["陈斌 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第6节--第8节\n下院209(1-16周).陈斌 教授"
			}],
			"name": "性与健康"
		}, {
			"cid": "BM909",
			"kaikeList": [{
				"bsid": "372736",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "下院110",
				"startWeek": 1,
				"teacherList": ["徐一峰 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院110(1-16周).徐一峰 教授"
			}],
			"name": "社会精神医学"
		}, {
			"cid": "EC903",
			"kaikeList": [{
				"bsid": "373357",
				"endWeek": 16,
				"fmtTime": "四(6-8)",
				"room": "中院107",
				"startWeek": 1,
				"teacherList": ["周泽红 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n中院107(1-16周).周泽红 副教授"
			}],
			"name": "《资本论》选读"
		}, {
			"cid": "EC905",
			"kaikeList": [{
				"bsid": "373376",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院418",
				"startWeek": 1,
				"teacherList": ["童清艳 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院418(1-11周).童清艳 教授"
			}],
			"name": "媒体创意经济"
		}, {
			"cid": "EV901",
			"kaikeList": [{
				"bsid": "372616",
				"endWeek": 8,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "东中院4-105",
				"startWeek": 1,
				"teacherList": ["刘书俊 副教授", "楼紫阳 副教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期一 第9节--第10节\n东中院4-105(1-8周).刘书俊 副教授\n东中院4-105(1-8周).楼紫阳 副教授\n星期四 第9节--第10节\n东中院4-105(1-8周).刘书俊 副教授\n东中院4-105(1-8周).楼紫阳 副教授"
			}],
			"name": "环境与可持续发展"
		}, {
			"cid": "LA910",
			"kaikeList": [{
				"bsid": "373364",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "上院306",
				"startWeek": 1,
				"teacherList": ["杨力 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院306(1-11周).杨力 教授"
			}],
			"name": "法律思维与法学经典阅读"
		}, {
			"cid": "LA911",
			"kaikeList": [{
				"bsid": "373362",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院312",
				"startWeek": 1,
				"teacherList": ["范进学 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院312(1-16周).范进学 教授"
			}],
			"name": "法律与道德"
		}, {
			"cid": "LA913",
			"kaikeList": [{
				"bsid": "373363",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东下院302",
				"startWeek": 6,
				"teacherList": ["王先林 教授", "李剑 教授", "侯利阳 副教授"],
				"time": "(6-16周)\n行课安排为第6周 --- 第16周,其中:\n星期二 第6节--第8节\n东下院302(6-16周).王先林 教授\n东下院302(6-16周).李剑 教授\n东下院302(6-16周).侯利阳 副教授"
			}],
			"name": "经济与法律"
		}, {
			"cid": "LA915",
			"kaikeList": [{
				"bsid": "373365",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院108",
				"startWeek": 1,
				"teacherList": ["张绍谦 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院108(1-16周).张绍谦 教授"
			}],
			"name": "刑法与生活"
		}, {
			"cid": "LA925",
			"kaikeList": [{
				"bsid": "373361",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院210",
				"startWeek": 1,
				"teacherList": ["胡加祥 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院210(1-11周).胡加祥 教授"
			}],
			"name": "经济全球化与中国的崛起"
		}, {
			"cid": "PS908",
			"kaikeList": [{
				"bsid": "372631",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-205",
				"startWeek": 1,
				"teacherList": ["陈景秋 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-205(1-16周).陈景秋 副教授"
			}],
			"name": "管理心理学"
		}, {
			"cid": "PU902",
			"kaikeList": [{
				"bsid": "372592",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院402",
				"startWeek": 1,
				"teacherList": ["周建国 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院402(1-16周).周建国 副教授"
			}],
			"name": "当代中国社会问题"
		}, {
			"cid": "PU906",
			"kaikeList": [{
				"bsid": "373375",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院1-104",
				"startWeek": 1,
				"teacherList": ["闻媛 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-104(1-16周).闻媛 副教授"
			}],
			"name": "经济与社会伦理"
		}, {
			"cid": "PU907",
			"kaikeList": [{
				"bsid": "372595",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院4-104",
				"startWeek": 1,
				"teacherList": ["郭俊华 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-104(1-16周).郭俊华 教授"
			}],
			"name": "公共政策与公民生活"
		}, {
			"cid": "PU908",
			"kaikeList": [{
				"bsid": "372603",
				"endWeek": 16,
				"fmtTime": "四(6-8)",
				"room": "东上院102",
				"startWeek": 1,
				"teacherList": ["张学昆 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院102(1-16周).张学昆 讲师(高校)"
			}],
			"name": "中俄关系的演变与展望"
		}, {
			"cid": "PU909",
			"kaikeList": [{
				"bsid": "372599",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院206",
				"startWeek": 1,
				"teacherList": ["翟新 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院206(1-16周).翟新 教授"
			}],
			"name": "现代日本政治"
		}, {
			"cid": "PU910",
			"kaikeList": [{
				"bsid": "372590",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院209",
				"startWeek": 1,
				"teacherList": ["王郁 教授", "吴建南 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院209(1-16周).王郁 教授\n上院209(1-16周).吴建南 教授"
			}],
			"name": "城市文明的历史与未来"
		}, {
			"cid": "PU914",
			"kaikeList": [{
				"bsid": "372593",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院101",
				"startWeek": 1,
				"teacherList": ["郑华 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院101(1-11周).郑华 教授"
			}],
			"name": "当代中国外交"
		}, {
			"cid": "PU917",
			"kaikeList": [{
				"bsid": "372601",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院306",
				"startWeek": 1,
				"teacherList": ["黄琪轩 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院306(1-16周).黄琪轩 副教授"
			}],
			"name": "政治经济学经典导读"
		}, {
			"cid": "PU936",
			"kaikeList": [{
				"bsid": "372597",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院506",
				"startWeek": 1,
				"teacherList": ["吴清 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院506(1-16周).吴清 副教授"
			}],
			"name": "民族主义与族群政治"
		}, {
			"cid": "PU937",
			"kaikeList": [{
				"bsid": "372591",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院103",
				"startWeek": 1,
				"teacherList": ["李明明 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院103(1-16周).李明明 副教授"
			}],
			"name": "大国战略"
		}, {
			"cid": "PU938",
			"kaikeList": [{
				"bsid": "372602",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院102",
				"startWeek": 1,
				"teacherList": ["章伟 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院102(1-16周).章伟 讲师(高校)"
			}],
			"name": "治理之善：公共行政热点解析"
		}, {
			"cid": "PU941",
			"kaikeList": [{
				"bsid": "372596",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院100",
				"startWeek": 1,
				"teacherList": ["卢永彬 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院100(1-16周).卢永彬 讲师(高校)"
			}],
			"name": "领导力学习与实践"
		}, {
			"cid": "PU942",
			"kaikeList": [{
				"bsid": "372600",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院212",
				"startWeek": 1,
				"teacherList": ["魏英杰 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院212(1-16周).魏英杰 讲师(高校)"
			}],
			"name": "政治的边界与逻辑"
		}, {
			"cid": "PU943",
			"kaikeList": [{
				"bsid": "372633",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "下院205",
				"startWeek": 1,
				"teacherList": ["黄丞 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院205(1-16周).黄丞 副教授"
			}],
			"name": "中国医疗保险制度的转型发展与创新"
		}, {
			"cid": "PU981",
			"kaikeList": [{
				"bsid": "373356",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院305",
				"startWeek": 1,
				"teacherList": ["周国华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院305(1-16周).周国华 副教授"
			}],
			"name": "组织文化研究"
		}, {
			"cid": "SO900",
			"kaikeList": [{
				"bsid": "372632",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "中院110",
				"startWeek": 1,
				"teacherList": ["史清华 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院110(1-11周).史清华 教授"
			}],
			"name": "社会学"
		}, {
			"cid": "SO923",
			"kaikeList": [{
				"bsid": "373372",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院411",
				"startWeek": 1,
				"teacherList": ["谢金文 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院411(1-16周).谢金文 教授"
			}],
			"name": "新闻媒介与社会"
		}, {
			"cid": "SO936",
			"kaikeList": [{
				"bsid": "372634",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["侯士兵 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).侯士兵 副教授(高校思政)"
			}, {
				"bsid": "372635",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "上院107",
				"startWeek": 1,
				"teacherList": ["沈延兵 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n上院107(1-16周).沈延兵 副教授(高校思政)"
			}, {
				"bsid": "372636",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院107",
				"startWeek": 1,
				"teacherList": ["任祝景 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院107(1-16周).任祝景 讲师(高校思政)"
			}, {
				"bsid": "372637",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院107",
				"startWeek": 1,
				"teacherList": ["鲁佳铭 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院107(1-16周).鲁佳铭 讲师(高校思政)"
			}, {
				"bsid": "372638",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "上院322",
				"startWeek": 1,
				"teacherList": ["阮海涛 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n上院322(1-16周).阮海涛 副教授(高校思政)"
			}, {
				"bsid": "372639",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院322",
				"startWeek": 1,
				"teacherList": ["薛云云 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院322(1-16周).薛云云 讲师(高校思政)"
			}, {
				"bsid": "372640",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "下院402",
				"startWeek": 1,
				"teacherList": ["尚建辉 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院402(1-16周).尚建辉 讲师(高校思政)"
			}, {
				"bsid": "372641",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院422",
				"startWeek": 1,
				"teacherList": ["钱静峰 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院422(1-16周).钱静峰 副教授(高校思政)"
			}, {
				"bsid": "372642",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院322",
				"startWeek": 1,
				"teacherList": ["刘燕芳 助教(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院322(1-16周).刘燕芳 助教(高校思政)"
			}, {
				"bsid": "372643",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院311",
				"startWeek": 1,
				"teacherList": ["宋玲 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院311(1-16周).宋玲 讲师(高校思政)"
			}, {
				"bsid": "372644",
				"endWeek": 16,
				"fmtTime": "四(7-8)",
				"room": "中院506",
				"startWeek": 1,
				"teacherList": ["吴海燕 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n中院506(1-16周).吴海燕 讲师(高校思政)"
			}],
			"name": "职业生涯发展与规划"
		}, {
			"cid": "SO937",
			"kaikeList": [{
				"bsid": "372594",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院405",
				"startWeek": 1,
				"teacherList": ["张录法 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院405(1-16周).张录法 副教授"
			}],
			"name": "风险与社会保障"
		}, {
			"cid": "SO938",
			"kaikeList": [{
				"bsid": "373371",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东上院306",
				"startWeek": 1,
				"teacherList": ["王昊 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院306(1-16周).���昊 副研究员"
			}],
			"name": "大众传播与社会问题"
		}, {
			"cid": "SO940",
			"kaikeList": [{
				"bsid": "372598",
				"endWeek": 11,
				"fmtTime": "一(11-13)",
				"room": "上院422",
				"startWeek": 1,
				"teacherList": ["杜江勤 讲师(高校)", "吴建南 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第11节--第13节\n上院422(1-11周).杜江勤 讲师(高校)\n上院422(1-11周).吴建南 教授"
			}],
			"name": "社会科学研究方法"
		}],
		"name": "社会科学",
		"xyid": "2"
	}, {
		"courseList": [{
			"cid": "AB901",
			"kaikeList": [{
				"bsid": "372650",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院307",
				"startWeek": 1,
				"teacherList": ["曹林奎 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院307(1-16周).曹林奎 教授"
			}],
			"name": "现代农业与生态文明"
		}, {
			"cid": "AM904",
			"kaikeList": [{
				"bsid": "372574",
				"endWeek": 9,
				"fmtTime": "二(7-8),四(9-10)",
				"room": "东上院307",
				"startWeek": 2,
				"teacherList": ["周岱 教授"],
				"time": "(2-9周)\n行课安排为第2周 --- 第9周,其中:\n星期二 第7节--第8节\n东上院307(2-9周).周岱 教授\n星期四 第9节--第10节\n东上院307(2-9周).周岱 教授"
			}],
			"name": "工程可持续发展"
		}, {
			"cid": "BI001",
			"kaikeList": [{
				"bsid": "372691",
				"endWeek": 12,
				"fmtTime": "二(11-13)",
				"room": "下院206",
				"startWeek": 2,
				"teacherList": ["林志新 教授", "柳向龙 讲师(高校)"],
				"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期二 第11节--第13节\n下院206(2-12周).林志新 教授\n下院206(2-12周).柳向龙 讲师(高校)"
			}, {
				"bsid": "372692",
				"endWeek": 12,
				"fmtTime": "二(6-8)",
				"room": "下院309",
				"startWeek": 2,
				"teacherList": ["陈峰 副教授"],
				"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期二 第6节--第8节\n下院309(2-12周).陈峰 副教授"
			}, {
				"bsid": "372693",
				"endWeek": 12,
				"fmtTime": "一(3-5)",
				"room": "东上院106",
				"startWeek": 2,
				"teacherList": ["马伟 副教授"],
				"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期一 第3节--第5节\n东上院106(2-12周).马伟 副教授"
			}, {
				"bsid": "372696",
				"endWeek": 12,
				"fmtTime": "四(6-8)",
				"room": "下院205",
				"startWeek": 2,
				"teacherList": ["柳向龙 讲师(高校)"],
				"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期四 第6节--第8节\n下院205(2-12周).柳向龙 讲师(高校)"
			}, {
				"bsid": "372697",
				"endWeek": 12,
				"fmtTime": "五(11-13)",
				"room": "下院208",
				"startWeek": 2,
				"teacherList": ["柳向龙 讲师(高校)"],
				"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期五 第11节--第13节\n下院208(2-12周).柳向龙 讲师(高校)"
			}],
			"name": "生命科学导论"
		}, {
			"cid": "BI901",
			"kaikeList": [{
				"bsid": "373951",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院201",
				"startWeek": 1,
				"teacherList": ["孟和 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院201(1-16周).孟和 教授"
			}],
			"name": "生命科学发展史"
		}, {
			"cid": "BI903",
			"kaikeList": [{
				"bsid": "372699",
				"endWeek": 15,
				"fmtTime": "二(7-10)",
				"room": ".",
				"startWeek": 7,
				"teacherList": ["曹阳 高级实验师"],
				"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期二 第7节--第10节\n.(7-15周).曹阳 高级实验师"
			}, {
				"bsid": "372700",
				"endWeek": 15,
				"fmtTime": "四(7-10)",
				"room": ".",
				"startWeek": 7,
				"teacherList": ["曹阳 高级实验师"],
				"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期四 第7节--第10节\n.(7-15周).曹阳 高级实验师"
			}, {
				"bsid": "372701",
				"endWeek": 15,
				"fmtTime": "五(7-10)",
				"room": ".",
				"startWeek": 7,
				"teacherList": ["曹阳 高级实验师"],
				"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期五 第7节--第10节\n.(7-15周).曹阳 高级实验师"
			}, {
				"bsid": "372702",
				"endWeek": 15,
				"fmtTime": "二(7-10)",
				"room": ".",
				"startWeek": 7,
				"teacherList": ["郑有丽 工程师"],
				"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期二 第7节--第10节\n.(7-15周).郑有丽 工程师"
			}, {
				"bsid": "372703",
				"endWeek": 15,
				"fmtTime": "四(7-10)",
				"room": ".",
				"startWeek": 7,
				"teacherList": ["秦敏君 实验师"],
				"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期四 第7节--第10节\n.(7-15周).秦敏君 实验师"
			}, {
				"bsid": "372704",
				"endWeek": 15,
				"fmtTime": "五(7-10)",
				"room": ".",
				"startWeek": 7,
				"teacherList": ["何丽明 实验师"],
				"time": "(7-15周)\n行课安排为第7周 --- 第15周,其中:\n星期五 第7节--第10节\n.(7-15周).何丽明 实验师"
			}],
			"name": "生命科学实验探索"
		}, {
			"cid": "BI905",
			"kaikeList": [{
				"bsid": "372689",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院207",
				"startWeek": 1,
				"teacherList": ["褚建君 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院207(1-16周).褚建君 副教授"
			}],
			"name": "地球生命"
		}, {
			"cid": "BI907",
			"kaikeList": [{
				"bsid": "372731",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院107",
				"startWeek": 1,
				"teacherList": ["李大伟 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院107(1-16周).李大伟 教授"
			}],
			"name": "基因与人"
		}, {
			"cid": "BI911",
			"kaikeList": [{
				"bsid": "372706",
				"endWeek": 13,
				"fmtTime": "一(6-8)",
				"room": "东中院3-402",
				"startWeek": 3,
				"teacherList": ["张雪洪 教授", "王威 副教授"],
				"time": "(3-13周)\n行课安排为第3周 --- 第13周,其中:\n星期一 第6节--第8节\n东中院3-402(3-13周).张雪洪 教授\n东中院3-402(3-13周).王威 副教授"
			}],
			"name": "生物工程导论"
		}, {
			"cid": "BI912",
			"kaikeList": [{
				"bsid": "372651",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院208",
				"startWeek": 1,
				"teacherList": ["陈火英 教授", "葛海燕 实验师"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院208(1-11周).陈火英 教授\n上院208(1-11周).葛海燕 实验师"
			}],
			"name": "遗传学与社会"
		}, {
			"cid": "BI915",
			"kaikeList": [{
				"bsid": "372707",
				"endWeek": 12,
				"fmtTime": "一(6-8)",
				"room": "下院307",
				"startWeek": 2,
				"teacherList": ["陈峰 副教授", "梁如冰 副研究员"],
				"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期一 第6节--第8节\n下院307(2-12周).陈峰 副教授\n下院307(2-12周).梁如冰 副研究员"
			}],
			"name": "微生物的世界"
		}, {
			"cid": "BI917",
			"kaikeList": [{
				"bsid": "372732",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院507",
				"startWeek": 1,
				"teacherList": ["殷明 教授", "赵文娟 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院507(1-16周).殷明 教授\n东上院507(1-16周).赵文娟 副研究员"
			}],
			"name": "脑与日常行为"
		}, {
			"cid": "BM902",
			"kaikeList": [{
				"bsid": "372733",
				"endWeek": 8,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "东下院502",
				"startWeek": 1,
				"teacherList": ["钱秀萍 副教授", "毛文伟 副教授", "徐蓉 讲师(高校)"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n东下院502(1-8周).钱秀萍 副教授\n东下院502(1-8周).毛文伟 副教授\n东下院502(1-8周).徐蓉 讲师(高校)\n星期四 第9节--第10节\n东下院502(1-8周).钱秀萍 副教授\n东下院502(1-8周).毛文伟 副教授\n东下院502(1-8周).徐蓉 讲师(高校)"
			}],
			"name": "药物发展——延续生命的奥秘"
		}, {
			"cid": "BM903",
			"kaikeList": [{
				"bsid": "372688",
				"endWeek": 11,
				"fmtTime": "四(6-8)",
				"room": "东上院302",
				"startWeek": 1,
				"teacherList": ["王莲芸 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n东上院302(1-11周).王莲芸 教授"
			}],
			"name": "大学生健康导论"
		}, {
			"cid": "CA901",
			"kaikeList": [{
				"bsid": "372604",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "中院106",
				"startWeek": 1,
				"teacherList": ["李梅 副研究员(高教管理)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院106(1-16周).李梅 副研究员(高教管理)"
			}, {
				"bsid": "372605",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院109",
				"startWeek": 1,
				"teacherList": ["陈虹锦 教授", "韩莉 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院109(1-16周).陈虹锦 教授\n中院109(1-16周).韩莉 副教授"
			}, {
				"bsid": "372606",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "中院109",
				"startWeek": 1,
				"teacherList": ["韩莉 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院109(1-16周).韩莉 副教授"
			}, {
				"bsid": "372607",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "中院108",
				"startWeek": 1,
				"teacherList": ["马荔 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院108(1-16周).马荔 副教授"
			}, {
				"bsid": "372608",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "中院106",
				"startWeek": 1,
				"teacherList": ["王新灵 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院106(1-16周).王新灵 教授"
			}],
			"name": "大学化学"
		}, {
			"cid": "CA902",
			"kaikeList": [{
				"bsid": "372612",
				"endWeek": 13,
				"fmtTime": "四(6-8)",
				"room": "中院109",
				"startWeek": 2,
				"teacherList": ["韩莉 副教授"],
				"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期四 第6节--第8节\n中院109(2-13周).韩莉 副教授"
			}, {
				"bsid": "372613",
				"endWeek": 13,
				"fmtTime": "五(6-8)",
				"room": "中院109",
				"startWeek": 2,
				"teacherList": ["韩莉 副教授"],
				"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期五 第6节--第8节\n中院109(2-13周).韩莉 副教授"
			}, {
				"bsid": "372614",
				"endWeek": 13,
				"fmtTime": "四(6-8)",
				"room": "中院109",
				"startWeek": 2,
				"teacherList": ["张卫 副教授"],
				"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期四 第6节--第8节\n中院109(2-13周).张卫 副教授"
			}, {
				"bsid": "372615",
				"endWeek": 13,
				"fmtTime": "五(6-8)",
				"room": "中院109",
				"startWeek": 2,
				"teacherList": ["张卫 副教授"],
				"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期五 第6节--第8节\n中院109(2-13周).张卫 副教授"
			}],
			"name": "在实验中探究化学"
		}, {
			"cid": "CA903",
			"kaikeList": [{
				"bsid": "372610",
				"endWeek": 13,
				"fmtTime": "四(6-8)",
				"room": ".",
				"startWeek": 2,
				"teacherList": ["谢少艾 高级工程师"],
				"time": "(2-13周)\n行课安排为第2周 --- 第13周,其中:\n星期四 第6节--第8节\n.(2-13周).谢少艾 高级工程师"
			}],
			"name": "化学问题的实验研究"
		}, {
			"cid": "CA904",
			"kaikeList": [{
				"bsid": "372609",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院4-202",
				"startWeek": 1,
				"teacherList": ["陈先阳 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-202(1-16周).陈先阳 副教授"
			}],
			"name": "公共危机中的化学"
		}, {
			"cid": "CS902",
			"kaikeList": [{
				"bsid": "372582",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院103",
				"startWeek": 1,
				"teacherList": ["陆朝俊 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院103(1-16周).陆朝俊 副教授"
			}, {
				"bsid": "372583",
				"endWeek": 16,
				"fmtTime": "四(6-8)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["陆朝俊 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院203(1-16周).陆朝俊 副教授"
			}, {
				"bsid": "372584",
				"endWeek": 16,
				"fmtTime": "五(6-8)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["黄林鹏 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东上院203(1-16周).黄林鹏 教授"
			}, {
				"bsid": "372585",
				"endWeek": 16,
				"fmtTime": "四(6-8)",
				"room": "东上院205",
				"startWeek": 1,
				"teacherList": ["张媛媛 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院205(1-16周).张媛媛 助理研究员"
			}],
			"name": "程序设计思想与方法"
		}, {
			"cid": "EI901",
			"kaikeList": [{
				"bsid": "372586",
				"endWeek": 13,
				"fmtTime": "二(6-8)",
				"room": "中院200",
				"startWeek": 3,
				"teacherList": ["张峰 教授", "殳国华 副教授", "乔树通 讲师(高校)"],
				"time": "(3-13周)\n行课安排为第3周 --- 第13周,其中:\n星期二 第6节--第8节\n中院200(3-13周).张峰 教授\n中院200(3-13周).殳国华 副教授\n中院200(3-13周).乔树通 讲师(高校)"
			}],
			"name": "工程实践与科技创新I"
		}, {
			"cid": "ES901",
			"kaikeList": [{
				"bsid": "372588",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院306",
				"startWeek": 1,
				"teacherList": ["杨杰 教授", "姚莉秀 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院306(1-16周).杨杰 教授\n东上院306(1-16周).姚莉秀 副教授"
			}],
			"name": "智能信息处理"
		}, {
			"cid": "IN901",
			"kaikeList": [{
				"bsid": "372713",
				"endWeek": 11,
				"fmtTime": "一(6-8)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["范秀凤 副研究馆员", "潘卫 研究馆员", "宋海艳 馆员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n.(1-11周).范秀凤 副研究馆员\n.(1-11周).潘卫 研究馆员\n.(1-11周).宋海艳 馆员"
			}, {
				"bsid": "372714",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["余晓蔚 副研究馆员", "汤莉华 副研究馆员", "付佳佳 副研究馆员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n.(1-11周).余晓蔚 副研究馆员\n.(1-11周).汤莉华 副研究馆员\n.(1-11周).付佳佳 副研究馆员"
			}],
			"name": "信息素养与实践"
		}, {
			"cid": "ME901",
			"kaikeList": [{
				"bsid": "372589",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张培艳 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).张培艳 副研究员"
			}],
			"name": "工程技术探究"
		}, {
			"cid": "ME903",
			"kaikeList": [{
				"bsid": "372620",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院312",
				"startWeek": 1,
				"teacherList": ["陈泳 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院312(1-16周).陈泳 副教授"
			}, {
				"bsid": "372621",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院303",
				"startWeek": 1,
				"teacherList": ["张执南 助理研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院303(1-11周).张执南 助理研究员"
			}, {
				"bsid": "372622",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-204",
				"startWeek": 1,
				"teacherList": ["王玉璋 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-204(1-16周).王玉璋 副教授"
			}, {
				"bsid": "372623",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院304",
				"startWeek": 1,
				"teacherList": ["戴旭东 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院304(1-11周).戴旭东 讲师(高校)"
			}, {
				"bsid": "372624",
				"endWeek": 15,
				"fmtTime": "二(6-8)",
				"room": "东上院308",
				"startWeek": 5,
				"teacherList": ["孟祥慧 副研究员"],
				"time": "(5-15周)\n行课安排为第5周 --- 第15周,其中:\n星期二 第6节--第8节\n东上院308(5-15周).孟祥慧 副研究员"
			}, {
				"bsid": "372627",
				"endWeek": 15,
				"fmtTime": "二(6-8)",
				"room": "东中院4-203",
				"startWeek": 5,
				"teacherList": ["费燕琼 副教授"],
				"time": "(5-15周)\n行课安排为第5周 --- 第15周,其中:\n星期二 第6节--第8节\n东中院4-203(5-15周).费燕琼 副教授"
			}],
			"name": "创新思维与现代设计"
		}, {
			"cid": "ME904",
			"kaikeList": [{
				"bsid": "372626",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "下院310",
				"startWeek": 1,
				"teacherList": ["杨培中 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院310(1-16周).杨培中 教授"
			}, {
				"bsid": "372628",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "下院106",
				"startWeek": 1,
				"teacherList": ["宋健 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院106(1-16周).宋健 讲师(高校)"
			}],
			"name": "形象思维与工程语言"
		}, {
			"cid": "ME905",
			"kaikeList": [{
				"bsid": "372580",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "下院302",
				"startWeek": 1,
				"teacherList": ["陈俐 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院302(1-16周).陈俐 副教授"
			}, {
				"bsid": "372581",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "下院303",
				"startWeek": 1,
				"teacherList": ["林志良 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院303(1-16周).林志良 副教授"
			}],
			"name": "力学仿生－启示与探索"
		}, {
			"cid": "MI901",
			"kaikeList": [{
				"bsid": "372587",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-102",
				"startWeek": 1,
				"teacherList": ["陶卫 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-102(1-16周).陶卫 副教授"
			}],
			"name": "信息与感知"
		}, {
			"cid": "MT903",
			"kaikeList": [{
				"bsid": "372558",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东上院305",
				"startWeek": 1,
				"teacherList": ["赵斌元", "胡晓斌", "刘庆雷", "宁月生"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院305(1-16周).赵斌元\n东上院305(1-16周).胡晓斌\n东上院305(1-16周).刘庆雷\n东上院305(1-16周).宁月生"
			}],
			"name": "材料美学"
		}, {
			"cid": "MT904",
			"kaikeList": [{
				"bsid": "373373",
				"endWeek": 16,
				"fmtTime": "五(7-8)",
				"room": "东上院307",
				"startWeek": 1,
				"teacherList": ["丁希凡 副教授", "金明江 讲师(高校)", "金学军 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第7节--第8节\n东上院307(1-16周).丁希凡 副教授\n东上院307(1-16周).金明江 讲师(高校)\n东上院307(1-16周).金学军 教授"
			}],
			"name": "科学与艺术-材料科学与设计艺术"
		}, {
			"cid": "MT906",
			"kaikeList": [{
				"bsid": "372630",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "上院307",
				"startWeek": 1,
				"teacherList": ["程先华 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n上院307(1-16周).程先华 教授"
			}],
			"name": "走进纳米科学"
		}, {
			"cid": "NT901",
			"kaikeList": [{
				"bsid": "372629",
				"endWeek": 12,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "东中院1-203",
				"startWeek": 5,
				"teacherList": ["雷敏 副教授"],
				"time": "(5-12周)\n行课安排为第5周 --- 第12周,其中:\n星期一 第9节--第10节\n东中院1-203(5-12周).雷敏 副教授\n星期四 第9节--第10节\n东中院1-203(5-12周).雷敏 副教授"
			}],
			"name": "自然界中的混沌与分岔"
		}, {
			"cid": "NU920",
			"kaikeList": [{
				"bsid": "372625",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院4-205",
				"startWeek": 1,
				"teacherList": ["王德忠 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-205(1-16周).王德忠 教授"
			}],
			"name": "辐射及应用"
		}, {
			"cid": "OC901",
			"kaikeList": [{
				"bsid": "372576",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院102",
				"startWeek": 1,
				"teacherList": ["曾一非 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院102(1-11周).曾一非 副教授"
			}, {
				"bsid": "372577",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院101",
				"startWeek": 1,
				"teacherList": ["徐航 副研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院101(1-11周).徐航 副研究员"
			}, {
				"bsid": "372578",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院103",
				"startWeek": 1,
				"teacherList": ["徐雪松 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院103(1-11周).徐雪松 讲师(高校)"
			}],
			"name": "海洋学导论"
		}, {
			"cid": "OC902",
			"kaikeList": [{
				"bsid": "372575",
				"endWeek": 10,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "下院304",
				"startWeek": 3,
				"teacherList": ["胡志强 副教授"],
				"time": "(3-10周)\n行课安排为第3周 --- 第10周,其中:\n星期一 第9节--第10节\n下院304(3-10周).胡志强 副教授\n星期四 第9节--第10节\n下院304(3-10周).胡志强 副教授"
			}],
			"name": "海洋可再生能源"
		}, {
			"cid": "PH902",
			"kaikeList": [{
				"bsid": "372729",
				"endWeek": 16,
				"fmtTime": "二(7-8)",
				"room": "下院413",
				"startWeek": 1,
				"teacherList": ["徐海光 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n下院413(1-16周).徐海光 教授"
			}, {
				"bsid": "372730",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "下院313",
				"startWeek": 1,
				"teacherList": ["徐海光 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院313(1-16周).徐海光 教授"
			}],
			"name": "宇宙与人类"
		}, {
			"cid": "PH903",
			"kaikeList": [{
				"bsid": "372727",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院1-102",
				"startWeek": 1,
				"teacherList": ["顾卫华 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-102(1-16周).顾卫华 讲师(高校)"
			}],
			"name": "量子波澜：历史与概念"
		}, {
			"cid": "PH905",
			"kaikeList": [{
				"bsid": "372739",
				"endWeek": 12,
				"fmtTime": "二(11-13)",
				"room": ".",
				"startWeek": 2,
				"teacherList": ["周红 副教授"],
				"time": "(2-12周)\n行课安排为第2周 --- 第12周,其中:\n星期二 第11节--第13节\n.(2-12周).周红 副教授"
			}],
			"name": "从物理实验看世界"
		}, {
			"cid": "PH906",
			"kaikeList": [{
				"bsid": "372728",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10),二(9-10)",
				"room": "下院208",
				"startWeek": 1,
				"teacherList": ["卢文发 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n单周\n星期二 第9节--第10节\n下院208(1-16周).卢文发 教授\n星期四 第9节--第10节\n下院208(1-16周).卢文发 教授\n双周\n星期二 第9节--第10节\n下院208(1-16周).卢文发 教授"
			}],
			"name": "量子力学"
		}, {
			"cid": "PO901",
			"kaikeList": [{
				"bsid": "373952",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院110",
				"startWeek": 1,
				"teacherList": ["黄震 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院110(1-11周).黄震 教授"
			}],
			"name": "低碳能源"
		}, {
			"cid": "PO903",
			"kaikeList": [{
				"bsid": "372611",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-203",
				"startWeek": 1,
				"teacherList": ["房建华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-203(1-16周).房建华 副教授"
			}],
			"name": "清洁能源技术：原理与应用"
		}, {
			"cid": "SO922",
			"kaikeList": [{
				"bsid": "372617",
				"endWeek": 16,
				"fmtTime": "五(6-8)",
				"room": "东下院106",
				"startWeek": 1,
				"teacherList": ["邵嘉慧 教授", "张小凡 副教授", "孙承兴 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东下院106(1-16周).邵嘉慧 教授\n东下院106(1-16周).张小凡 副教授\n东下院106(1-16周).孙承兴 讲师(高校)"
			}, {
				"bsid": "372618",
				"endWeek": 16,
				"fmtTime": "五(6-8)",
				"room": "东下院104",
				"startWeek": 1,
				"teacherList": ["周伟丽 副研究员", "袁涛 副教授", "孙承兴 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东下院104(1-16周).周伟丽 副研究员\n东下院104(1-16周).袁涛 副教授\n东下院104(1-16周).no 孙承兴 讲师(高校)"
			}, {
				"bsid": "372619",
				"endWeek": 16,
				"fmtTime": "五(6-8)",
				"room": "东下院105",
				"startWeek": 1,
				"teacherList": ["孙承兴 讲师(高校)", "袁涛 副教授", "周伟丽 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东下院105(1-16周).no 孙承兴 讲师(高校)\n东下院105(1-16周).no 袁涛 副教授\n东下院105(1-16周).no 周伟丽 副研究员"
			}],
			"name": "人与环境"
		}, {
			"cid": "SY901",
			"kaikeList": [{
				"bsid": "372647",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "中院108",
				"startWeek": 1,
				"teacherList": ["黄丹 副研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院108(1-11周).黄丹 副研究员"
			}],
			"name": "系统思考与科学决策"
		}],
		"name": "自然科学与工程技术",
		"xyid": "3"
	}, {
		"courseList": [{
			"cid": "LO901",
			"kaikeList": [{
				"bsid": "373355",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院402",
				"startWeek": 1,
				"teacherList": ["黄伟力 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院402(1-16周).黄伟力 教授"
			}],
			"name": "推理与思维训练"
		}, {
			"cid": "MA902",
			"kaikeList": [{
				"bsid": "372712",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院501",
				"startWeek": 1,
				"teacherList": ["孙祝岭 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院501(1-16周).孙祝岭 副教授"
			}],
			"name": "统计原理"
		}, {
			"cid": "MA905",
			"kaikeList": [{
				"bsid": "372711",
				"endWeek": 16,
				"fmtTime": "五(6-8)",
				"room": "东上院105",
				"startWeek": 1,
				"teacherList": ["肖柳青 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第6节--第8节\n东上院105(1-16周).肖柳青 副教授"
			}],
			"name": "随机模拟方法与应用"
		}, {
			"cid": "MA906",
			"kaikeList": [{
				"bsid": "372710",
				"endWeek": 16,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "下院310",
				"startWeek": 9,
				"teacherList": ["沈灏 教授", "沈灏 教授"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n下院310(9-16周).沈灏 教授\n星期四 第9节--第10节\n下院310(9-16周).沈灏 ���授"
			}],
			"name": "数学与科技进步"
		}, {
			"cid": "MA908",
			"kaikeList": [{
				"bsid": "372708",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "上院411",
				"startWeek": 1,
				"teacherList": ["张跃辉 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n上院411(1-16周).张跃辉 副教授"
			}],
			"name": "数学的天空"
		}, {
			"cid": "MA911",
			"kaikeList": [{
				"bsid": "372709",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院404",
				"startWeek": 1,
				"teacherList": ["周钢 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院404(1-16周).周钢 副教授"
			}],
			"name": "数学史"
		}],
		"name": "数学或逻辑学",
		"xyid": "4"
	}, {
		"courseList": [{
			"cid": "AV012",
			"kaikeList": [{
				"bsid": "372773",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院3-103",
				"startWeek": 1,
				"teacherList": ["张卫刚 教授", "蔡晓静 助理工程师", "杨凤鹏 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-103(1-16周).张卫刚 教授\n东中院3-103(1-16周).蔡晓静 助理工程师\n东中院3-103(1-16周).杨凤鹏 副研究员"
			}, {
				"bsid": "372774",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院4-102",
				"startWeek": 1,
				"teacherList": ["余征跃 高级工程师", "陈玉坤 高级工程师", "杨英强 工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-102(1-16周).余征跃 高级工程师\n东中院4-102(1-16周).陈玉坤 高级工程师\n东中院4-102(1-16周).杨英强 工程师"
			}],
			"name": "力学改变生活"
		}, {
			"cid": "EM024",
			"kaikeList": [{
				"bsid": "372772",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["孙峰 高级工程师"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n.(1-11周).孙峰 高级工程师"
			}],
			"name": "材料力学实验探究"
		}, {
			"cid": "ME069",
			"kaikeList": [{
				"bsid": "372776",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院303",
				"startWeek": 9,
				"teacherList": ["胡文蓉 副教授"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院303(9-16周).胡文蓉 副教授"
			}],
			"name": "偷师大自然－－动物仿生学"
		}, {
			"cid": "NA002",
			"kaikeList": [{
				"bsid": "372775",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院309",
				"startWeek": 1,
				"teacherList": ["汪淳 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院309(1-16周).汪淳 副教授"
			}],
			"name": "潜水器设计"
		}],
		"name": "船舶海洋与建筑工程学院",
		"xyid": "01000"
	}, {
		"courseList": [{
			"cid": "AU004",
			"kaikeList": [{
				"bsid": "372815",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院1-204",
				"startWeek": 1,
				"teacherList": ["马春翔 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-204(1-16周).马春翔 副教授"
			}],
			"name": "灰色系统理论及应用"
		}, {
			"cid": "AV001",
			"kaikeList": [{
				"bsid": "372811",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院1-301",
				"startWeek": 1,
				"teacherList": ["康小明 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-301(1-16周).康小明 副教授"
			}],
			"name": "航空航天概论"
		}, {
			"cid": "AV013",
			"kaikeList": [{
				"bsid": "372828",
				"endWeek": 12,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "东上院501",
				"startWeek": 1,
				"teacherList": ["陈勇 讲师(高校)"],
				"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期一 第9节--第10节\n东上院501(1-12周).陈勇 讲师(高校)\n星期四 第9节--第10节\n东上院501(1-12周).陈勇 讲师(高校)"
			}],
			"name": "现代航空发动机技术"
		}, {
			"cid": "AV016",
			"kaikeList": [{
				"bsid": "373426",
				"endWeek": 12,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "东中院4-502",
				"startWeek": 1,
				"teacherList": ["杨波 副教授"],
				"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期一 第9节--第10节\n东中院4-502(1-12周).杨波 副教授\n星期四 第9节--第10节\n东中院4-502(1-12周).杨波 副教授"
			}],
			"name": "空气动力学与翼型基础理论及应用"
		}, {
			"cid": "BE403",
			"kaikeList": [{
				"bsid": "372816",
				"endWeek": 8,
				"fmtTime": "四(7-10)",
				"room": "下院103",
				"startWeek": 1,
				"teacherList": ["姚晔 副教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第7节--第10节\n下院103(1-8周).姚晔 副教授"
			}],
			"name": "空气污染控制与洁净技术"
		}, {
			"cid": "CS013",
			"kaikeList": [{
				"bsid": "372807",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-302",
				"startWeek": 1,
				"teacherList": ["郑宇 工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-302(1-16周).郑宇 工程师"
			}],
			"name": "VB编程技术"
		}, {
			"cid": "EM025",
			"kaikeList": [{
				"bsid": "373495",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院201",
				"startWeek": 1,
				"teacherList": ["黄煜 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院201(1-11周).黄煜 讲师(高校)"
			}],
			"name": "人体振动学"
		}, {
			"cid": "EV009",
			"kaikeList": [{
				"bsid": "372813",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东上院104",
				"startWeek": 1,
				"teacherList": ["江治 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院104(1-16周).江治 副教授"
			}],
			"name": "环境工程导论（A类）"
		}, {
			"cid": "EV039",
			"kaikeList": [{
				"bsid": "372814",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院1-302",
				"startWeek": 1,
				"teacherList": ["黄修长 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-302(1-16周).黄修长 副研究员"
			}],
			"name": "环境工程概论"
		}, {
			"cid": "IO005",
			"kaikeList": [{
				"bsid": "372825",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院1-202",
				"startWeek": 1,
				"teacherList": ["齐臣坤 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-202(1-16周).齐臣坤 助理研究员"
			}],
			"name": "系统建模方法与应用"
		}, {
			"cid": "MA500",
			"kaikeList": [{
				"bsid": "372817",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东中院1-204",
				"startWeek": 1,
				"teacherList": ["马春翔 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院1-204(1-16周).马春翔 副教授"
			}],
			"name": "模糊数学及其应用"
		}, {
			"cid": "ME041",
			"kaikeList": [{
				"bsid": "372823",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院303",
				"startWeek": 1,
				"teacherList": ["张定国 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院303(1-16周).张定国 副教授"
			}],
			"name": "生物与机器人学"
		}, {
			"cid": "ME054",
			"kaikeList": [{
				"bsid": "372809",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院1-303",
				"startWeek": 1,
				"teacherList": ["张希 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-303(1-16周).张希 副研究员"
			}],
			"name": "电动汽车技术革命"
		}, {
			"cid": "ME076",
			"kaikeList": [{
				"bsid": "372830",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院506",
				"startWeek": 1,
				"teacherList": ["张建龙 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院506(1-16周).张建龙 助理研究员"
			}],
			"name": "新能源汽车概论"
		}, {
			"cid": "ME078",
			"kaikeList": [{
				"bsid": "372808",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-202",
				"startWeek": 1,
				"teacherList": ["齐臣坤 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-202(1-16周).齐臣坤 助理研究员"
			}],
			"name": "步行机器人"
		}, {
			"cid": "ME079",
			"kaikeList": [{
				"bsid": "372831",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "东中院4-304",
				"startWeek": 9,
				"teacherList": ["管西强 讲师(高校)"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-304(9-16周).管西强 讲师(高校)\n星期四 第9节--第10节\n东中院4-304(9-16周).管西强 讲师(高校)"
			}],
			"name": "宇宙探索:透视月球和火星探测车"
		}, {
			"cid": "ME087",
			"kaikeList": [{
				"bsid": "373389",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-102",
				"startWeek": 1,
				"teacherList": ["陶建峰 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-102(1-16周).陶建峰 副教授"
			}],
			"name": "电液伺服控制理论与实践"
		}, {
			"cid": "ME088",
			"kaikeList": [{
				"bsid": "373428",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院403",
				"startWeek": 1,
				"teacherList": ["朱磊 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院403(1-16周).朱磊 讲师(高校)"
			}],
			"name": "现代汽车技术赏析"
		}, {
			"cid": "ME323",
			"kaikeList": [{
				"bsid": "372993",
				"endWeek": 12,
				"fmtTime": "六(1-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["郭为忠 教授"],
				"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期六 第1节--第4节\n.(1-12周).郭为忠 教授"
			}],
			"name": "机电一体化课程设计"
		}, {
			"cid": "ME345",
			"kaikeList": [{
				"bsid": "372965",
				"endWeek": 12,
				"fmtTime": "二(7-10)",
				"room": "中院104",
				"startWeek": 1,
				"teacherList": ["赵亦希 副教授", "李淑慧 教授"],
				"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期二 第7节--第10节\n中院104(1-12周).赵亦希 副教授\n中院104(1-12周).李淑慧 教授"
			}],
			"name": "工程材料"
		}, {
			"cid": "ME351",
			"kaikeList": [{
				"bsid": "372810",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "下院409",
				"startWeek": 1,
				"teacherList": ["张晓云 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院409(1-16周).张晓云 副教授"
			}],
			"name": "工程应用软件(1) (CAD-UG)"
		}, {
			"cid": "ME372",
			"kaikeList": [{
				"bsid": "372978",
				"endWeek": 12,
				"fmtTime": "六(1-2)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["王倩 助理研究员"],
				"time": "(1-12周)\n行课安排为第1周 --- 第12周,其中:\n星期六 第1节--第2节\n.(1-12周).王倩 助理研究员"
			}],
			"name": "机械与动力综合实验I-B"
		}, {
			"cid": "MT016",
			"kaikeList": [{
				"bsid": "372826",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院203",
				"startWeek": 1,
				"teacherList": ["蒋峰景 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院203(1-16周).蒋峰景 副研究员"
			}],
			"name": "先进材料与新能源技术"
		}, {
			"cid": "NU004",
			"kaikeList": [{
				"bsid": "372812",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院1-103",
				"startWeek": 1,
				"teacherList": ["俎建华 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-103(1-16周).俎建华 副研究员"
			}],
			"name": "核化学及核技术应用"
		}, {
			"cid": "NU006",
			"kaikeList": [{
				"bsid": "373425",
				"endWeek": 16,
				"fmtTime": "二(9-10),五(9-10)",
				"room": "东中院1-203",
				"startWeek": 9,
				"teacherList": ["刘瑞芹 讲师(高校)"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-203(9-16周).刘瑞芹 讲师(高校)\n星期五 第9节--第10节\n东中院1-203(9-16周).刘瑞芹 讲师(高校)"
			}],
			"name": "核辐射防护基础"
		}, {
			"cid": "NU008",
			"kaikeList": [{
				"bsid": "373429",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "下院404",
				"startWeek": 1,
				"teacherList": ["饶德林 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n下院404(1-16周).饶德林 讲师(高校)"
			}],
			"name": "辐射与核能发展史"
		}, {
			"cid": "NU403",
			"kaikeList": [{
				"bsid": "372827",
				"endWeek": 16,
				"room": "东上院506",
				"startWeek": 1,
				"teacherList": ["熊珍琴 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期�� 第9节--第10节\n东上院506(1-16周).熊珍琴 助理研究员"
			}],
			"name": "先进核能系统"
		}, {
			"cid": "PO010",
			"kaikeList": [{
				"bsid": "372819",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院204",
				"startWeek": 1,
				"teacherList": ["江治 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院204(1-16周).江治 副教授"
			}],
			"name": "能源与环境系统工程导论"
		}, {
			"cid": "PO012",
			"kaikeList": [{
				"bsid": "372829",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "下院403",
				"startWeek": 1,
				"teacherList": ["于立军 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n下院403(1-16周).于立军 教授"
			}],
			"name": "新能源发电技术"
		}, {
			"cid": "PO018",
			"kaikeList": [{
				"bsid": "372824",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院305",
				"startWeek": 1,
				"teacherList": ["李廷贤 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院305(1-16周).李廷贤 副教授"
			}],
			"name": "太阳能集热、储热及热利用技术"
		}, {
			"cid": "PO026",
			"kaikeList": [{
				"bsid": "372818",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院4-305",
				"startWeek": 1,
				"teacherList": ["余晴春 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院4-305(1-16周).余晴春 副教授"
			}],
			"name": "能量储存技术"
		}, {
			"cid": "PO027",
			"kaikeList": [{
				"bsid": "372822",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院1-104",
				"startWeek": 1,
				"teacherList": ["胡鸣若 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-104(1-16周).胡鸣若 副教授"
			}],
			"name": "燃料电池发电机"
		}, {
			"cid": "PO029",
			"kaikeList": [{
				"bsid": "373427",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-301",
				"startWeek": 1,
				"teacherList": ["刘训臣", "周忠岳 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-301(1-16周).刘训臣\n东中院1-301(1-16周).周忠岳 讲师(高校)"
			}],
			"name": "燃烧诊断技术概论"
		}, {
			"cid": "PO202",
			"kaikeList": [{
				"bsid": "372820",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院1-304",
				"startWeek": 1,
				"teacherList": ["李新令 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-304(1-16周).李新令 助理研究员"
			}, {
				"bsid": "372821",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "东上院505",
				"startWeek": 1,
				"teacherList": ["乔信起 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东上院505(1-11周).乔信起 教授"
			}],
			"name": "能源与可持续发展"
		}, {
			"cid": "SO091",
			"kaikeList": [{
				"bsid": "373430",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-404",
				"startWeek": 1,
				"teacherList": ["胡小军 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-404(1-16周).胡小军 讲师(高校)"
			}],
			"name": "互联网+社会物理学"
		}],
		"name": "机械与动力工程学院",
		"xyid": "02000"
	}, {
		"courseList": [{
			"cid": "CS050",
			"kaikeList": [{
				"bsid": "373382",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "中院102",
				"startWeek": 1,
				"teacherList": ["董笑菊 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院102(1-16周).董笑菊 副教授"
			}],
			"name": "数据可视化和可视分析"
		}, {
			"cid": "CS079",
			"kaikeList": [{
				"bsid": "372785",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院103",
				"startWeek": 1,
				"teacherList": ["刁训娣 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院103(1-16周).刁训娣 助理研究员"
			}],
			"name": "金融建模及其R软件实例分析"
		}, {
			"cid": "EI017",
			"kaikeList": [{
				"bsid": "372782",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "下院407",
				"startWeek": 1,
				"teacherList": ["谢宝昌 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院407(1-16周).谢宝昌 副教授"
			}],
			"name": "机电能量转换与思维方式"
		}, {
			"cid": "EI228",
			"kaikeList": [{
				"bsid": "372778",
				"endWeek": 16,
				"fmtTime": "日(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张士文 讲师(高校)", "殳国华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第9节--第10节\n.(1-16周).张士文 讲师(高校)\n.(1-16周).殳国华 副教授"
			}],
			"name": "工程实践与科技创新Ⅱ-B"
		}, {
			"cid": "EI312",
			"kaikeList": [{
				"bsid": "372779",
				"endWeek": 16,
				"fmtTime": "日(7-8)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张士文 讲师(高校)", "殳国华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第7节--第8节\n.(1-16周).张士文 讲师(高校)\n.(1-16周).殳国华 副教授"
			}],
			"name": "工程实践与科技创新Ⅲ-C"
		}, {
			"cid": "EI401",
			"kaikeList": [{
				"bsid": "372780",
				"endWeek": 16,
				"fmtTime": "日(1-2)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张士文 讲师(高校)", "殳国华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第1节--第2节\n.(1-16周).张士文 讲师(高校)\n.(1-16周).殳国华 副教授"
			}],
			"name": "工程实践与科技创新Ⅳ-C"
		}, {
			"cid": "ES004",
			"kaikeList": [{
				"bsid": "372783",
				"endWeek": 16,
				"fmtTime": "日(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张士文 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期日 第3节--第4节\n.(1-16周).张士文 讲师(高校)"
			}],
			"name": "基于安卓开发平台的电子系统综合设计"
		}, {
			"cid": "MI001",
			"kaikeList": [{
				"bsid": "373384",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-305",
				"startWeek": 1,
				"teacherList": ["戴旭涵 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-305(1-16周).戴旭涵 副教授"
			}],
			"name": "消费类电子产品传感器及其应用"
		}, {
			"cid": "PH063",
			"kaikeList": [{
				"bsid": "372781",
				"endWeek": 10,
				"fmtTime": "二(9-10)",
				"room": "东上院505",
				"startWeek": 2,
				"teacherList": ["叶志成 副研究员"],
				"time": "(2-10周)\n行课安排为第2周 --- 第10周,其中:\n星期二 第9节--第10节\n东上院505(2-10周).叶志成 副研究员"
			}],
			"name": "光的科学与生活"
		}, {
			"cid": "PO013",
			"kaikeList": [{
				"bsid": "373953",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院409",
				"startWeek": 1,
				"teacherList": ["殳国华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院409(1-16周).殳国华 副教授"
			}],
			"name": "新能源技术及应用"
		}, {
			"cid": "SE112",
			"kaikeList": [{
				"bsid": "371618",
				"endWeek": 24,
				"fmtTime": "六(3-3)",
				"room": ".",
				"startWeek": 23,
				"teacherList": ["任锐 工程师"],
				"time": "(23-24周)\n行课安排为第23周 --- 第24周,其中:\n星期六 第3节--第3节\n.(23-24周).任锐 工程师"
			}],
			"name": "软件工程职业素养"
		}, {
			"cid": "SE117",
			"kaikeList": [{
				"bsid": "372875",
				"endWeek": 16,
				"fmtTime": "二(1-2),五(3-4)",
				"room": "中院100",
				"startWeek": 1,
				"teacherList": ["戚正伟", "李健"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第1节--第2节\n中院100(1-16周).戚正伟\n中院100(1-16周).李健\n星期五 第3节--第4节\n中院100(1-16周).戚正伟\n中院100(1-16周).李健"
			}],
			"name": "程序设计与数据结构"
		}, {
			"cid": "WA003",
			"kaikeList": [{
				"bsid": "373383",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院2-303",
				"startWeek": 1,
				"teacherList": ["熊刚 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院2-303(1-16周).熊刚 副研究员"
			}],
			"name": "现代电子战导论"
		}],
		"name": "电子信息与电气工程学院",
		"xyid": "03000"
	}, {
		"courseList": [{
			"cid": "SE102",
			"kaikeList": [{
				"bsid": "371768",
				"endWeek": 24,
				"fmtTime": "六(1-2)",
				"room": ".",
				"startWeek": 23,
				"teacherList": ["戚正伟 教授"],
				"time": "(23-24周)\n行课安排为第23周 --- 第24周,其中:\n星期六 第1节--第2节\n.(23-24周).戚正伟 教授"
			}],
			"name": "程序设计课程设计"
		}],
		"name": "软件学院",
		"xyid": "03700"
	}, {
		"courseList": [{
			"cid": "MT017",
			"kaikeList": [{
				"bsid": "372770",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院422",
				"startWeek": 1,
				"teacherList": ["万见峰 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院422(1-16周).万见峰 副教授"
			}],
			"name": "绿色材料与绿色能源"
		}, {
			"cid": "MT019",
			"kaikeList": [{
				"bsid": "372771",
				"endWeek": 8,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "上院112",
				"startWeek": 1,
				"teacherList": ["张小农 副教授", "赵常利 助理研究员", "倪嘉桦 科学研究人员"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n上院112(1-8周).张小农 副教授\n上院112(1-8周).赵常利 助理研究员\n上院112(1-8周).倪嘉桦 科学研究人员\n星期四 第9节--第10节\n上院112(1-8周).张小农 副教授\n上院112(1-8周).赵常利 助理研究员\n上院112(1-8周).倪嘉桦 科学研究人员"
			}],
			"name": "生物医用金属材料"
		}],
		"name": "材料科学与工程学院",
		"xyid": "05000"
	}, {
		"courseList": [{
			"cid": "MA016",
			"kaikeList": [{
				"bsid": "372930",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院106",
				"startWeek": 1,
				"teacherList": ["乐经良 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院106(1-16周).乐经良 教授"
			}],
			"name": "数学实验"
		}, {
			"cid": "MA043",
			"kaikeList": [{
				"bsid": "371935",
				"endWeek": 16,
				"fmtTime": "一(3-4),三(1-2),五(1-2)",
				"room": "中院100",
				"startWeek": 1,
				"teacherList": ["裘兆泰 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n中院100(1-16周).裘兆泰 副教授\n星期三 第1节--第2节\n中院100(1-16周).裘兆泰 副教授\n星期五 第1节--第2节\n中院100(1-16周).裘兆泰 副教授"
			}, {
				"bsid": "372346",
				"endWeek": 16,
				"fmtTime": "一(3-4),三(1-2),五(1-2)",
				"room": "上院100",
				"startWeek": 1,
				"teacherList": ["邵国年"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n上院100(1-16周).邵国年\n星期三 第1节--第2节\n上院100(1-16周).邵国年\n星期五 第1节--第2节\n上院100(1-16周).邵国年"
			}, {
				"bsid": "372347",
				"endWeek": 16,
				"fmtTime": "一(3-4),三(1-2),五(1-2)",
				"room": "上院101",
				"startWeek": 1,
				"teacherList": ["陈春丽"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n上院101(1-16周).陈春丽\n星期三 第1节--第2节\n上院101(1-16周).陈春丽\n星期五 第1节--第2节\n上院101(1-16周).陈春丽"
			}],
			"name": "数学分析（C类）（2）"
		}, {
			"cid": "MA081",
			"kaikeList": [{
				"bsid": "372366",
				"endWeek": 16,
				"fmtTime": "一(3-4),三(1-2)",
				"room": "中院200",
				"startWeek": 1,
				"teacherList": ["咸进国"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n中院200(1-16周).咸进国\n星期三 第1节--第2节\n中院200(1-16周).咸进国"
			}, {
				"bsid": "373046",
				"endWeek": 16,
				"fmtTime": "二(11-12),四(11-12)",
				"room": "下院107",
				"startWeek": 1,
				"teacherList": ["向光辉 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n下院107(1-16周).向光辉 副教授\n星期四 第11节--第12节\n下院107(1-16周).向光辉 副教授"
			}],
			"name": "高等数学（A）（2）"
		}, {
			"cid": "MA119",
			"kaikeList": [{
				"bsid": "372378",
				"endWeek": 16,
				"fmtTime": "一(9-10),二(7-8),四(7-8)",
				"room": "上院109",
				"startWeek": 9,
				"teacherList": ["武爱文"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院109(9-16周).武爱文\n星期二 第7节--第8节\n上院109(9-16周).武爱文\n星期四 第7节--第8节\n上院109(9-16周).武爱文"
			}, {
				"bsid": "372379",
				"endWeek": 16,
				"fmtTime": "一(9-10),二(7-8),四(7-8)",
				"room": "上院110",
				"startWeek": 9,
				"teacherList": ["熊德文"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院110(9-16周).熊德文\n星期二 第7节--第8节\n上院110(9-16周).熊德文\n星期四 第7节--第8节\n上院110(9-16周).熊德文"
			}, {
				"bsid": "372380",
				"endWeek": 16,
				"fmtTime": "一(9-10),二(7-8),四(7-8)",
				"room": "上院103",
				"startWeek": 9,
				"teacherList": ["皮玲"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院103(9-16周).皮玲\n星期二 第7节--第8节\n上院103(9-16周).皮玲\n星期四 第7节--第8节\n上院103(9-16周).皮玲"
			}],
			"name": "概率统计"
		}],
		"name": "数学系",
		"xyid": "07100"
	}, {
		"courseList": [{
			"cid": "PH001",
			"kaikeList": [{
				"bsid": "372327",
				"endWeek": 16,
				"fmtTime": "二(3-4),四(1-2)",
				"room": "上院109",
				"startWeek": 1,
				"teacherList": ["李铜忠"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院109(1-16周).李铜忠\n星期四 第1节--第2节\n上院109(1-16周).李铜忠"
			}, {
				"bsid": "372328",
				"endWeek": 16,
				"fmtTime": "二(3-4),四(1-2)",
				"room": "上院110",
				"startWeek": 1,
				"teacherList": ["李翠莲"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院110(1-16周).李翠莲\n星期四 第1节--第2节\n上院110(1-16周).李翠莲"
			}, {
				"bsid": "372329",
				"endWeek": 16,
				"fmtTime": "二(3-4),四(1-2)",
				"room": "上院103",
				"startWeek": 1,
				"teacherList": ["王先智"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院103(1-16周).王先智\n星期四 第1节--第2节\n上院103(1-16周).王先智"
			}, {
				"bsid": "372330",
				"endWeek": 16,
				"fmtTime": "二(3-4),四(1-2)",
				"room": "上院101",
				"startWeek": 1,
				"teacherList": ["顾志霞"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院101(1-16周).顾志霞\n星期四 第1节--第2节\n上院101(1-16周).顾志霞"
			}, {
				"bsid": "372331",
				"endWeek": 16,
				"fmtTime": "二(3-4),四(1-2)",
				"room": "上院203",
				"startWeek": 1,
				"teacherList": ["卢文发"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第3节--第4节\n上院203(1-16周).卢文发\n星期四 第1节--第2节\n上院203(1-16周).卢文发"
			}, {
				"bsid": "373222",
				"endWeek": 16,
				"fmtTime": "一(11-12),三(11-12)",
				"room": "下院107",
				"startWeek": 1,
				"teacherList": ["彭建平 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n下院107(1-16周).彭建平 教授\n星期三 第11节--第12节\n下院107(1-16周).彭建平 教授"
			}],
			"name": "大学物理（A类）（1）"
		}, {
			"cid": "PH028",
			"kaikeList": [{
				"bsid": "372340",
				"endWeek": 9,
				"fmtTime": "五(7-9)",
				"room": ".",
				"startWeek": 3,
				"teacherList": ["周红 副教授"],
				"time": "(3-9周)\n行课安排为第3周 --- 第9周,其中:\n星期五 第7节--第9节\n.(3-9周).周红 副教授"
			}, {
				"bsid": "372341",
				"endWeek": 16,
				"fmtTime": "五(7-9)",
				"room": ".",
				"startWeek": 10,
				"teacherList": ["周红 副教授"],
				"time": "(10-16周)\n行课安排为第10周 --- 第16周,其中:\n星期五 第7节--第9节\n.(10-16周).周红 副教授"
			}],
			"name": "大学物理实验（1）"
		}, {
			"cid": "PH030",
			"kaikeList": [{
				"bsid": "372944",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "下院109",
				"startWeek": 1,
				"teacherList": ["丁国辉 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n下院109(1-16周).丁国辉 副教授"
			}],
			"name": "主宰世界的七个方程"
		}, {
			"cid": "PH041",
			"kaikeList": [{
				"bsid": "372942",
				"endWeek": 16,
				"fmtTime": "四(6-8)",
				"room": "东中院4-303",
				"startWeek": 1,
				"teacherList": ["张鹏杰 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东中院4-303(1-16周).张鹏杰 教授"
			}],
			"name": "广义相对论"
		}, {
			"cid": "PH048",
			"kaikeList": [{
				"bsid": "372943",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院1-102",
				"startWeek": 1,
				"teacherList": ["顾卫华 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院1-102(1-16周).顾卫华 讲师(高校)"
			}],
			"name": "基本数值计算方法"
		}, {
			"cid": "PH060",
			"kaikeList": [{
				"bsid": "372025",
				"endWeek": 16,
				"fmtTime": "一(1-2),三(3-4)",
				"room": "中院407",
				"startWeek": 1,
				"teacherList": ["胡其图 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n中院407(1-16周).胡其图 教授\n星期三 第3节--第4节\n中院407(1-16周).胡其图 教授"
			}, {
				"bsid": "374151",
				"endWeek": 16,
				"fmtTime": "一(3-4),三(1-2)",
				"room": "中院407",
				"startWeek": 1,
				"teacherList": ["胡其图 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第3节--第4节\n中院407(1-16周).胡其图 教授\n星期三 第1节--第2节\n中院407(1-16周).胡其图 教授"
			}],
			"name": "大学物理（荣誉）（1）"
		}, {
			"cid": "PH064",
			"kaikeList": [{
				"bsid": "373494",
				"endWeek": 2,
				"fmtTime": "二(3-4),三(3-4),四(3-4),五(3-4)",
				"room": "东上院307",
				"startWeek": 1,
				"teacherList": ["季向东 教授"],
				"time": "(1-2周)\n行课安排为第1周 --- 第2周,其中:\n星期二 第3节--第4节\n东上院307(1-2周).季向东 教授\n星期三 第3节--第4节\n东上院307(1-2周).季向东 教授\n星期四 第3节--第4节\n东上院307(1-2周).季向东 教授\n星期五 第3节--第4节\n东上院307(1-2周).季向东 教授"
			}],
			"name": "基本粒子探测"
		}, {
			"cid": "PH409",
			"kaikeList": [{
				"bsid": "372941",
				"endWeek": 8,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "东中院4-304",
				"startWeek": 1,
				"teacherList": ["邓晓旭 教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n东中院4-304(1-8周).邓晓旭 教授\n星期四 第9节--第10节\n东中院4-304(1-8周).邓晓旭 教授"
			}],
			"name": "导波光学"
		}],
		"name": "物理与天文系",
		"xyid": "07200"
	}, {
		"courseList": [{
			"cid": "BI056",
			"kaikeList": [{
				"bsid": "372926",
				"endWeek": 8,
				"fmtTime": "二(9-10)",
				"room": "东下院205",
				"startWeek": 1,
				"teacherList": ["李胜天 副教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n东下院205(1-8周).李胜天 副教授"
			}],
			"name": "从脑到行为"
		}, {
			"cid": "BI092",
			"kaikeList": [{
				"bsid": "372928",
				"endWeek": 10,
				"fmtTime": "二(7-10)",
				"room": ".",
				"startWeek": 3,
				"teacherList": ["蒋群 副教授", "何丽明 实验师"],
				"time": "(3-10周)\n行课安排为第3周 --- 第10周,其中:\n星期二 第7节--第10节\n.(3-10周).蒋群 副教授\n.(3-10周).何丽明 实验师"
			}],
			"name": "在实验中探究生物技术"
		}, {
			"cid": "BM011",
			"kaikeList": [{
				"bsid": "372927",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院302",
				"startWeek": 1,
				"teacherList": ["王莲芸 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院302(1-16周).王莲芸 教授"
			}],
			"name": "现代医学导论"
		}],
		"name": "生命科学技术学院",
		"xyid": "08000"
	}, {
		"courseList": [{
			"cid": "BI039",
			"kaikeList": [{
				"bsid": "372929",
				"endWeek": 16,
				"fmtTime": "四(7-8)",
				"room": "东下院102",
				"startWeek": 1,
				"teacherList": ["熊丽琴 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第7节--第8节\n东下院102(1-16周).熊丽琴 助理研究员"
			}],
			"name": "分子影像学与疾病早期诊断"
		}],
		"name": "生物医学工程学院",
		"xyid": "08200"
	}, {
		"courseList": [{
			"cid": "CH060",
			"kaikeList": [{
				"bsid": "372903",
				"endWeek": 8,
				"fmtTime": "五(9-10)",
				"room": "东上院501",
				"startWeek": 1,
				"teacherList": ["王锡荣 教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期五 第9节--第10节\n东上院501(1-8周).王锡荣 教授"
			}],
			"name": "1930年代上海文学地图"
		}, {
			"cid": "CH063",
			"kaikeList": [{
				"bsid": "372918",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东上院105",
				"startWeek": 1,
				"teacherList": ["陈建华 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东上院105(1-16周).陈建华 教授"
			}],
			"name": "中国现代文学与电影"
		}, {
			"cid": "CH066",
			"kaikeList": [{
				"bsid": "372919",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["安琪 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院203(1-16周).安琪 讲师(高校)"
			}],
			"name": "中国艺术史"
		}, {
			"cid": "CH068",
			"kaikeList": [{
				"bsid": "373485",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院314",
				"startWeek": 1,
				"teacherList": ["何延红（笔名：何言宏） 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院314(1-16周).何延红（笔名：何言宏） 教授"
			}],
			"name": "现代中国经典作家"
		}, {
			"cid": "CH199",
			"kaikeList": [{
				"bsid": "371732",
				"endWeek": 16,
				"fmtTime": "三(6-8)",
				"room": "东上院100",
				"startWeek": 1,
				"teacherList": ["刘元春 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第6节--第8节\n东上院100(1-16周).刘元春 讲师(高校)"
			}],
			"name": "核心阅读（I)"
		}, {
			"cid": "CI099",
			"kaikeList": [{
				"bsid": "372905",
				"endWeek": 16,
				"fmtTime": "一(11-12),四(11-12)",
				"room": "上院104",
				"startWeek": 1,
				"teacherList": ["梅悦丽"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n上院104(1-16周).梅悦丽\n星期四 第11节--第12节\n上院104(1-16周).梅悦丽"
			}],
			"name": "汉语"
		}, {
			"cid": "CL002",
			"kaikeList": [{
				"bsid": "372913",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院106",
				"startWeek": 1,
				"teacherList": ["孟令兵 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院106(1-16周).孟令兵 讲师(高校)"
			}],
			"name": "西方宗教文化概论"
		}, {
			"cid": "CL011",
			"kaikeList": [{
				"bsid": "372911",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院307",
				"startWeek": 1,
				"teacherList": ["施立峻 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院307(1-16周).施立峻 副教授"
			}],
			"name": "文学与文化"
		}, {
			"cid": "CL018",
			"kaikeList": [{
				"bsid": "372912",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院110",
				"startWeek": 1,
				"teacherList": ["武云 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院110(1-11周).武云 讲师(高校)"
			}],
			"name": "西方精神探源"
		}, {
			"cid": "CL206",
			"kaikeList": [{
				"bsid": "372999",
				"endWeek": 6,
				"fmtTime": "六(1-4),日(1-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["Sa Weiqi 讲师(高校)"],
				"time": "(1-6周)\n行课安排为第1周 --- 第6周,其中:\n星期六 第1节--第4节\n.(1-6周).Sa Weiqi 讲师(高校)\n星期日 第1节--第4节\n.(1-6周).Sa Weiqi 讲师(高校)"
			}],
			"name": "中国文化概论"
		}, {
			"cid": "FT018",
			"kaikeList": [{
				"bsid": "372917",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院305",
				"startWeek": 1,
				"teacherList": ["易存国 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院305(1-11周).易存国 教授"
			}],
			"name": "影视文化与艺术"
		}, {
			"cid": "HI010",
			"kaikeList": [{
				"bsid": "372908",
				"endWeek": 16,
				"fmtTime": "二(7-8)",
				"room": "东中院2-202",
				"startWeek": 1,
				"teacherList": ["任玉雪 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n东中院2-202(1-16周).任玉雪 副教授"
			}],
			"name": "清史演义"
		}, {
			"cid": "HI050",
			"kaikeList": [{
				"bsid": "372904",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院405",
				"startWeek": 1,
				"teacherList": ["范慕尤 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院405(1-16周).范慕尤 高等学校教师"
			}],
			"name": "佛教史"
		}, {
			"cid": "HI053",
			"kaikeList": [{
				"bsid": "372910",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院404",
				"startWeek": 1,
				"teacherList": ["刘啸 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院404(1-16周).刘啸 助理研究员"
			}],
			"name": "三国史讲演"
		}, {
			"cid": "HI072",
			"kaikeList": [{
				"bsid": "373484",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "东上院307",
				"startWeek": 1,
				"teacherList": ["刘啸 助理研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东上院307(1-11周).刘啸 助理研究员"
			}],
			"name": "《唐代政治史述论稿》导读"
		}, {
			"cid": "JC029",
			"kaikeList": [{
				"bsid": "373501",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院204",
				"startWeek": 1,
				"teacherList": ["金元浦 高等学校教师"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院204(1-11周).金元浦 高等学校教师"
			}],
			"name": "中国文化创意产业前沿理论与实践案例"
		}, {
			"cid": "JC304",
			"kaikeList": [{
				"bsid": "372907",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院210",
				"startWeek": 1,
				"teacherList": ["施立峻 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院210(1-16周).施立峻 副教授"
			}],
			"name": "美学概论"
		}, {
			"cid": "MU004",
			"kaikeList": [{
				"bsid": "372914",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东下院106",
				"startWeek": 1,
				"teacherList": ["胡慈舟 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东下院106(1-16周).胡慈舟 讲师(高校)"
			}, {
				"bsid": "372915",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "东下院106",
				"startWeek": 1,
				"teacherList": ["胡慈舟 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n东下院106(1-11周).胡慈舟 讲师(高校)"
			}],
			"name": "音乐剧与歌舞电影"
		}, {
			"cid": "MU024",
			"kaikeList": [{
				"bsid": "372920",
				"endWeek": 11,
				"fmtTime": "一(6-8)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["胡逸薇 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东上院203(1-11周).胡逸薇 讲师(高校)"
			}, {
				"bsid": "372921",
				"endWeek": 11,
				"fmtTime": "一(11-13)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["胡逸薇 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第11节--第13节\n东上院203(1-11周).胡逸薇 讲师(高校)"
			}],
			"name": "中外通俗歌曲鉴赏"
		}, {
			"cid": "MU037",
			"kaikeList": [{
				"bsid": "372906",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张沁 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).张沁 讲师(高校)"
			}],
			"name": "合唱音乐"
		}, {
			"cid": "MU139",
			"kaikeList": [{
				"bsid": "372916",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院106",
				"startWeek": 1,
				"teacherList": ["胡慈舟 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院106(1-16周).胡慈舟 讲师(高校)"
			}],
			"name": "英语经典歌曲欣赏"
		}, {
			"cid": "PI032",
			"kaikeList": [{
				"bsid": "373483",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "上院320",
				"startWeek": 1,
				"teacherList": ["武云 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院320(1-11周).武云 讲师(高校)"
			}],
			"name": "柏拉图的世界"
		}, {
			"cid": "PI033",
			"kaikeList": [{
				"bsid": "373487",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-104",
				"startWeek": 1,
				"teacherList": ["陈嘉明"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-104(1-16周).陈嘉明"
			}],
			"name": "哲学与思想智慧"
		}, {
			"cid": "SO082",
			"kaikeList": [{
				"bsid": "372909",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院309",
				"startWeek": 1,
				"teacherList": ["丁雁南"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院309(1-16周).丁雁南"
			}],
			"name": "人文地理学导论"
		}],
		"name": "人文学院",
		"xyid": "09000"
	}, {
		"courseList": [{
			"cid": "HI058",
			"kaikeList": [{
				"bsid": "372873",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院108",
				"startWeek": 1,
				"teacherList": ["黄庆桥 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院108(1-16周).黄庆桥 讲师(高校思政)"
			}],
			"name": "中国的“两弹一星”工程"
		}, {
			"cid": "HI102",
			"kaikeList": [{
				"bsid": "372869",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院303",
				"startWeek": 1,
				"teacherList": ["吴新忠 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院303(1-16周).吴新忠 讲师(高校)"
			}, {
				"bsid": "372870",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院208",
				"startWeek": 1,
				"teacherList": ["吴新忠 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院208(1-16周).吴新忠 讲师(高校)"
			}],
			"name": "科学技术史"
		}, {
			"cid": "PI001",
			"kaikeList": [{
				"bsid": "372871",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院301",
				"startWeek": 1,
				"teacherList": ["吴新忠 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院301(1-11周).吴新忠 讲师(高校)"
			}],
			"name": "科学前沿与哲学"
		}, {
			"cid": "PI005",
			"kaikeList": [{
				"bsid": "372872",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院208",
				"startWeek": 1,
				"teacherList": ["吴新忠 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院208(1-16周).吴新忠 讲师(高校)"
			}],
			"name": "宇宙论的历史与哲学"
		}, {
			"cid": "SO073",
			"kaikeList": [{
				"bsid": "372867",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院102",
				"startWeek": 1,
				"teacherList": ["杜严勇 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院102(1-16周).杜严勇 副教授"
			}],
			"name": "创造学与创造性思维训练"
		}, {
			"cid": "SO074",
			"kaikeList": [{
				"bsid": "372868",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院203",
				"startWeek": 1,
				"teacherList": ["穆蕴秋 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院203(1-16周).穆蕴秋 讲师(高校)"
			}],
			"name": "科幻作品与科学外史"
		}],
		"name": "科学史与科学文化研究院",
		"xyid": "09600"
	}, {
		"courseList": [{
			"cid": "AM001",
			"kaikeList": [{
				"bsid": "372843",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "中院110",
				"startWeek": 1,
				"teacherList": ["韩丽川 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院110(1-16周).韩丽川 副教授"
			}, {
				"bsid": "372844",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院108",
				"startWeek": 1,
				"teacherList": ["武邦涛 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院108(1-11周).武邦涛 教授"
			}, {
				"bsid": "372845",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "中院107",
				"startWeek": 1,
				"teacherList": ["汤石章 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院107(1-16周).汤石章 副教授"
			}, {
				"bsid": "372846",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "中院108",
				"startWeek": 1,
				"teacherList": ["胡巍 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n中院108(1-16周).胡巍 副教授"
			}, {
				"bsid": "372847",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院110",
				"startWeek": 1,
				"teacherList": ["李寿德 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院110(1-16周).李寿德 副教授"
			}],
			"name": "管理基础"
		}, {
			"cid": "AM007",
			"kaikeList": [{
				"bsid": "372835",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院202",
				"startWeek": 1,
				"teacherList": ["侯立文 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院202(1-11周).侯立文 副教授"
			}, {
				"bsid": "372836",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院209",
				"startWeek": 1,
				"teacherList": ["李海刚 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院209(1-11周).李海刚 副教授"
			}],
			"name": "电子商务基础"
		}, {
			"cid": "AM021",
			"kaikeList": [{
				"bsid": "372839",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院307",
				"startWeek": 1,
				"teacherList": ["黄采金 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院307(1-16周).黄采金 副教授"
			}, {
				"bsid": "372840",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院307",
				"startWeek": 1,
				"teacherList": ["黄采金 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院307(1-16周).黄采金 副教授"
			}],
			"name": "工程技术管理"
		}, {
			"cid": "AM025",
			"kaikeList": [{
				"bsid": "372848",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院104",
				"startWeek": 1,
				"teacherList": ["杨忠直 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院104(1-16周).杨忠直 教授"
			}],
			"name": "管理经济学（A类）"
		}, {
			"cid": "AM030",
			"kaikeList": [{
				"bsid": "372850",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院103",
				"startWeek": 1,
				"teacherList": ["张兴福 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院103(1-11周).张兴福 副教授"
			}],
			"name": "国学与领导力发展"
		}, {
			"cid": "AM043",
			"kaikeList": [{
				"bsid": "372837",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院107",
				"startWeek": 1,
				"teacherList": ["侯建荣 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院107(1-16周).侯建荣 副教授"
			}],
			"name": "定价策略"
		}, {
			"cid": "AM062",
			"kaikeList": [{
				"bsid": "372861",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院105",
				"startWeek": 1,
				"teacherList": ["井淼 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院105(1-16周).井淼 副教授"
			}],
			"name": "消费者行为学（A）"
		}, {
			"cid": "AM070",
			"kaikeList": [{
				"bsid": "372834",
				"endWeek": 11,
				"fmtTime": "一(11-13)",
				"room": "上院209",
				"startWeek": 1,
				"teacherList": ["李海刚 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第11节--第13节\n上院209(1-11周).李海刚 副教授"
			}],
			"name": "电子商务：创新与战略"
		}, {
			"cid": "AM108",
			"kaikeList": [{
				"bsid": "372860",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院107",
				"startWeek": 1,
				"teacherList": ["史清华 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院107(1-16周).史清华 教授"
			}],
			"name": "消费者行为学"
		}, {
			"cid": "BU007",
			"kaikeList": [{
				"bsid": "372852",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院206",
				"startWeek": 1,
				"teacherList": ["王爱民 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院206(1-11周).王爱民 讲师(高校)"
			}, {
				"bsid": "372853",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院208",
				"startWeek": 1,
				"teacherList": ["王爱民 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院208(1-16周).王爱民 讲师(高校)"
			}],
			"name": "技术经济学(B类)"
		}, {
			"cid": "BU011",
			"kaikeList": [{
				"bsid": "372855",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "中院105",
				"startWeek": 1,
				"teacherList": ["李杰 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n中院105(1-11周).李杰 副教授"
			}],
			"name": "品牌管理导论"
		}, {
			"cid": "BU013",
			"kaikeList": [{
				"bsid": "372856",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "中院105",
				"startWeek": 1,
				"teacherList": ["李杰 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院105(1-11周).李杰 副教授"
			}],
			"name": "品牌审美与管理——F1超跑和法国红酒"
		}, {
			"cid": "BU014",
			"kaikeList": [{
				"bsid": "373431",
				"endWeek": 16,
				"fmtTime": "五(11-13)",
				"room": "上院109",
				"startWeek": 1,
				"teacherList": ["鲍杨"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第11节--第13节\n上院109(1-16周).鲍杨"
			}],
			"name": "商业数据科学"
		}, {
			"cid": "BU100",
			"kaikeList": [{
				"bsid": "372849",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院108",
				"startWeek": 1,
				"teacherList": ["武邦涛 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院108(1-16周).武邦涛 教授"
			}],
			"name": "管理学"
		}, {
			"cid": "BU104",
			"kaikeList": [{
				"bsid": "372862",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "中院107",
				"startWeek": 1,
				"teacherList": ["井淼 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院107(1-11周).井淼 副教授"
			}],
			"name": "营销导论"
		}, {
			"cid": "BU320",
			"kaikeList": [{
				"bsid": "372859",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院3-303",
				"startWeek": 1,
				"teacherList": ["刘欣 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院3-303(1-16周).刘欣 副教授"
			}],
			"name": "项目管理"
		}, {
			"cid": "BU348",
			"kaikeList": [{
				"bsid": "372863",
				"endWeek": 16,
				"fmtTime": "四(11-13)",
				"room": "下院208",
				"startWeek": 1,
				"teacherList": ["汪蓉 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第11节--第13节\n下院208(1-16周).汪蓉 讲师(高校)"
			}],
			"name": "运营管理"
		}, {
			"cid": "BU372",
			"kaikeList": [{
				"bsid": "372858",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院104",
				"startWeek": 1,
				"teacherList": ["吴家春 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院104(1-16周).吴家春 副教授"
			}],
			"name": "商务智能与现代企业管理"
		}, {
			"cid": "BU426",
			"kaikeList": [{
				"bsid": "372832",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院307",
				"startWeek": 1,
				"teacherList": ["黄采金 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院307(1-11周).黄采金 副教授"
			}, {
				"bsid": "372833",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院307",
				"startWeek": 1,
				"teacherList": ["黄采金 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院307(1-16周).黄采金 副教授"
			}],
			"name": "创业机会识别"
		}, {
			"cid": "EC011",
			"kaikeList": [{
				"bsid": "372851",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "中院110",
				"startWeek": 1,
				"teacherList": ["郑育家 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n中院110(1-16周).郑育家 讲师(高校)"
			}],
			"name": "宏观经济学（B类）"
		}, {
			"cid": "EC016",
			"kaikeList": [{
				"bsid": "372841",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院104",
				"startWeek": 1,
				"teacherList": ["杨忠直 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院104(1-11周).杨忠直 教授"
			}],
			"name": "工程经济学(F类)"
		}, {
			"cid": "EC017",
			"kaikeList": [{
				"bsid": "372838",
				"endWeek": 11,
				"fmtTime": "四(6-8)",
				"room": "下院307",
				"startWeek": 1,
				"teacherList": ["顾海英 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第6节--第8节\n下院307(1-11周).顾海英 教授"
			}],
			"name": "发展经济学专题"
		}, {
			"cid": "EC100",
			"kaikeList": [{
				"bsid": "372854",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院102",
				"startWeek": 1,
				"teacherList": ["汤石章 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院102(1-16周).汤石章 副教授"
			}],
			"name": "经济学"
		}, {
			"cid": "EN315",
			"kaikeList": [{
				"bsid": "372857",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东中院4-204",
				"startWeek": 1,
				"teacherList": ["陈幼平 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东中院4-204(1-16周).陈幼平 副教授"
			}],
			"name": "商务英语沟通"
		}, {
			"cid": "PU066",
			"kaikeList": [{
				"bsid": "372842",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院106",
				"startWeek": 1,
				"teacherList": ["王金桃 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院106(1-16周).王金桃 副教授"
			}],
			"name": "公共安全与危机管理：基础和方法"
		}],
		"name": "安泰经济与管理学院",
		"xyid": "12000"
	}, {
		"courseList": [{
			"cid": "AM008",
			"kaikeList": [{
				"bsid": "372795",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院202",
				"startWeek": 1,
				"teacherList": ["莫童 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院202(1-16周).莫童 副教授"
			}],
			"name": "WTO法律文件选读"
		}, {
			"cid": "EC021",
			"kaikeList": [{
				"bsid": "373387",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院201",
				"startWeek": 1,
				"teacherList": ["吕守军 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院201(1-11周).吕守军 副教授"
			}],
			"name": "现当代经济思想导论"
		}, {
			"cid": "PU040",
			"kaikeList": [{
				"bsid": "372799",
				"endWeek": 16,
				"fmtTime": "二(7-8)",
				"room": "东上院205",
				"startWeek": 1,
				"teacherList": ["陈拯 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n东上院205(1-16周).陈拯 讲师(高校)"
			}],
			"name": "国际安全"
		}, {
			"cid": "PU050",
			"kaikeList": [{
				"bsid": "373388",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东上院309",
				"startWeek": 1,
				"teacherList": ["张学昆 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东上院309(1-16周).张学昆 讲师(高校)"
			}],
			"name": "国际关系学导论"
		}, {
			"cid": "PU058",
			"kaikeList": [{
				"bsid": "372803",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院105",
				"startWeek": 1,
				"teacherList": ["黄平 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院105(1-16周).黄平 讲师(高校)"
			}],
			"name": "宗教与社会"
		}, {
			"cid": "PU078",
			"kaikeList": [{
				"bsid": "372797",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院202",
				"startWeek": 1,
				"teacherList": ["黄宗昊 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院202(1-16周).黄宗昊 讲师(高校)"
			}],
			"name": "各国政府与政治"
		}, {
			"cid": "PU088",
			"kaikeList": [{
				"bsid": "372800",
				"endWeek": 16,
				"fmtTime": "四(6-8)",
				"room": "东上院306",
				"startWeek": 1,
				"teacherList": ["黄琪轩 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第6节--第8节\n东上院306(1-16周).黄琪轩 副教授"
			}],
			"name": "全球政治经济学导论"
		}, {
			"cid": "PU109",
			"kaikeList": [{
				"bsid": "372801",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院109",
				"startWeek": 1,
				"teacherList": ["黄平 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院109(1-11周).黄平 讲师(高校)"
			}],
			"name": "英美剧中的国际关系"
		}, {
			"cid": "WA002",
			"kaikeList": [{
				"bsid": "372802",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东上院206",
				"startWeek": 1,
				"teacherList": ["陈拯 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东上院206(1-16周).陈拯 讲师(高校)"
			}],
			"name": "战争的起源：理论与历史"
		}],
		"name": "国际与公共事务学院",
		"xyid": "13000"
	}, {
		"courseList": [{
			"cid": "EN026",
			"kaikeList": [{
				"bsid": "373591",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院106",
				"startWeek": 1,
				"teacherList": ["王宇 副教授", "Jenny xu 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院106(1-16周).王宇 副教授\n星期四 第3节--第4节\n上院106(1-16周).Jenny xu 高等学校教师"
			}, {
				"bsid": "373592",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院107",
				"startWeek": 1,
				"teacherList": ["Jenny xu 高等学校教师", "叶菊仙 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院107(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院107(1-16周).叶菊仙 副教授"
			}, {
				"bsid": "373593",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院108",
				"startWeek": 1,
				"teacherList": ["陆元雯 副教授", "Jenny xu 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院108(1-16周).陆元雯 副教授\n星期四 第3节--第4节\n上院108(1-16周).Jenny xu 高等学校教师"
			}, {
				"bsid": "373594",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院112",
				"startWeek": 1,
				"teacherList": ["Jenny xu 高等学校教师", "丁兴华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院112(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院112(1-16周).丁兴华 副教授"
			}, {
				"bsid": "373595",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院202",
				"startWeek": 1,
				"teacherList": ["隋莉 讲师(高校)", "Jenny xu 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院202(1-16周).隋莉 讲师(高校)\n星期四 第3节--第4节\n上院202(1-16周).Jenny xu 高等学校教师"
			}, {
				"bsid": "373596",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院307",
				"startWeek": 1,
				"teacherList": ["Jenny xu 高等学校教师", "沈亚丽 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院307(1-16周).Jenny xu 高等学校教师\n星期四 第3节--第4节\n上院307(1-16周).沈亚丽 讲师(高校)"
			}, {
				"bsid": "373597",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院206",
				"startWeek": 1,
				"teacherList": ["田艳 教授", "Jenny xu 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院206(1-16周).田艳 教授\n星期四 第3节--第4节\n上院206(1-16周).Jenny xu 高等学校教师"
			}, {
				"bsid": "373598",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院208,上院401",
				"startWeek": 1,
				"teacherList": ["李侠 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院208(1-16周).李侠 副教授\n星期四 第3节--第4节\n上院401(1-16周).李侠 副教授"
			}, {
				"bsid": "373599",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院401,上院208",
				"startWeek": 1,
				"teacherList": ["李鑫 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院401(1-16周).李鑫 讲师(高校)\n星期四 第3节--第4节\n上院208(1-16周).李鑫 讲师(高校)"
			}, {
				"bsid": "373600",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院209,上院403",
				"startWeek": 1,
				"teacherList": ["苏坤 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院209(1-16周).苏坤 讲师(高校)\n星期四 第3节--第4节\n上院403(1-16周).苏坤 讲师(高校)"
			}, {
				"bsid": "374090",
				"endWeek": 16,
				"fmtTime": "二(11-12),五(11-12)",
				"room": "下院104",
				"startWeek": 1,
				"teacherList": ["徐永智 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师\n星期五 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师"
			}, {
				"bsid": "374092",
				"endWeek": 16,
				"fmtTime": "一(11-12),四(11-12)",
				"room": "下院104",
				"startWeek": 1,
				"teacherList": ["徐永智 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师\n星期四 第11节--第12节\n下院104(1-16周).徐永智 高等学校教师"
			}, {
				"bsid": "374094",
				"endWeek": 16,
				"fmtTime": "一(1-2),四(3-4)",
				"room": "上院422",
				"startWeek": 1,
				"teacherList": ["朱丽莎 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第1节--第2节\n上院422(1-16周).朱丽莎 高等学校教师\n星期四 第3节--第4节\n上院422(1-16周).朱丽莎 高等学校教师"
			}, {
				"bsid": "374095",
				"endWeek": 16,
				"fmtTime": "一(7-8),四(1-2)",
				"room": "上院320",
				"startWeek": 1,
				"teacherList": ["朱丽莎 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第7节--第8节\n上院320(1-16周).朱丽莎 高等学校教师\n星期四 第1节--第2节\n上院320(1-16周).朱丽莎 高等学校教师"
			}, {
				"bsid": "374106",
				"endWeek": 16,
				"fmtTime": "二(1-2),五(3-4)",
				"room": "中院103",
				"startWeek": 1,
				"teacherList": ["吴湾 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第1节--第2节\n中院103(1-16周).吴湾 高等学校教师\n星期五 第3节--第4节\n中院103(1-16周).吴湾 高等学校教师"
			}, {
				"bsid": "374107",
				"endWeek": 16,
				"fmtTime": "二(7-8),五(1-2)",
				"room": "中院101",
				"startWeek": 1,
				"teacherList": ["吴湾 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n中院101(1-16周).吴湾 高等学校教师\n星期五 第1节--第2节\n中院101(1-16周).吴湾 高等学校教师"
			}],
			"name": "大学基础英语（2）"
		}, {
			"cid": "FO005",
			"kaikeList": [{
				"bsid": "372934",
				"endWeek": 16,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "上院206",
				"startWeek": 1,
				"teacherList": ["曹慧 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院206(1-16周).曹慧 讲师(高校)\n星期四 第9节--第10节\n上院206(1-16周).曹慧 讲师(高校)"
			}],
			"name": "基础法语(上)"
		}, {
			"cid": "FO007",
			"kaikeList": [{
				"bsid": "372777",
				"endWeek": 16,
				"fmtTime": "六(1-2),日(1-2)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["黄晓艳 讲师(高校)", "薛原 讲师(高校)", "管新潮 副编审"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期六 第1节--第2节\n.(1-16周).黄晓艳 讲师(高校)\n.(1-16周).薛原 讲师(高校)\n.(1-16周).管新潮 副编审\n星期日 第1节--第2节\n.(1-16周).黄晓艳 讲师(高校)\n.(1-16周).薛原 讲师(高校)\n.(1-16周).管新潮 副编审"
			}],
			"name": "德语(B类）(上)"
		}, {
			"cid": "JA001",
			"kaikeList": [{
				"bsid": "372936",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "上院318",
				"startWeek": 1,
				"teacherList": ["单娟 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院318(1-16周).单娟 讲师(高校)\n星期四 第9节--第10节\n上院318(1-16周).单娟 讲师(高校)"
			}, {
				"bsid": "372937",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "下院306",
				"startWeek": 1,
				"teacherList": ["林子博"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n下院306(1-16周).林子博\n星期四 第9节--第10节\n下院306(1-16周).林子博"
			}, {
				"bsid": "372938",
				"endWeek": 16,
				"fmtTime": "一(9-10),四(9-10)",
				"room": "上院314",
				"startWeek": 1,
				"teacherList": ["陈崇君 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院314(1-16周).陈崇君 副教授\n星期四 第9节--第10节\n上院314(1-16周).陈崇君 副教授"
			}],
			"name": "基础日语(上)"
		}, {
			"cid": "JA002",
			"kaikeList": [{
				"bsid": "372939",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "上院418",
				"startWeek": 1,
				"teacherList": ["王琳 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院418(1-16周).王琳 副教授\n星期四 第9节--第10节\n上院418(1-16周).王琳 副教授"
			}],
			"name": "基础日语(下)"
		}, {
			"cid": "JA012",
			"kaikeList": [{
				"bsid": "372935",
				"endWeek": 16,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "东中院3-302",
				"startWeek": 1,
				"teacherList": ["黄建香 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院3-302(1-16周).黄建香 副教授\n星期四 第9节--第10节\n东中院3-302(1-16周).黄建香 副教授"
			}],
			"name": "基础日语(（Ⅲ）"
		}],
		"name": "外国语学院",
		"xyid": "14000"
	}, {
		"courseList": [{
			"cid": "AB010",
			"kaikeList": [{
				"bsid": "373479",
				"endWeek": 7,
				"fmtTime": "一(6-8)",
				"room": ".",
				"startWeek": 2,
				"teacherList": ["方心葵 副教授", "徐鲁荣 助理研究员", "王秀红 高级实验师"],
				"time": "(2-7周)\n行课安排为第2周 --- 第7周,其中:\n星期一 第6节--第8节\n.(2-7周).方心葵 副教授\n.(2-7周).徐鲁荣 助理研究员\n.(2-7周).王秀红 高级实验师"
			}],
			"name": "农科大型仪器设备操作与使用"
		}, {
			"cid": "BI027",
			"kaikeList": [{
				"bsid": "372900",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "东下院402",
				"startWeek": 1,
				"teacherList": ["赵静雅 副教授", "潘琪芳 助理研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东下院402(1-11周).赵静雅 副教授\n东下院402(1-11周).潘琪芳 助理研究员"
			}],
			"name": "生物技术概论"
		}, {
			"cid": "BU015",
			"kaikeList": [{
				"bsid": "373476",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "东下院203",
				"startWeek": 1,
				"teacherList": ["钟宇 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n东下院203(1-11周).钟宇 讲师(高校)"
			}],
			"name": "食品营销与案例赏析"
		}, {
			"cid": "EV007",
			"kaikeList": [{
				"bsid": "372899",
				"endWeek": 11,
				"fmtTime": "一(6-8)",
				"room": "东下院202",
				"startWeek": 1,
				"teacherList": ["刘群录 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n东下院202(1-11周).刘群录 副教授"
			}],
			"name": "生态安全与生态文明"
		}, {
			"cid": "EV040",
			"kaikeList": [{
				"bsid": "372896",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "中院405",
				"startWeek": 1,
				"teacherList": ["殷杉 助理研究员", "刘春江 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n中院405(1-11周).殷杉 助理研究员\n中院405(1-11周).刘春江 教授"
			}],
			"name": "全球变化下的自然和生态"
		}, {
			"cid": "FS004",
			"kaikeList": [{
				"bsid": "372897",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东中院1-200",
				"startWeek": 1,
				"teacherList": ["姚晓敏 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东中院1-200(1-16周).姚晓敏 副教授"
			}],
			"name": "膳食指南与营养评估"
		}, {
			"cid": "GA003",
			"kaikeList": [{
				"bsid": "373481",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "上院314",
				"startWeek": 1,
				"teacherList": ["于冰沁 讲师(高校)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n上院314(1-11周).于冰沁 讲师(高校)"
			}],
			"name": "西方风景园林规划设计史"
		}, {
			"cid": "GA407",
			"kaikeList": [{
				"bsid": "372894",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-402",
				"startWeek": 1,
				"teacherList": ["李洁 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-402(1-16周).李洁 副教授"
			}],
			"name": "花卉应用学"
		}, {
			"cid": "ME089",
			"kaikeList": [{
				"bsid": "373478",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东下院101",
				"startWeek": 1,
				"teacherList": ["章竞瑾"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院101(1-16周).章竞瑾"
			}],
			"name": "农业机器人绪论"
		}, {
			"cid": "PI016",
			"kaikeList": [{
				"bsid": "372902",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院209",
				"startWeek": 1,
				"teacherList": ["杨志彪 副研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院209(1-11周).杨志彪 副研究员"
			}],
			"name": "中国传统文化中的哲学思想"
		}, {
			"cid": "PL004",
			"kaikeList": [{
				"bsid": "372892",
				"endWeek": 8,
				"fmtTime": "四(9-10)",
				"room": "东中院4-402",
				"startWeek": 1,
				"teacherList": ["李洁 副教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第9节--第10节\n东中院4-402(1-8周).李洁 副教授"
			}],
			"name": "插花艺术"
		}, {
			"cid": "PL021",
			"kaikeList": [{
				"bsid": "372893",
				"endWeek": 8,
				"fmtTime": "二(9-10),四(9-10)",
				"room": "中院207",
				"startWeek": 1,
				"teacherList": ["曾丽 副教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期二 第9节--第10节\n中院207(1-8周).曾丽 副教授\n星期四 第9节--第10节\n中院207(1-8周).曾丽 副教授"
			}],
			"name": "花卉艺术"
		}, {
			"cid": "PL026",
			"kaikeList": [{
				"bsid": "372895",
				"endWeek": 13,
				"fmtTime": "二(11-13)",
				"room": "中院100",
				"startWeek": 3,
				"teacherList": ["张才喜 教授", "王世平 教授", "宋士任 助理研究员"],
				"time": "(3-13周)\n行课安排为第3周 --- 第13周,其中:\n星期二 第11节--第13节\n中院100(3-13周).张才喜 教授\n中院100(3-13周).王世平 教授\n中院100(3-13周).宋士任 助理研究员"
			}],
			"name": "葡萄与葡萄酒文化"
		}, {
			"cid": "PL027",
			"kaikeList": [{
				"bsid": "372901",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东下院305",
				"startWeek": 9,
				"teacherList": ["常丽英 副教授"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院305(9-16周).常丽英 副教授"
			}],
			"name": "园艺与文化"
		}, {
			"cid": "PL029",
			"kaikeList": [{
				"bsid": "372898",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院4-103",
				"startWeek": 1,
				"teacherList": ["苗志奇 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-103(1-16周).苗志奇 副教授"
			}],
			"name": "神奇的蘑菇"
		}, {
			"cid": "PL031",
			"kaikeList": [{
				"bsid": "373480",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院202",
				"startWeek": 1,
				"teacherList": ["耿雪青 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院202(1-16周).耿雪青 讲师(高校)"
			}],
			"name": "植物与生活"
		}, {
			"cid": "SA002",
			"kaikeList": [{
				"bsid": "372933",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "上院209",
				"startWeek": 1,
				"teacherList": ["王品"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n上院209(1-16周).王品"
			}],
			"name": "梵语（2）"
		}],
		"name": "农业与生物学院",
		"xyid": "15000"
	}, {
		"courseList": [{
			"cid": "EV029",
			"kaikeList": [{
				"bsid": "372805",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东上院303",
				"startWeek": 1,
				"teacherList": ["靳强 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院303(1-16周).靳强 副教授"
			}],
			"name": "绿色过程工程"
		}, {
			"cid": "EV031",
			"kaikeList": [{
				"bsid": "372804",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院308",
				"startWeek": 1,
				"teacherList": ["何小娟 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院308(1-16周).何小娟 助理研究员"
			}],
			"name": "环境问题与对策"
		}, {
			"cid": "EV032",
			"kaikeList": [{
				"bsid": "372806",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-405",
				"startWeek": 1,
				"teacherList": ["黄荣振"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-405(1-16周).黄荣振"
			}],
			"name": "湿地生态"
		}],
		"name": "环境科学与工程学院",
		"xyid": "16000"
	}, {
		"courseList": [{
			"cid": "PM005",
			"kaikeList": [{
				"bsid": "372956",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东下院403",
				"startWeek": 1,
				"teacherList": ["王梦月 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东下院403(1-16周).王梦月 副教授"
			}],
			"name": "中药学通论"
		}],
		"name": "药学院",
		"xyid": "17000"
	}, {
		"courseList": [{
			"cid": "PU041",
			"kaikeList": [{
				"bsid": "372958",
				"endWeek": 11,
				"fmtTime": "一(6-8)",
				"room": "上院101",
				"startWeek": 1,
				"teacherList": ["蔡骏 助理研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期一 第6节--第8节\n上院101(1-11周).蔡骏 助理研究员"
			}],
			"name": "危机与公共关系"
		}],
		"name": "医学院（并校前）",
		"xyid": "18000"
	}, {
		"courseList": [{
			"cid": "PS004",
			"kaikeList": [{
				"bsid": "373385",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": "下院308",
				"startWeek": 1,
				"teacherList": ["秦裕林 教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n下院308(1-11周).秦裕林 教授"
			}],
			"name": "认知心理学及其应用"
		}],
		"name": "凯原法学院",
		"xyid": "19000"
	}, {
		"courseList": [{
			"cid": "AD001",
			"kaikeList": [{
				"bsid": "373467",
				"endWeek": 16,
				"fmtTime": "二(7-8)",
				"room": "上院420",
				"startWeek": 1,
				"teacherList": ["马红冰 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n上院420(1-16周).马红冰 讲师(高校)"
			}],
			"name": "素描"
		}, {
			"cid": "AR007",
			"kaikeList": [{
				"bsid": "373468",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院420",
				"startWeek": 1,
				"teacherList": ["马红冰 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院420(1-16周).马红冰 讲师(高校)"
			}],
			"name": "色彩艺术"
		}, {
			"cid": "DR001",
			"kaikeList": [{
				"bsid": "373473",
				"endWeek": 16,
				"fmtTime": "二(7-8)",
				"room": "中院100",
				"startWeek": 1,
				"teacherList": ["徐庆华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第7节--第8节\n中院100(1-16周).徐庆华 副教授"
			}],
			"name": "书法艺术"
		}, {
			"cid": "DR002",
			"kaikeList": [{
				"bsid": "373474",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院100",
				"startWeek": 1,
				"teacherList": ["no 徐庆华 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院100(1-16周).no 徐庆华 副教授"
			}],
			"name": "篆刻艺术"
		}, {
			"cid": "DR010",
			"kaikeList": [{
				"bsid": "373469",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "东上院308",
				"startWeek": 1,
				"teacherList": ["王宏卫 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n东上院308(1-16周).王宏卫 讲师(高校)"
			}],
			"name": "绘画基础"
		}, {
			"cid": "PH015",
			"kaikeList": [{
				"bsid": "373471",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["施健 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).施健 副教授"
			}, {
				"bsid": "373472",
				"endWeek": 11,
				"fmtTime": "二(11-13)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["施健 副教授"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第11节--第13节\n.(1-11周).施健 副教授"
			}],
			"name": "宝玉石鉴定法"
		}, {
			"cid": "PH020",
			"kaikeList": [{
				"bsid": "373470",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "东上院102",
				"startWeek": 1,
				"teacherList": ["施健 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n东上院102(1-16周).施健 副教授"
			}],
			"name": "地球科学"
		}],
		"name": "媒体与设计学院",
		"xyid": "20000"
	}, {
		"courseList": [{
			"cid": "PI034",
			"kaikeList": [{
				"bsid": "373706",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东下院201",
				"startWeek": 1,
				"teacherList": ["Frank Hoffman 教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东下院201(1-16周).Frank Hoffman 教授"
			}],
			"name": "伦理道德哲学"
		}, {
			"cid": "TH009",
			"kaikeList": [{
				"bsid": "372970",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院109",
				"startWeek": 1,
				"teacherList": ["史宏波"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院109(1-16周).史宏波"
			}, {
				"bsid": "372972",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院100",
				"startWeek": 1,
				"teacherList": ["谈毅"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院100(1-16周).谈毅"
			}, {
				"bsid": "372974",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院110",
				"startWeek": 1,
				"teacherList": ["丁东锋"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院110(1-16周).丁东锋"
			}, {
				"bsid": "372975",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院101",
				"startWeek": 1,
				"teacherList": ["喜苏南"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院101(1-16周).喜苏南"
			}, {
				"bsid": "372976",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院101",
				"startWeek": 1,
				"teacherList": ["喜苏南 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院101(1-16周).喜苏南 副教授(高校思政)"
			}, {
				"bsid": "372977",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院103",
				"startWeek": 1,
				"teacherList": ["陈华栋"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院103(1-16周).陈华栋"
			}, {
				"bsid": "372979",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院103",
				"startWeek": 1,
				"teacherList": ["陈华栋 副研究员(高教管理)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院103(1-16周).陈华栋 副研究员(高教管理)"
			}, {
				"bsid": "372980",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院201",
				"startWeek": 1,
				"teacherList": ["徐剑波"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院201(1-16周).徐剑波"
			}, {
				"bsid": "372981",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院201",
				"startWeek": 1,
				"teacherList": ["徐剑波 副研究员(高教管理)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院201(1-16周).徐剑波 副研究员(高教管理)"
			}, {
				"bsid": "372982",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院203",
				"startWeek": 1,
				"teacherList": ["赵加强"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院203(1-16周).赵加强"
			}, {
				"bsid": "372983",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院200",
				"startWeek": 1,
				"teacherList": ["胡薇薇"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院200(1-16周).胡薇薇"
			}, {
				"bsid": "372984",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院300",
				"startWeek": 1,
				"teacherList": ["黄庆桥"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院300(1-16周).黄庆桥"
			}, {
				"bsid": "372985",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院300",
				"startWeek": 1,
				"teacherList": ["黄庆桥 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院300(1-16周).黄庆桥 讲师(高校思政)"
			}, {
				"bsid": "372986",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院301",
				"startWeek": 1,
				"teacherList": ["蒋立峰"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院301(1-16周).蒋立峰"
			}, {
				"bsid": "372987",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院303",
				"startWeek": 1,
				"teacherList": ["顾希垚"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院303(1-16周).顾希垚"
			}, {
				"bsid": "372988",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院305",
				"startWeek": 1,
				"teacherList": ["吕忆松"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院305(1-16周).吕忆松"
			}, {
				"bsid": "372989",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院305",
				"startWeek": 1,
				"teacherList": ["吕忆松 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院305(1-16周).吕忆松 副教授"
			}, {
				"bsid": "372990",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院100",
				"startWeek": 1,
				"teacherList": ["郑浩"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院100(1-16周).郑浩"
			}, {
				"bsid": "372991",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "上院100",
				"startWeek": 1,
				"teacherList": ["郑浩 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n上院100(1-16周).郑浩 讲师(高校思政)"
			}, {
				"bsid": "372992",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院304",
				"startWeek": 1,
				"teacherList": ["李莹莹"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院304(1-16周).李莹莹"
			}, {
				"bsid": "372994",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院304",
				"startWeek": 1,
				"teacherList": ["李莹莹 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院304(1-16周).李莹莹 讲师(高校思政)"
			}, {
				"bsid": "372995",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院305",
				"startWeek": 1,
				"teacherList": ["陈丽璘 助理研究员(高教管理)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院305(1-16周).陈丽璘 助理研究员(高教管理)"
			}, {
				"bsid": "372997",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院303",
				"startWeek": 1,
				"teacherList": ["郑文栋"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院303(1-16周).郑文栋"
			}, {
				"bsid": "372998",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院403",
				"startWeek": 1,
				"teacherList": ["张燕红"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院403(1-16周).张燕红"
			}, {
				"bsid": "373000",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院404",
				"startWeek": 1,
				"teacherList": ["冯霞"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院404(1-16周).冯霞"
			}, {
				"bsid": "373001",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院405",
				"startWeek": 1,
				"teacherList": ["梁钦"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院405(1-16周).梁钦"
			}, {
				"bsid": "373002",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院405",
				"startWeek": 1,
				"teacherList": ["梁钦 助教(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院405(1-16周).梁钦 助教(高校思政)"
			}, {
				"bsid": "373003",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院102",
				"startWeek": 1,
				"teacherList": ["卢建川 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院102(1-16周).卢建川 讲师(高校思政)"
			}, {
				"bsid": "373004",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院102",
				"startWeek": 1,
				"teacherList": ["卢建川 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院102(1-16周).卢建川 讲师(高校思政)"
			}, {
				"bsid": "373588",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院305",
				"startWeek": 1,
				"teacherList": ["陈丽璘 助理研究员(高教管理)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院305(1-16周).陈丽璘 助理研究员(高教管理)"
			}, {
				"bsid": "373720",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院103",
				"startWeek": 1,
				"teacherList": ["赵昕"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院103(1-16周).赵昕"
			}, {
				"bsid": "373721",
				"endWeek": 16,
				"fmtTime": "三(9-10)",
				"room": "东上院103",
				"startWeek": 1,
				"teacherList": ["赵昕 讲师(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第9节--第10节\n东上院103(1-16周).赵昕 讲师(高校思政)"
			}],
			"name": "形势与政策"
		}, {
			"cid": "TH021",
			"kaikeList": [{
				"bsid": "372465",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院109",
				"startWeek": 1,
				"teacherList": ["张一平"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院109(1-16周).张一平"
			}],
			"name": "中国近现代史纲要"
		}],
		"name": "马克思主义学院",
		"xyid": "23000"
	}, {
		"courseList": [{
			"cid": "PE002",
			"kaikeList": [{
				"bsid": "373808",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["顾剑平 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).顾剑平 讲师(高校)"
			}, {
				"bsid": "373865",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["宋顺 助教(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).宋顺 助教(高校)"
			}, {
				"bsid": "373867",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["王斌 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).王斌 副教授"
			}, {
				"bsid": "373868",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["赵军民 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).赵军民 讲师(高校)"
			}, {
				"bsid": "373869",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["束拉 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).束拉 讲师(高校)"
			}, {
				"bsid": "373871",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张健 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).张健 讲师(高校)"
			}, {
				"bsid": "373873",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["吴爱平 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).吴爱平 讲师(高校)"
			}, {
				"bsid": "373874",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["吴富勇 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).吴富勇 讲师(高校)"
			}, {
				"bsid": "373876",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["叶汉忠 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).叶汉忠 讲师(高校)"
			}, {
				"bsid": "373877",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["顾剑平 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).顾剑平 讲师(高校)"
			}, {
				"bsid": "373878",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["黄英杰 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).黄英杰 副教授"
			}, {
				"bsid": "373879",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张丽君 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).张丽君 讲师(高校)"
			}, {
				"bsid": "373880",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["姚武 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).姚武 副教授"
			}, {
				"bsid": "373881",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["沈丽群 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).沈丽群 高等学校教师"
			}, {
				"bsid": "373882",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["俞军 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).俞军 副教授"
			}, {
				"bsid": "373883",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["窦秀敏 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).窦秀敏 讲师(高校)"
			}, {
				"bsid": "373884",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["朱颖文 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).朱颖文 讲师(高校)"
			}, {
				"bsid": "373885",
				"endWeek": 16,
				"fmtTime": "三(3-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["高芸 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期三 第3节--第4节\n.(1-16周).高芸 讲师(高校)"
			}],
			"name": "体育（2）"
		}, {
			"cid": "PE005",
			"kaikeList": [{
				"bsid": "373753",
				"endWeek": 8,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["刘美香 副教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第9节--第10节\n.(1-8周).刘美香 副教授"
			}, {
				"bsid": "373754",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 9,
				"teacherList": ["刘美香 副教授"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期四 第9节--第10节\n.(9-16周).刘美香 副教授"
			}, {
				"bsid": "373755",
				"endWeek": 8,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["朱洁 讲师(高校)"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期一 第9节--第10节\n.(1-8周).朱洁 讲师(高校)"
			}, {
				"bsid": "373756",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 9,
				"teacherList": ["朱洁 讲师(高校)"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n.(9-16周).朱洁 讲师(高校)"
			}, {
				"bsid": "373757",
				"endWeek": 8,
				"fmtTime": "五(9-10)",
				"room": "上院302",
				"startWeek": 1,
				"teacherList": ["王泽民 副教授"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期五 第9节--第10节\n上院302(1-8周).王泽民 副教授"
			}, {
				"bsid": "373758",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": "上院302",
				"startWeek": 9,
				"teacherList": ["王泽民 副教授"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期五 第9节--第10节\n上院302(9-16周).王泽民 副教授"
			}],
			"name": "体育（5）"
		}],
		"name": "体育系",
		"xyid": "25100"
	}, {
		"courseList": [{
			"cid": "AM016",
			"kaikeList": [{
				"bsid": "372932",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["陆宏弟 副研究馆员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).陆宏弟 副研究馆员"
			}],
			"name": "网络环境下的文科信息检索"
		}],
		"name": "图书馆",
		"xyid": "33000"
	}, {
		"courseList": [{
			"cid": "CI006",
			"kaikeList": [{
				"bsid": "373704",
				"endWeek": 16,
				"fmtTime": "一(10-11),三(10-11)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张燕俊 助教(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第10节--第11节\n.(1-16周).张燕俊 助教(高校)\n星期三 第10节--第11节\n.(1-16周).张燕俊 助教(高校)"
			}, {
				"bsid": "373705",
				"endWeek": 16,
				"fmtTime": "二(10-11),四(10-11)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张永蓉 高等学校教师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第10节--第11节\n.(1-16周).张永蓉 高等学校教师\n星期四 第10节--第11节\n.(1-16周).张永蓉 高等学校教师"
			}],
			"name": "初级汉语"
		}],
		"name": "国际教育学院",
		"xyid": "36000"
	}, {
		"courseList": [{
			"cid": "CI222",
			"kaikeList": [{
				"bsid": "373006",
				"endWeek": 6,
				"fmtTime": "六(1-4),日(1-4)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["Dianne Atkinson 高等学校教师"],
				"time": "(1-6周)\n行课安排为第1周 --- 第6周,其中:\n星期六 第1节--第4节\n.(1-6周).Dianne Atkinson 高等学校教师\n星期日 第1节--第4节\n.(1-6周).Dianne Atkinson 高等学校教师"
			}],
			"name": "跨文化交流"
		}],
		"name": "密西根学院",
		"xyid": "37000"
	}, {
		"courseList": [{
			"cid": "CS075",
			"kaikeList": [{
				"bsid": "372940",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院1-101",
				"startWeek": 1,
				"teacherList": ["林新华 助理研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院1-101(1-16周).林新华 助理研究员"
			}],
			"name": "高性能计算"
		}],
		"name": "网络信息中心",
		"xyid": "40100"
	}, {
		"courseList": [{
			"cid": "AU015",
			"kaikeList": [{
				"bsid": "372787",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["季钢 副教授"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).季钢 副教授"
			}],
			"name": "单片机应用系统设计"
		}, {
			"cid": "ME011",
			"kaikeList": [{
				"bsid": "372791",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["曲凌 工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).曲凌 工程师"
			}],
			"name": "机器人设计与制作"
		}, {
			"cid": "ME013",
			"kaikeList": [{
				"bsid": "372793",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["陆顺寿 高级工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).陆顺寿 高级工程师"
			}],
			"name": "艺术铸造"
		}, {
			"cid": "ME043",
			"kaikeList": [{
				"bsid": "372790",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["王留芳 高级工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).王留芳 高级工程师"
			}],
			"name": "机器人控制基础"
		}, {
			"cid": "ME045",
			"kaikeList": [{
				"bsid": "372788",
				"endWeek": 16,
				"fmtTime": "五(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["李劲松 高级工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期五 第9节--第10节\n.(1-16周).李劲松 高级工程师"
			}],
			"name": "航模技术与实践"
		}, {
			"cid": "ME049",
			"kaikeList": [{
				"bsid": "372786",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["徐巍 工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).徐巍 工程师"
			}],
			"name": "创意设计与快速成形"
		}, {
			"cid": "ME058",
			"kaikeList": [{
				"bsid": "372789",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["宋立博 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).宋立博 副研究员"
			}],
			"name": "机器人机电一体化设计导论与工程实践"
		}, {
			"cid": "ME070",
			"kaikeList": [{
				"bsid": "372792",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["范成杰 工程师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).范成杰 工程师"
			}],
			"name": "机械创新设计"
		}, {
			"cid": "ME090",
			"kaikeList": [{
				"bsid": "373386",
				"endWeek": 16,
				"fmtTime": "一(11-13)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["张培艳 副研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第11节--第13节\n.(1-16周).张培艳 副研究员"
			}],
			"name": "工程认知实践"
		}],
		"name": "工程训练中心",
		"xyid": "41000"
	}, {
		"courseList": [{
			"cid": "JC024",
			"kaikeList": [{
				"bsid": "372925",
				"endWeek": 16,
				"fmtTime": "二(6-8)",
				"room": "东中院1-100",
				"startWeek": 1,
				"teacherList": ["谢耘耕 研究员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第6节--第8节\n东中院1-100(1-16周).谢耘耕 研究员"
			}],
			"name": "新媒体与社会"
		}, {
			"cid": "MU034",
			"kaikeList": [{
				"bsid": "372922",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["周丽娴 助教(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).周丽娴 助教(高校)"
			}],
			"name": "歌曲欣赏与演唱"
		}, {
			"cid": "SO084",
			"kaikeList": [{
				"bsid": "372924",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": "东中院4-202",
				"startWeek": 1,
				"teacherList": ["韩瑞霞 科学研究人员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n东中院4-202(1-16周).韩瑞霞 科学研究人员"
			}],
			"name": "社会调查研究方法"
		}, {
			"cid": "SO089",
			"kaikeList": [{
				"bsid": "372923",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "东中院4-302",
				"startWeek": 1,
				"teacherList": ["韩瑞霞 科学研究人员"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n东中院4-302(1-16周).韩瑞霞 科学研究人员"
			}],
			"name": "情感与社会"
		}],
		"name": "人文艺术研究院",
		"xyid": "41700"
	}, {
		"courseList": [{
			"cid": "HI033",
			"kaikeList": [{
				"bsid": "372945",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "中院405",
				"startWeek": 1,
				"teacherList": ["盛懿 研究馆员", "欧七斤 副研究馆员(图书)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n中院405(1-16周).盛懿 研究馆员\n中院405(1-16周).欧七斤 副研究馆员(图书)"
			}],
			"name": "交大的历史与文化"
		}],
		"name": "党、校史研究室",
		"xyid": "50120"
	}, {
		"courseList": [{
			"cid": "PS007",
			"kaikeList": [{
				"bsid": "373490",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["杨文圣 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n.(1-16周).杨文圣 副教授(高校思政)"
			}],
			"name": "咨询心理学概论"
		}, {
			"cid": "SO004",
			"kaikeList": [{
				"bsid": "372953",
				"endWeek": 16,
				"fmtTime": "四(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["汪国琴 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期四 第9节--第10节\n.(1-16周).汪国琴 副教授(高校思政)"
			}],
			"name": "情感心理学"
		}, {
			"cid": "SO013",
			"kaikeList": [{
				"bsid": "372864",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院322",
				"startWeek": 9,
				"teacherList": ["高晶鑫 讲师(高校思政)"],
				"time": "(9-16周)\n行课安排为第9周 --- 第16周,其中:\n星期一 第9节--第10节\n上院322(9-16周).高晶鑫 讲师(高校思政)"
			}],
			"name": "大学生成功就业指导"
		}, {
			"cid": "SO018",
			"kaikeList": [{
				"bsid": "372955",
				"endWeek": 11,
				"fmtTime": "五(6-8)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["陈进 副教授(高校思政)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期五 第6节--第8节\n.(1-11周).陈进 副教授(高校思政)"
			}],
			"name": "心理自助"
		}, {
			"cid": "SO046",
			"kaikeList": [{
				"bsid": "372865",
				"endWeek": 8,
				"fmtTime": "四(9-10)",
				"room": "下院310",
				"startWeek": 1,
				"teacherList": ["王业 助理研究员(高教管理)"],
				"time": "(1-8周)\n行课安排为第1周 --- 第8周,其中:\n星期四 第9节--第10节\n下院310(1-8周).王业 助理研究员(高教管理)"
			}],
			"name": "求职礼仪和面试心理调控(B)"
		}, {
			"cid": "SO068",
			"kaikeList": [{
				"bsid": "372866",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "下院512",
				"startWeek": 1,
				"teacherList": ["钱静峰 副教授(高校思政)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n下院512(1-11周).钱静峰 副教授(高校思政)"
			}],
			"name": "职业发展素养与成功就业训练"
		}, {
			"cid": "SO078",
			"kaikeList": [{
				"bsid": "372931",
				"endWeek": 16,
				"fmtTime": "二(11-12)",
				"room": "东下院100",
				"startWeek": 1,
				"teacherList": ["方曦 讲师(高校思政)", "王丽华 讲师(高校思政)", "卢永彬 讲师(高校)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第11节--第12节\n东下院100(1-16周).方曦 讲师(高校思政)\n东下院100(1-16周).王丽华 讲师(高校思政)\n东下院100(1-16周).卢永彬 讲师(高校)"
			}],
			"name": "卓越领导力：成功人生之道"
		}, {
			"cid": "SO301",
			"kaikeList": [{
				"bsid": "372954",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["易晓明 副教授(高校思政)"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n.(1-16周).易晓明 副教授(高校思政)"
			}],
			"name": "日常生活中的心理学"
		}, {
			"cid": "TY001",
			"kaikeList": [{
				"bsid": "372948",
				"endWeek": 11,
				"fmtTime": "四(11-13)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["陈猛 副教授(高校思政)", "孟祥琦 讲师(高校思政)"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期四 第11节--第13节\n.(1-11周).陈猛 副教授(高校思政)\n.(1-11周).孟祥琦 讲师(高校思政)"
			}],
			"name": "“UTJS”体验式教育"
		}, {
			"cid": "TY002",
			"kaikeList": [{
				"bsid": "372952",
				"endWeek": 8,
				"fmtTime": "二(11-13)",
				"room": ".",
				"startWeek": 2,
				"teacherList": ["朱春玲 讲师(高校思政)"],
				"time": "(2-8周)\n行课安排为第2周 --- 第8周,其中:\n星期二 第11节--第13节\n.(2-8周).朱春玲 讲师(高校思政)"
			}],
			"name": "“UTJS”体验式教育——沟通与演讲"
		}, {
			"cid": "XP000",
			"kaikeList": [{
				"bsid": "372500",
				"endWeek": 26,
				"fmtTime": "六(7-8)",
				"room": ".",
				"startWeek": 1,
				"teacherList": ["方曦 讲师(高校思政)"],
				"time": "(1-26周)\n行课安排为第1周 --- 第26周,其中:\n星期六 第7节--第8节\n.(1-26周).方曦 讲师(高校思政)"
			}],
			"name": "通识教育实践活动"
		}],
		"name": "学指委、团委(含学生处、人武部)",
		"xyid": "50500"
	}, {
		"courseList": [{
			"cid": "TH010",
			"kaikeList": [{
				"bsid": "372494",
				"endWeek": 28,
				"fmtTime": "日(1-2)",
				"room": ".",
				"startWeek": 23,
				"teacherList": ["闫成 讲师(高校)"],
				"time": "(23-28周)\n行课安排为第23周 --- 第28周,其中:\n星期日 第1节--第2节\n.(23-28周).闫成 讲师(高校)"
			}],
			"name": "军训"
		}],
		"name": "军事教研室",
		"xyid": "50501"
	}, {
		"courseList": [{
			"cid": "SO032",
			"kaikeList": [{
				"bsid": "372957",
				"endWeek": 11,
				"fmtTime": "二(6-8)",
				"room": "上院104",
				"startWeek": 1,
				"teacherList": ["蔡骏 助理研究员"],
				"time": "(1-11周)\n行课安排为第1周 --- 第11周,其中:\n星期二 第6节--第8节\n上院104(1-11周).蔡骏 助理研究员"
			}],
			"name": "人际沟通艺术与技巧"
		}],
		"name": "医学院",
		"xyid": "70000"
	}, {
		"courseList": [{
			"cid": "BM016",
			"kaikeList": [{
				"bsid": "372946",
				"endWeek": 16,
				"fmtTime": "一(9-10)",
				"room": "上院100",
				"startWeek": 1,
				"teacherList": ["刘金生 副主任医师", "黄晓兰 副主任医师", "林志华 主治医师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期一 第9节--第10节\n上院100(1-16周).刘金生 副主任医师\n上院100(1-16周).黄晓兰 副主任医师\n上院100(1-16周).林志华 主治医师"
			}],
			"name": "大学生健康教育"
		}],
		"name": "校医院",
		"xyid": "80310"
	}, {
		"courseList": [{
			"cid": "BM021",
			"kaikeList": [{
				"bsid": "372947",
				"endWeek": 16,
				"fmtTime": "二(9-10)",
				"room": "上院100",
				"startWeek": 1,
				"teacherList": ["刘金生 副主任医师"],
				"time": "(1-16周)\n行课安排为第1周 --- 第16周,其中:\n星期二 第9节--第10节\n上院100(1-16周).刘金生 副主任医师"
			}],
			"name": "急救与自救"
		}],
		"name": "校医院",
		"xyid": "80510"
	}];
	//可以冲抵通识课的课程 cid和它对应的类型
	var chongdiData = {
		"MA143": "3",
		"EV011": "3",
		"EV007": "2",
		"MA138": "4",
		"CH010": "1",
		"EV009": "3",
		"CH149": "1",
		"CH029": "1",
		"EC407": "2",
		"CH020": "1",
		"CH023": "1",
		"CH144": "1",
		"MU040": "1",
		"MA130": "4",
		"AM061": "2",
		"AM060": "2",
		"LA019": "2",
		"LA018": "2",
		"GE006": "1",
		"CH109": "1",
		"sp205": "3",
		"sp206": "3",
		"AM040": "2",
		"CH100": "1",
		"sp200": "2",
		"sp201": "2",
		"MA165": "3",
		"FI058": "2",
		"BE005": "3",
		"FI057": "2",
		"EI019": "3",
		"EI018": "3",
		"AD022": "3",
		"BM099": "1",
		"CH208": "1",
		"CH207": "1",
		"LA013": "2",
		"LA012": "2",
		"LA015": "2",
		"AM064": "3",
		"AM063": "1",
		"AM062": "2",
		"AD011": "1",
		"DR002": "1",
		"DR001": "1",
		"po202": "3",
		"PH033": "3",
		"PH034": "3",
		"PI001": "3",
		"TO001": "3",
		"PI003": "1",
		"PI005": "1",
		"PI008": "1",
		"AM017": "2",
		"PH030": "3",
		"AM016": "2",
		"ME111": "3",
		"PH044": "3",
		"PI013": "1",
		"AM002": "2",
		"AM001": "2",
		"PI014": "1",
		"PI017": "1",
		"EI228": "3",
		"AM008": "2",
		"AM007": "2",
		"EI227": "3",
		"HI109": "1",
		"PU101": "2",
		"HI102": "1",
		"SC001": "3",
		"PI025": "1",
		"AM030": "2",
		"PI020": "1",
		"AM039": "2",
		"cl211": "2",
		"AM025": "2",
		"AM024": "2",
		"AM023": "1",
		"FI002": "2",
		"AM021": "2",
		"AM020": "3",
		"HI009": "1",
		"HI001": "1",
		"HI003": "1",
		"SL001": "3",
		"HI007": "1",
		"ME030": "3",
		"HI015": "1",
		"JC304": "1",
		"HI010": "1",
		"PS002": "1",
		"BM008": "3",
		"PH008": "3",
		"BM007": "3",
		"HI024": "1",
		"HI025": "1",
		"BM009": "3",
		"HI027": "1",
		"HI028": "1",
		"BM006": "2",
		"HI029": "1",
		"FI453": "2",
		"BE403": "3",
		"PS005": "2",
		"BM011": "3",
		"BM010": "1",
		"BM019": "3",
		"HI034": "1",
		"JC201": "2",
		"HI035": "1",
		"ar001": "1",
		"HI037": "1",
		"HI039": "1",
		"AM100": "2",
		"HI030": "2",
		"HI031": "1",
		"AM108": "2",
		"bi236": "1",
		"PH020": "3",
		"PU047": "2",
		"SP003": "1",
		"SP124": "3",
		"SP245": "3",
		"PU048": "2",
		"SO036": "1",
		"SP004": "1",
		"SP125": "3",
		"SP246": "3",
		"PU045": "2",
		"SP001": "1",
		"SP122": "3",
		"SP243": "3",
		"PU046": "2",
		"SP002": "1",
		"SP123": "3",
		"SP244": "3",
		"PU043": "2",
		"SP120": "3",
		"SP241": "3",
		"SP121": "3",
		"SP242": "3",
		"PU041": "2",
		"SP240": "1",
		"HI045": "1",
		"HI046": "1",
		"PU040": "2",
		"SP009": "3",
		"HI048": "1",
		"SO039": "1",
		"SP007": "2",
		"SP128": "2",
		"SP249": "3",
		"SP008": "3",
		"SP129": "2",
		"ch002": "1",
		"FI313": "2",
		"SP005": "1",
		"SP126": "3",
		"SP247": "3",
		"SO038": "1",
		"SP006": "1",
		"SP127": "3",
		"SP248": "3",
		"HI040": "1",
		"HI041": "1",
		"HI042": "1",
		"HI043": "1",
		"HI044": "1",
		"HU001": "1",
		"PU058": "2",
		"SP113": "4",
		"SP234": "3",
		"PU059": "2",
		"SP114": "3",
		"SP235": "3",
		"PU056": "2",
		"SP111": "3",
		"SP232": "2",
		"PU057": "2",
		"SP112": "3",
		"SP233": "3",
		"PU054": "2",
		"SP230": "2",
		"PU055": "2",
		"SP110": "1",
		"SP231": "3",
		"PU052": "2",
		"PU053": "2",
		"HI056": "1",
		"PU050": "2",
		"HI057": "1",
		"PU051": "2",
		"SP119": "3",
		"BM119": "2",
		"SP117": "2",
		"SP238": "1",
		"SO029": "2",
		"SP118": "3",
		"SP115": "3",
		"SP236": "2",
		"SP116": "1",
		"SP237": "3",
		"HI054": "1",
		"SO057": "1",
		"SP025": "3",
		"SP146": "3",
		"ME048": "3",
		"SP026": "3",
		"SP147": "3",
		"SO055": "1",
		"SP023": "3",
		"SP144": "3",
		"SP024": "2",
		"SP145": "2",
		"SO053": "2",
		"SP021": "3",
		"SP142": "3",
		"FT211": "1",
		"SP022": "4",
		"SP143": "3",
		"PU063": "2",
		"SO051": "2",
		"SP140": "3",
		"PU064": "2",
		"SP020": "3",
		"SP141": "3",
		"PU061": "2",
		"PU062": "2",
		"BI088": "3",
		"ME042": "3",
		"PU060": "2",
		"SP029": "1",
		"JC016": "2",
		"SP027": "3",
		"SP148": "3",
		"JC018": "2",
		"SP028": "2",
		"SP149": "3",
		"PL019": "1",
		"GA306": "1",
		"SO050": "2",
		"SP014": "2",
		"SP135": "3",
		"SP015": "2",
		"SP136": "3",
		"SP012": "3",
		"SP133": "3",
		"SP013": "3",
		"SP134": "3",
		"SP010": "3",
		"SP131": "3",
		"SP252": "3",
		"SO043": "1",
		"SP011": "3",
		"SP132": "3",
		"SP253": "2",
		"AV001": "3",
		"SP130": "3",
		"SP251": "3",
		"PU072": "2",
		"PU071": "2",
		"SP018": "3",
		"SP139": "4",
		"SP019": "3",
		"SP016": "3",
		"SP137": "3",
		"SP017": "3",
		"SP138": "3",
		"PU003": "2",
		"PU004": "1",
		"SP202": "3",
		"SP209": "3",
		"SP207": "3",
		"BI065": "3",
		"SP208": "3",
		"SP203": "3",
		"SP204": "3",
		"CL011": "1",
		"CL010": "1",
		"CL015": "1",
		"CL014": "1",
		"CL013": "1",
		"EN048": "1",
		"PU006": "2",
		"IM002": "3",
		"FT006": "1",
		"SO108": "1",
		"MA500": "4",
		"PU018": "2",
		"SP102": "4",
		"SP223": "3",
		"SP103": "3",
		"SP224": "3",
		"SP100": "3",
		"SP221": "2",
		"SP101": "2",
		"SP222": "2",
		"FT014": "1",
		"PU021": "2",
		"SP220": "1",
		"FT016": "1",
		"BI046": "3",
		"FT018": "1",
		"BI045": "3",
		"BU003": "2",
		"FT017": "1",
		"SP108": "3",
		"SP229": "3",
		"SP106": "1",
		"SP227": "3",
		"BU007": "2",
		"SP107": "3",
		"SP228": "2",
		"SP104": "3",
		"SP225": "3",
		"SP105": "3",
		"SP226": "3",
		"PU029": "2",
		"PU028": "2",
		"PU036": "2",
		"SP212": "3",
		"FT020": "1",
		"PU037": "2",
		"SP213": "3",
		"PU034": "2",
		"SP210": "3",
		"PU035": "2",
		"SP211": "2",
		"PU032": "2",
		"PU033": "2",
		"SO120": "2",
		"PU030": "2",
		"PU031": "2",
		"BI056": "3",
		"BI055": "3",
		"SP218": "1",
		"SP219": "3",
		"SP216": "3",
		"SP217": "2",
		"SP214": "3",
		"SP215": "3",
		"MA601": "4",
		"CL003": "1",
		"CL002": "1",
		"CL001": "1",
		"CL008": "3",
		"CL007": "2",
		"PU038": "2",
		"CL005": "1",
		"PU039": "1",
		"SP089": "2",
		"SP087": "2",
		"SP088": "2",
		"SP085": "3",
		"SP086": "3",
		"BI022": "3",
		"BI027": "3",
		"EC019": "2",
		"ps001": "2",
		"EC018": "2",
		"BI029": "3",
		"EC017": "2",
		"SP083": "3",
		"EC011": "2",
		"SP084": "3",
		"EC010": "2",
		"SP081": "3",
		"SP082": "3",
		"EC016": "2",
		"EC015": "2",
		"SP080": "2",
		"SP078": "3",
		"SP199": "2",
		"SP079": "1",
		"SP076": "3",
		"SP197": "3",
		"SP077": "3",
		"SP198": "3",
		"SP074": "3",
		"SP195": "3",
		"SP075": "3",
		"SP196": "3",
		"BI035": "3",
		"BI034": "2",
		"BI036": "3",
		"EC008": "2",
		"BU002": "2",
		"BU001": "2",
		"EM021": "3",
		"SP072": "3",
		"SP193": "3",
		"SP073": "2",
		"SP194": "2",
		"EN113": "1",
		"SP070": "3",
		"SP191": "3",
		"SP071": "3",
		"SP192": "4",
		"EC005": "2",
		"SP190": "3",
		"BI002": "3",
		"ch304": "2",
		"CS067": "3",
		"SP098": "3",
		"SP099": "3",
		"IO005": "3",
		"SP096": "3",
		"SP097": "3",
		"BU334": "2",
		"BU100": "2",
		"BU463": "2",
		"EC100": "2",
		"PO013": "3",
		"SP094": "3",
		"SP095": "1",
		"SP092": "1",
		"SP093": "1",
		"SP090": "3",
		"SP091": "3",
		"NU003": "3",
		"CL324": "1",
		"SO079": "2",
		"SP047": "4",
		"SP168": "2",
		"SP048": "3",
		"SP169": "3",
		"SP045": "1",
		"SP166": "3",
		"SP046": "3",
		"SP167": "3",
		"SP043": "1",
		"SP164": "3",
		"SP044": "1",
		"SP165": "3",
		"PU085": "1",
		"SP041": "3",
		"SP162": "3",
		"SP042": "3",
		"SP163": "4",
		"PU080": "2",
		"SP049": "3",
		"PM005": "3",
		"CH051": "1",
		"CH050": "1",
		"CH053": "1",
		"SP160": "1",
		"CH052": "1",
		"SP040": "3",
		"SP161": "3",
		"CH054": "1",
		"SO070": "2",
		"CH059": "1",
		"SP036": "2",
		"SP157": "3",
		"SP037": "2",
		"SP158": "3",
		"SO066": "2",
		"SP034": "3",
		"SP155": "3",
		"SP035": "2",
		"SP156": "3",
		"SO064": "1",
		"SP032": "3",
		"SP153": "3",
		"PU099": "2",
		"SO065": "2",
		"SP033": "3",
		"SP154": "3",
		"SO062": "2",
		"SP030": "1",
		"SP151": "3",
		"SO063": "2",
		"SP031": "3",
		"SP152": "3",
		"SP038": "3",
		"SP159": "2",
		"SP039": "3",
		"EV038": "3",
		"EV035": "3",
		"BU320": "2",
		"PM011": "3",
		"CL300": "1",
		"SO061": "1",
		"SP150": "3",
		"CH065": "1",
		"SP069": "1",
		"CH038": "1",
		"SP067": "3",
		"SP188": "3",
		"SP068": "3",
		"SP189": "2",
		"SP065": "1",
		"SP186": "3",
		"SP066": "2",
		"SP187": "3",
		"LI003": "1",
		"SP063": "2",
		"SP184": "1",
		"SP064": "2",
		"SP185": "3",
		"MU136": "1",
		"MU011": "1",
		"MU135": "1",
		"WA001": "2",
		"AR009": "1",
		"SP061": "3",
		"SP182": "3",
		"CI001": "2",
		"SP062": "3",
		"SP183": "3",
		"AR004": "1",
		"SP180": "3",
		"CH032": "1",
		"SP060": "3",
		"SP181": "1",
		"AR006": "1",
		"CH035": "1",
		"AR005": "1",
		"AR008": "2",
		"CH037": "1",
		"SP058": "3",
		"SP179": "3",
		"SP059": "3",
		"SP056": "3",
		"SP177": "3",
		"SP057": "3",
		"SP178": "3",
		"SP054": "3",
		"SP175": "3",
		"SP055": "1",
		"SP176": "3",
		"SP052": "3",
		"SP173": "4",
		"SP053": "3",
		"SP174": "2",
		"MU125": "1",
		"EV020": "2",
		"FM001": "1",
		"CH040": "1",
		"EC307": "2",
		"SP050": "3",
		"SP171": "3",
		"SP051": "3",
		"SP172": "3",
		"CH044": "1",
		"SO080": "2",
		"CH043": "1",
		"SP170": "3",
		"CH045": "1"
	};
	//添加4个虚拟的学院
	xyList.splice(4, 0, {
		xyid: '5',
		name: '抵人文学科',
		courseList: [],
		kaikeList: []
	}, {
		xyid: '6',
		name: '抵社会科学',
		courseList: [],
		kaikeList: []
	}, {
		xyid: '7',
		name: '抵自然科学与工程技术',
		courseList: [],
		kaikeList: [],
	}, {
		xyid: '8',
		name: '抵数学或逻辑学',
		courseList: [],
		kaikeList: []
	});

	//从xyid到xy的map
	var xyMap = {};
	//从bsid到开课的map
	var kaikeMap = {};

	//3重循环 制作出 xyMap kaikeMap
	for (var i = 0; i < xyList.length; ++i) {
		var xy = xyList[i];
		xyMap[xy.xyid] = xy;
		var kaikeList = xy.kaikeList = [];
		for (var j = 0; j < xy.courseList.length; ++j) {
			var course = xy.courseList[j];
			course.xy = xy;
			for (var k = 0; k < course.kaikeList.length; ++k) {
				//在这里将course的数据加到kaike上
				var kaike = course.kaikeList[k];
				kaike.course = course;
				kaike.name = course.name;
				kaike.url = xzc.urls.kaikeinfo + kaike.bsid;
				kaikeList.push(kaike);
				kaikeMap[kaike.bsid] = kaike;
				//如果这门开课可以冲抵xx课程...
				var chongdiType = chongdiData[course.cid];
				if (chongdiType) {
					kaike.chongdiType = chongdiType;
					xyList[3 + parseInt(chongdiType)].kaikeList.push(kaike);
				}
			}
		}
	}

	var myCollectionMap = window.localStorage.getItem('myCollectionMap');
	if (myCollectionMap)
		myCollectionMap = JSON.parse(myCollectionMap);
	else {
		//默认没有收藏
		myCollectionMap = {};
		_.each(xyList, function (xy) {
			myCollectionMap[xy.xyid] = false;
		});
	}
	var my = {
		xyid: 0,
		name: '我的收藏',
		kaikeList: []
	};
	xyList.unshift(my);

	var xySelectionMap = window.localStorage.getItem('xySelectionMap');
	if (xySelectionMap)
		xySelectionMap = JSON.parse(xySelectionMap);
	else {
		//默认所有都可见
		xySelectionMap = {};
		_.each(xyList, function (xy) {
			xySelectionMap[xy.xyid] = true;
		});
	}

	//恢复每个学院的可见
	for (var i = 0; i < xyList.length; ++i) {
		var xy = xyList[i];
		xy.visible = xySelectionMap.length == 0 || !!xySelectionMap[xy.xyid];
	}

	//恢复每个开课的收藏
	for (var bsid in kaikeMap) {
		var kaike = kaikeMap[bsid];
		if (myCollectionMap[bsid]) {
			kaike.collected = true;
			my.kaikeList.push(kaike);
		} else
			kaike.collected = false;
	}

	//页面关闭的时候保存数据
	$(window).unload(function () {
		//如果被请求清空缓存 那么就清空
		if (window.clearCache) {
			window.localStorage.removeItem('xySelectionMap');
			window.localStorage.removeItem('myCollectionMap');
		} else {
			//保存每个学院的可见
			for (var i = 0; i < xyList.length; ++i) {
				var xy = xyList[i];
				xySelectionMap[xy.xyid] = xy.visible;
			}
			//保存开课的收藏
			for (var bsid in kaikeMap) {
				var kaike = kaikeMap[bsid];
				myCollectionMap[bsid] = kaike.collected;
			}
			window.localStorage.setItem('xySelectionMap', JSON.stringify(xySelectionMap));
			window.localStorage.setItem('myCollectionMap', JSON.stringify(myCollectionMap));
		}
	});
	
	//导出
	exports.xyList = xyList;
	exports.my = my;
});